{"patent_number": "US-4190885-A", "publication_id": 68798634, "family_id": 25340241, "publication_date": "1980-02-26", "titles": [{"lang": "EN", "text": "Out of store indicator for a cache store in test mode"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"docdb\" mxw-id=\"PA9230438\" source=\"translation\"><p>A Data Processing System comprises a central processor unit, a main memory and a cache, all coupled in common to a system bus. The central processor unit is also separately coupled to the cache. Apparatus in cache is responsive to signals received from the central processor unit to initiate a test and verification mode of operation in cache. This mode enables the cache to exercise various logic areas of cache and to indicate to the central processor unit hardware faults.</p></abstract>"}, {"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA36195123\"><p>A Data Processing System comprises a central processor unit, a main memory and a cache, all coupled in common to a system bus. The central processor unit is also separately coupled to the cache. Apparatus in cache is responsive to signals received from the central processor unit to initiate a test and verification mode of operation in cache. This mode enables the cache to exercise various logic areas of cache and to indicate to the central processor unit hardware faults.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"1\"><claim-text>1. A data processing system comprising:<claim-text>a system bus;</claim-text><claim-text>an addressable main memory coupled to said bus, said main memory including a plurality of sets of word locations, each set of word locations being defined by an address, and a number of said word locations storing a plurality of test and verification instructions and data words;</claim-text><claim-text>a central processor unit (CPU) coupled to said bus, said CPU including means for generating requests to said main memory for read out of said test and verification instructions on said system bus;</claim-text><claim-text>a cache coupled to said bus and said CPU, said cache including:</claim-text><claim-text>a data buffer having a plurality of word locations arranged in a plurality of sets of word locations defined by said column addresses for storing duplicates of said data words;</claim-text><claim-text>a directory having a plurality of word locations corresponding to the number of sets of word locations in said data buffer, said directory word locations being addressable by said column addresses, each word location of said directory storing a row address of one of a corresponding one of said words of said set stored in said data buffer, said data buffer and normally storing said duplicates of said data words on transfer from main memory when requested by cache requests;</claim-text><claim-text>said cache further including means responsive to said test and verification instructions, said means including:<claim-text>mode control means coupled to said system bus; and,</claim-text><claim-text>no hit fault means coupled to said system bus and said mode control means;</claim-text></claim-text><claim-text>said CPU including means operative in response to a first of said test and verification instructions, for generating a plurality of signals for transfer to said bus, a first signal of said plurality of signals switching said mode control means from a reset state to a first state;</claim-text><claim-text>said no hit fault means, including means responsive to said mode control means in said first state and conditioned by the remainder of said plurality of signals when properly coded for setting said no hit fault means to a first state;</claim-text><claim-text>said CPU including means for normally forcing successive cache request signals to a first state from a reset state for causing the transfer of each of said duplicates of data words from successive word locations in said data buffer cache to said CPU;</claim-text><claim-text>said no hit fault means in said first state being responsive to said cache request signals and to a signal indicative of the failure of said cache directory to cause a readout of a specified row address stored in a specified column address of said cache directory as specified by said CPU for generating a no memory signal, said CPU being responsive to said no memory signal for indicating a hardward failure associated with said column address of said cache directory.</claim-text></claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"2\"><claim-text>2. The system of claim 1 where in said cache further includes bypass cache means coupled to said system bus and to said mode control means, said CPU including means responsive to a second of said test and verification instructions to generate said first signal for making said mode control means operative in said first state, and said bypass cache means in a second state including means responsive to said mode control means in said first state and to the remainder of said plurality of signals when coded in a first manner to set said bypass cache means to a first state so as to indicate to said CPU that said cache is operative for processing said CPU requests for data, and said bypass cache means in said first state including means responsive to said mode control means in said first state and to the remainder of said plurality of signals coded in a second manner to set said bypass cache means to said second state so as to indicate to said CPU that said cache is inoperative for processing said CPU requests for data.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim num=\"3\"><claim-text>3. The system of claim 2 wherein said bypass cache means including means responsive to said no memory signal for switching said bypass cache means to said second state from said first state for signalling that said cache is inoperative when said no memory signal is in a first state, thus indicating that the data specified by said CPU request is not stored in said data buffer which is indicative of a fault condition.</claim-text></claim>"}, {"num": 4, "parent": 2, "type": "dependent", "paragraph_markup": "<claim num=\"4\"><claim-text>4. The system of claim 2 wherein said cache further includes cache initialization means coupled to said system bus and said mode control means, said CPU being responsive to a third of said test and verification instructions to generate said first signal for making said mode control means operative in said first state, and said cache initialization means being responsive to said mode control means and said plurality of signals when coded to request the read out of said data words from successive word locations of said main memory for writing said data words into said storage locations of said data buffer as part of the test and verification operation.</claim-text></claim>"}, {"num": 5, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"5\"><claim-text>5. The system of claim 1 wherein said cache further includes means coupled to said system bus for generating an acknowledge signal is response to receipt of said plurality of signals from said CPU.</claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim num=\"6\"><claim-text>6. The system of claim 5 wherein said mode control means comprise:<claim-text>a bistable circuit element including set, reset, and clock input terminals, said bistable element being switched from a reset state to a first state by said acknowledge signal applied to said clock input terminal and in response to said first signal specifying a test and verification operation being applied to said set terminal, and</claim-text><claim-text>said bistable element being switched from said first state to said reset state when another one of said signals generated by said CPU which is applied to said reset terminal switches to a predetermined state, said bistable element when in said first state conditioning said no hit fault means.</claim-text></claim-text></claim>"}, {"num": 7, "parent": 5, "type": "dependent", "paragraph_markup": "<claim num=\"7\"><claim-text>7. The system of claim 5 wherein said no hit fault means comprises:<claim-text>a bistable circuit element including set, reset and clock input terminals, said bistable element clock terminal being responsive to said mode control means in said first state, and the remainder of said plurality of signals coded to set said no fault means are applied to said set terminal to set said bistable element to said first state,</claim-text><claim-text>said bistable element when in said first state generating a test mode signal, and conditioning logic means for combining said test mode signal with said cache request signal in said first state and said signal indicative of the failure of said cache directory to find said row address for generating said no memory signal to said CPU indicating said hardware failure;</claim-text><claim-text>said bistable element being switched from said first state to a reset state in response to said cache request signal in said reset state being combined with said signal indicative of the failure of said cache directory to find said row address being applied to said reset terminal of said bistable element for switchinhg said bistable element from said first state to said reset state.</claim-text></claim-text></claim>"}, {"num": 8, "parent": 7, "type": "dependent", "paragraph_markup": "<claim num=\"8\"><claim-text>8. The system of claim 7 wherein said logic means includes a NAND logic circuit having a plurality of input terminals and an output terminal, a first one of said input terminals being enabled by said test mode signal,<claim-text>a second one of said input terminals being enabled by a signal corresponding to said request signal in said first state; and</claim-text><claim-text>a third one of said input terminals being enabled by said signal indicative of the failure of said cache directory to find said row address,</claim-text><claim-text>said output terminal being coupled to said CPU to send said no memory signal to said CPU indicating that said data requested by said CPU is not stored in said data buffer during said test and verification operation.</claim-text></claim-text></claim>"}, {"num": 9, "parent": 8, "type": "dependent", "paragraph_markup": "<claim num=\"9\"><claim-text>9. The system of claim 8 wherein said bypass cache means comprises:<claim-text>a third bistable circuit element including preset, set, clock and reset input terminals, said third bistable element being switched from a reset state to a first state by an output of said mode control means when in its first state being applied to said clock terminal and when said set terminal is conditioned by another of said signals generated by said CPU, and said third bistable element being switched from said first state to a reset state in response to said no memory signal to said CPU indicating that said data requested by said CPU is not stored in said data buffer during said test and verification operation, said third bistable element when in said reset state being switched to said first state by said cache initialization means being applied to said preset terminal;</claim-text><claim-text>said third bistable element when in said first state generating a signal indicating that said cache is operative.</claim-text></claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES316653534\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>RELATED APPLICATIONS</h4><p>The following patent applications which are assigned to the same assignee as the instant application have been filed on an even date with the instant application and contain related subject matter.</p><p></p><pre listing-type=\"tabular\" xml:space=\"preserve\"><!--Greenbook tabular data-->______________________________________                                    \n                               SERIAL                                     \nTITLE             INVENTOR(S)  NO.                                        \n______________________________________                                    \n1.  FIFO Activity Queue                                                   \n                      T. Joyce     863,091                                \n    For a Cache Store                                                     \n2.  Round Robin Replacement                                               \n                      T. Joyce     863,102                                \n    for Cache Store                                                       \n3.  Continuous Updating of                                                \n                      T. Joyce     863,092                                \n    Cache Store       T. Holtey                                           \n                      W. Panepinto, Jr.                                   \n4.  High Speed Buffer Memory                                              \n                      T. Joyce     863,095                                \n    System with Word Prefetch                                             \n                      T. Holtey                                           \n5.  Word Oriented High Speed                                              \n                      T. Joyce     863,093                                \n    Buffer Memory System                                                  \n                      T. Holtey                                           \n    Connected to a System Bus                                             \n                      W. Panepinto, Jr.                                   \n6.  Initialization of T. Joyce     863,094                                \n    Cache Store       W. Panepinto, Jr.                                   \n7.  Multi Configurable Cache                                              \n                      T. Joyce     863,098                                \n    Store             T. Holtey                                           \n8.  Private Cache to CPU                                                  \n                      T. Joyce     863,097                                \n    Interface In A Bus                                                    \n                      T. Holtey                                           \n    Oriented System                                                       \n______________________________________                                    \n</pre><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>This invention relates generally to minicomputing systems and more particularly to the test and verification of storage hierarchies having a high speed, low capacity storage device coupled to lower speed high capacity storage devices.</p><p>2. Description of the Prior Art</p><p>Data processing systems frequently have a high speed buffer memory or cache store between a central processor unit (CPU) and a main memory. The CPU in normal operation requests information from the cache. If the information is not stored in cache, then the information is requested of main memory. The system objective is to have a high percentage of information requested by the CPU found in the high speed cache rather than in the slower speed main memory. This results in improved overall system performance.</p><p>Since the cache is normally invisible to the software during normal operation many malfunctions in the cache will not show up as system faults since the information is retrieved from main memory if cache doesn't respond to the CPU request. The system will therefore not operate at its throughput.</p><p>Prior art systems use software diagnostics to check out the cache. These diagnostics under CPU control write known data into cache, then read the cache with the CPU verifying the data. Unfortunately cache malfunctions result in the information being read from main memory. To overcome this more elaborate diagnostics are written to transfer information from main memory to cache, turn cache off and rewrite that section of main memory with different information, then read cache and compare it against the original information from main memory. The disadvantages of the elaborate software diagnostic procedures are overcome by the apparatus of this invention.</p><h4>OBJECTS OF THE INVENTION</h4><p>It is an object of the invention to provide improved test and verification operation of the cache system.</p><p>It is another object of the invention apparatus to improve the testing of the directory and associated logic circuitry.</p><p>It is still another object of the invention to provide apparatus in the cache for improved control by the central processor unit during the test and verification operation.</p><h4>SUMMARY OF THE INVENTION</h4><p>The Test and Verification (T and V) operation uses two types of Central Processor instructions. These instructions are stored in main memory to perform the desired cache Test and Verification sequences.</p><p>The first type of instruction, the Copy A to Register (CAR) Instruction, generates five types of instructions which set the hardware features of the invention. The second type of instruction, the Copy Register to A (CRA) instruction, generates two types of instructions that use the cache hardware features of the invention.</p><p>The central processor unit, in response to the CAR instruction, generates one of five sets of signals over the system bus. The cache is responsive to these sets of signals to generate the five types of Test and Verification instructions as follows:</p><p>The Bypass Cache instruction conditions cache to indicate to the CPU to direct its read requests directly to main memory. Cache will also not update the cache memory, i.e., a cache directory and a cache data buffer.</p><p>Cache is placed in the bypass state, in the Test and Verification mode, when CPU instructions are being transferred from main memory to the CPU. The cache is also placed in the bypass state when the CPU receives a No Hit Fault indication from cache. This assures that the cache retains its information while the CPU takes further diagnostic action--not further described since the diagnostic action is not a part of the invention.</p><p>The Reset Bypass Cache instruction conditions cache to indicate to the CPU that the cache will accept read requests for data from the CPU and that the cache will update the directory and data buffer. Cache is placed in the Reset Bypass Cache mode to accept data from main memory.</p><p>The Initialize Cache instruction completely loads cache with data from successive word locations in main memory starting with a predetermined word location of main memory. This instruction differs from the Quality Logic Test (QLT) mode which is operative during the system startup or initialization procedure to automatically load all of the address locations in cache unit information from successive main memory locations. The cache remains operative. The cache is in a bypass condition when the initialize cache instruction is terminated. This allows further instructions to be requested by the CPU directly from main memory without being written into cache. The QLT mode is described infra. The CPU uses the initialize instruction in the no hit fault mode to test the directory and its associated logic.</p><p>The Set No Hit Fault instruction conditions the cache to send a signal to the CPU if data requested of cache by the CPU is not stored in cache. This signal causes the CPU to take diagnostic action as above. Cache immediately sets itself in the bypass mode.</p><p>The Reset No Hit Fault instruction is processed by the CPU when the no hit fault operation is completed and signals are sent to cache from the CPU to reset the no hit fault mode. The two types of CRA instructions are available to the central processor unit for testing cache, a Load Cache Memory instruction and a store cache memory instruction.</p><p>The Load Cache Memory instruction controls the transfer of information from main memory to cache and terminates the operation by setting cache in the bypass mode by means of the Bypass Cache instruction.</p><p>The Store Cache Memory instruction initiates the Reset Bypass instruction and the No Hit Fault instruction to transfer the contents of cache to main memory. The Central Processor receives an indication if a word previously written during the Load Cache Memory mode is not found in cache. The central processor unit may also verify that the information written into cache from main memory during the Load Cache Memory instruction operation is the same as the information read from cache and written into a different area of main memory during the Store Cache Memory instruction operation. Whereas when the system processes the CAR instruction, the Initialize Cache instruction is used to completely load the cache with successive information stored in main memory starting from a first predetermined address location, when processing the CRA instruction, the initialize Cache instruction is used to start the loading of cache from a second predetermined address location in main memory and to stop the loading of cache by having the central processor unit send the Bypass Cache instruction to cache. This allows the central processor unit to isolate a particular error to a cache memory address location.</p><p>The CRA instruction uses several of the CAR instruction types. The apparatus of the invention in cache includes a mode control flop (50), which sets in response to signals on the system bus, indicating that cache is starting a test and verification sequence.</p><p>The central processor unit may initiate an Initialization sequency by sending a singal (BSDT 12) over the bus which sets the Quality Logic Test flop (571 FIG. 5). This loads cache from main memory as described in Related Application \"Initialization of a Cache Store\", Ser. No. 863,093.</p><p>The central processor may in a similar manner place the cache off line by resetting a bypass cache flop (59).</p><p>The central processor may then place the cache in a No Hit Fault mode by setting the No Hit Fault flop 52. The central processor unit may then request successive main memory addresses of cache and receive an indication if that memory address location had been previously stored in cache. The central processor sends main memory addresses to cache that should result in a \"Hit\", that is, that main memory address location is stored in cache. In this case, a \"No Hit\" signal (logic signal CNOMEM--the output of NAND gate 55) would indicate to the central processor unit an error in either the cache directory or the round robin logic. This is described in Related Application \"Round Robin Replacement for Cache Store\", Ser. No. 863,102.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a block diagram of the overall system;</p><p>FIG. 2 is a block diagram of the cache system;</p><p>FIG. 3 is a logic circuit diagram of Clock Control and FIFO R/W Control;</p><p>FIG. 4 is a logic circuit diagram of AOR and RAF Control, the RAF Write Address Counter and the RAF Read Address Multiplexer;</p><p>FIG. 5 is a logic circuit diagram of Cycle Control and System Bus Control;</p><p>FIG. 6 is a logic circuit diagram of the round robin operation;</p><p>FIG. 7 is a timing diagram of the Quality Logic Test operation;</p><p>FIG. 8 shows the system bus formats;</p><p>FIG. 9 is a flow diagram illustrating the Quality Logic Test operation;</p><p>FIG. 10 is a circuit diagram of the Test and Verification logic;</p><p>FIG. 11 is a flow diagram illustrating the Test and Verificatiion operation; and</p><p>FIG. 12 is a timing diagram of the Test and Verification operation.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><h4>OVERALL SYSTEM</h4><p>FIG. 1 is a block diagram of a minicomputer system which comprises a central processor unit (CPU) 2, a main memory 3, an input/output multiplexer (IOM) 7, a system bus 5, a cache directory and data buffer (cache) 1 and a system support channel (SSC) 8. Not shown are the normal complement of standard peripherals connected to the system by SSC 8. With the exception of SSC 8, each unit couples to the system bus 5 via an interface signal bus 4; SSC 8 couples to the IOM 7 through input/output (I/O) bus 9. In addition, CPU 2 and cache 1 are interconnected by a private interface signal bus 6. IOM 7, I/O bus 9 and SSC 8 are not pertinent to the invention and will not be described in detail.</p><p>CPU 2 is designed for use as a communications network processor and is a firmware controlled 20 bits per word binary machine. Main memory 3 can be added to the system in modules of 32,768 words up to a maximum of 8 modules or 262,144 words. Main memory 3 is made up of random access MOS chips with 4,096 bits stored in each chip and has a read/write cycle time of 550 nanoseconds. Cache 1 provides an intermediate high speed storage with a maximum read/write cycle time of 240 nanoseconds. CPU 2 requests a data word from cache 1 over private interface 6 and obtains the data word if in cache 1 in 110 nanoseconds over private interface bus 6. If the requested data is not in cache 1, then CPU 2 receives the data via main memory 3, bus 5, cache 1 and bus 6 in 960 nanoseconds. If cache 1 was not in the system, then the CPU 2/main memory 3 read access time is 830 nanoseconds. Using the prefetch techniques of this invention assures that in most cases over 90% of the requested data words are stored in cache 1 thereby greatly increasing the throughput of the system using cache 1 over a system without cache 1. System bus 5 permits any two units on the bus to communicate with each other. To communicate, a unit must request a bus 5 cycle. When the bus 5 cycle is granted, that unit may address any other unit on bus 5. I/O bus 9 is identical to system bus 5 in performance and in signal makeup. IOM 7 controls the flow of data between bus 5 and the various communications and peripheral controllers of the system via I/O bus 9. SSC 8 is a microprogrammed peripheral controller which provides control for various devices (not shown). Other controllers (not shown) may also connect to I/O bus 9.</p><p>CPU 2 updates data in main memory 3 by sending the data word with its main memory 3 address and the appropriate control signals out on bus 5. Cache 1, since it reads all information on bus 5 into a register in cache 1 will be updated if that data word location is stored in cache 1. This assures that information stored at each address location in cache 1 is the same as information stored at the corresponding address location in main memory 3.</p><p>CPU 2 requests data from cache 1 by sending the requested address (PRA) over private interface 6 to cache 1. If the data is stored in cache 1, the requested data is sent back to CPU 2 from cache 1 over private interface 6. If the requested data is not in cache 1, cache 1 requests the data of main memory 3 over bus 5 and in addition cache 1 requests three additional data words from address locations PRA+1, PRA+2 and PRA+3 for the interleaved memory or one additional word of data from address location PRA+1 for the banked memory. When the data words are received from main memory 3 over bus 5 by cache 1, they are written into cache 1 and the requested data word is sent from cache 1 to CPU 2 over private interface 6.</p><h4>CACHE SYSTEM</h4><p>FIG. 2 shows the cache 1 system which includes a bus interface unit 10, a replacement and update unit 11, a cache directory and data buffer unit 12, an address control unit 13 and a private cache-CPU interface unit 16. FIG. 2 is made up of 4 sheets. The information flow is best seen with sheet 2 at the left, sheet 1 on the right, sheet 3 below sheet 1 and sheet 4 below sheet 3.</p><h4>BUS INTERFACE UNIT 10--FIG. 2, Sheet 1</h4><p>Bus interface unit 10, FIG. 2, comprises drivers 212, 214 and 218, receivers 213, 215 and 217, and system bus control logic unit 219 and Test and Verification Logic Unit 240.</p><p>Bus interface unit 10 connects to bus 5 through interface signal bus 4. Bus 5, interface signal bus 4 and system bus control 219 are disclosed by U.S. Pat. Nos. 3,993,981 entitled \"Apparatus For Processing Data Transfer Requests In A Data Processing System\", and 4,030,075 entitled \"Data Processing Systems Having Distributed Priority Network\" and will be described herein only as necessary to provide continuity to the description.</p><p>The 18 address leads BSAD05-22 are connected between bus 5 and the junction of the driver 212 and the receiver 213 of bus interface unit 10. The ouput of receivers 213, 215 and 217 connect to a First-In-First-Out (FIFO) buffer 203. The 20 bit data word lines BSDT A, B, 00-15, BSDP 00, 08 are connected to the junction of the driver 214 and receiver 215. A number of control signal lines are connected to the junction of the driver 218 and the receiver 217. These control logic signals Bus request BSREQT, data cycle now BSDCNN, bus acknowledge BSACKR, bus wait BSWAIT, BSAD 23, second half bus cycle BSSHBC and bus double pull BSDBPL input system bus control 219 through receiver 217 and are distributed to other logic control units which will be described infra as well as being sent out on bus 5 through driver 218.</p><p>The My Data Cycle Now logic signal MYDCNN- connects between System Bus Control 219 and drivers 212, 214 and 218.</p><p>Signal bus BSAD 08-17, the output of receiver 213, connects to Cycle Control 232 of the Replacement and Update Unit 11. The output of an address register (AOR) 207 18 bit address BAOR 05-22 in the address control unit 13 connects to the input of driver 212. Cache identification code 0002<sub>8</sub> and function code 00<sub>8</sub> or 01<sub>8</sub> are encoded on the input of a driver 214 whose output is connected to the bus 5 data lines BSDT A, B, 00-15. Logic circuit signals described infra are connected between other units of cache 1 and system bus control 219.</p><p>Control logic signals Bus Master Clear, BSMCLR and Second Half Bus Cycle, BSSHBC, connect to Test and Verification Logic 240. Data bus BSDT 08, 09, 10, 12, 14 and 15 connect between Receiver 215 and T&amp;V Logic 240. Logic signals CACHRQ+, CNOMEM- and CACHON- connect between Cache- CPU Interface Unit 6 and T&amp;V Logic 240. Logic signals MEMREQ+ and MYACKR connect to T&amp;V Logic 240.</p><p>The receiver driver pairs 212 and 213, 214 and 215, and 217 and 218 are 26S10 circuits described on page 4-28 of the catalog entitled \"Schottky &amp; Low Power Schottky Bipolar Memory, Logic &amp; Interface\" Published by Advanced Micro Devices, 901 Thompson Place, Sunnyvale, Calif. 94086.</p><h4>ADDRESS CONTROL UNIT 13--FIG. 2, sheet 2</h4><p>Address control unit 13 includes the address register AOR 207, the replacement address file RAF 206, an adder 211, an AND gate 236, an EXCLUSIVE OR gate 237, a 2:1 MUX 209, the read address multiplexer 233, a write address counter 234, and an AOR and RAF control unit 235. CPU2 address signal lines BAOR 05-22+ connect between interface 6 and one input of 2:1 MUX 209. Logic signal MEMREQ- and CYQLTO- connect between cycle control 232 and inputs to a NAND 241 whose output connects to the select input of 2:1 MUX 209. The output of adder 211 signal lines AOR 05-22+ connects to the other input of 2:1 MUX 209 whose output signal lines BAOR 05-22 connects to the inputs of AOR 207 and RAF 206. Signal bus 05-22 +10 connects between the output of AOR 207 and the inputs to adder 211 and driver 212. AOR 207 is organized as an 18 bit register made up of conventional flops. RAF 206 is organized as four 18 bit registers and is designed using the aforementioned random access memory chips 74 LS 670. The logic signals ADDRR0 and ADDRR1 connect between the write address counter 234 and RAF 206, AOR and RAF control 235, AND gate 236 and EXCLUSIVE OR gate 237. Logic signal CYQLTO- connects between cycle control 232 and inputs to AND 236 and a NAND 241. The output of AND 236 connects to the +2 terminal of ADDER 211. The output of EXCLUSIVE OR 237 connects to the input of OR 240 whose output connects to the +1 terminal of ADDER 211. Logic signal CYQLTO+ connects between cycle control 232 and the other input of OR 240. Logic signals ADDRWD+0B and ADDRWD+0A connect between the read address multiplexer 233 and RAF 206. An AORCNT logic signal connects between AOR and RAF control 235 and write address counter 234. Logic signals BAWRIT and BAORCK connect between AOR and RAF control 235 and RAF 206 and AOR 207 respectively. address to send out on bus 5 to main memory 3 in a format 8b of FIG. 8 during a first memory request cycle. AOR 207 is then loaded with PRA+1 which is the memory request address sent out on bus 5 to main memory 3 in a format 86 of FIG. 8 during the second memory request cycle. RAF 206 is loaded with PRA, PRA+1, PRA+2 and PRA+3 in successive locations under control of write address counter 234, adder 211 and AOR and RAF control 235. These addresses are supplied to the address field of LR 204 when information in a format 8c of FIG. 8 are sent from main memory 3 to cache 1 over bus 5. For the banked memory operation, the address control unit 13 logic loads AOR 207 with PRA, the CPU2 memory request address which is sent out on bus 5 to main memory 3 in a format 8b of FIG. 8 during the memory request cycle. RAF 206 is loaded with PRA and PRA+1 in successive locations under control of the write address counter 234. These addresses are supplied to the address field of LR204 when information in a format 8c of FIG. 8 are sent from main memory 3 to cache 1 over bus 5. The read address multiplexer 233 selects the RAF 206 address location to be read out of LR 204 for each main memory 3 response over bus 5 to the read request of cache 1. The adder 211 output signal lines AORO 05-22+ provide the address stored in AOR 207 incremented by +1 or +2 under control of AND 236 and 237. If the write address counter 234 is set at location 03, logic signals ADDRR0+ and ADDRR1+ are high, therefore AND 236 enables the +2 input of adder 211. If the write address counter is set at locations 01 or 02 then the output of EXCLUSIVE OR 237 enables the +1 input to adder 211. The adder 211 is a 74 283 logic circuit described on page 7-415 of the aforementioned TTL Data Book.</p><p>During the QLT mode the logic signal CYQLTO- input to AND 236 is low keeping the +2 input to ADDER 211 low. Logic signal CYQLTO+, the input to AND 240 enables the +1 input to ADDER 211. CPU2 includes an A Register 2a, an Index Register 1 2b, and Index Register 2 2c and an Index Register 2d. These registers are conventional in their design and use herein. They are included in the specification soley for the purpose of providing continuity to description of operation.</p><h4>REPLACEMENT AND UPDATE UNIT 11--FIG. 2, Sheet 3</h4><p>The replacement and update unit 11 FIG. 2 includes the FIFO buffer 203, a local register (LR)204, buffer bypass drivers 205, FIFO R/W control 230, clock control 220 and cycle control 232.</p><p>Replacement and update unit 11 receives from Bus Interface Unit 10 the 18 bit update address BSAD 05-22, the 20 bit data work BSDT A, B, 00-15, BSDP 00, 08 and control signals all of which connect between FIFO 203 and their respective receivers 213, 215 and 217. An 18 line replacement address signal bus AOR 05-22 connects between the input of LR 204 and a replacement address file (RAF)206 output in address control unit 13. Signal busses FIFO 00-17, FIFO 19-38 and FIFO 18, 39-43 connect between the FIFO 023 output and LR 204 input. Also connected between the replacement and update unit 11 and the other units of cache 1 are control signals described infra.</p><p>A 20 bit data word signal bus DATA 00-19+ connects between the output of the buffer bypass driver 215 unit and a junction 216 in cache directory and data buffer unit 12. The 18 line update or replacement address signal bus FIFO 00-17+ connect between the output of LR 204 and one input of 2:1 MUX 208, and the 20 bit data output signal lines DATA 00-19- connect between the output of LR 204 and a cache data buffer 201. Read address counter output logic signal FRADDR and FRBDDR connect between FIFO R/W Control 230 and FIFO 203 as do write address counter output FWADDR and FWBDDR and Write Strobe signal FWRITE. Logic signal CYFIFO connects between FIFO R/W control 230, cycle control 232 and LR 204. Logic Signal FIFO 41+ connects between the FIFO bit position 41 output of FIFO 203 and FIFO read enable terminals for FIFO 00-17. Logic Signals FIFO 41- connect between the FIFO bit position 41 output of FIFO 203 and the RAF 206. FIFO 18, 42 and 43 connect between a Read Address Multiplexer 233 and their respective bit position outputs of FIFO 203. Logic Signal MEMREQ+ connects between cycle control 232, system bus control 219 and a 2:1 MUX 209 switch. CLOCK0+ connects between Clock Control 220, cycle control 232 and other logic units described infra. Logic signal NO HIT+ connects between FIFO R/W control 230, cycle control 232 and NAND 231 of cache directory and data buffer Unit 12. Logic signal REPLACE connects between the LR 204 output, a 2:1 MUX 223 switch and a Round Robin 224 logic unit. Logic signal FEMPTY- connects between FIFO R/W control 230 and Clock Control 220. Logic signal CACHRQ+ connects between interface 6 and Clock Control 220 and logic signal CYCADN- connects to interface 6 from cycle control 232.</p><p>FIFO 203 is organized as four 44-bit registers made up of random access memory chips 74LS 670 described on page 7-526 of the TTL Data Book for Design Engineers, second edition, copyright 1976 by Texas Instruments of Dallas, Texas. LR 204 is a 44 bit register made up of conventional flops using conventional design techniques. Address, data and control information are gated by logic signal busses FIFO 00-17, FIFO 19-38 and FIFO 18, 39-43 respectively. FIFO 19-38, the data signal bus is gated through buffer bypass drivers 205 by logic signal INTERG+ going high. Buffer bypass drivers 205 are made up of 74 367 circuits described on page 5-69 of the aforementioned TTL Data Book. FIFO R/W control 230 provides read address counter signals FRADDR and FRBDDR, write address counter signals FWADDR and FWBDDR, and a write strobe FWRITE to select the FIFO 203 registers for reading and writing. A FEMPTY- signal going high indicating that the FIFO buffer is not empty starts CLOCK0+ cycling in clock control 220. A FIFO 41+ signal low indicates that the LR 204 18 bit address field LR 0-17 will be filled from RAF 206 over the 18 line AOR 05-22 signal bus.</p><p>The replacement cycle is operative in response to the CPU 2 memory request logic signal CACHRQ+. If the requested information is not in cache 1, a request for the information is sent by cache 1 to main memory 3 over bus 5. The requested information coming back from main memory 3 over bus 5 is sent to CPU2 and written into data buffer 201. This operation is called replacement.</p><p>Cache 1 reads all information on bus 5 into FIFO 203. If that information was to update main memory 3, then cache 1 checks to see if that main memory 3 address location is stored in the data buffer 201. If the information address location is stored in the data buffer 201, then the data word in that location is updated with the new information data word. This operation is called update. Co-pending related applications 1 and 3 listed supra disclose the FIFO 203 operation and the update operation in more detail.</p><h4>CACHE DIRECTORY AND DATA BUFFER 12--FIG. 2, sheet 4</h4><p>The cache directory and data buffer 12 comprises the data buffer 201, the directory 202, 4 comparators 221a-d, the 2:1 MUX 208, a round robin 224 logic unit, a 2:1 MUX 223, 18 inverters 225, 20 NAND gates each of 251a-t, 252a-t, 253a-t, and 254a-t, an AND gate 231 and the junction 216.</p><p>Signal busses are coded as follows in the specification and figures. For example, for row address ADDR 00-07-10, ADDR is the signal name. ADDR 00-07 refers to the 8 signal leads labeled ADDR 00, ADDR 01 . . . ADDR07. ADDR 00-07- indicates that the signals are low if they indicate a \"1\" and high if they indicate a \"0\". ADDR 00-07-10 indicates that this signal bus 10 of 8 bit row address ADDR 00-07-.</p><p>Main memory 3 address BAOR 05-22+ signal lines connect between bus 6 and one input of 2:1 MUX 208 of the cache directory and data buffer unit 12. Address signal lines FIFO 00-17+, connect between the output of LR204 and the other input of 2:1 MUX 208. 2:1 MUX 208 output signal bus ADDR 00-17+ connects to 18 inverters 225 whose output ADDR 00-17-10 splits into row address ADDR 00-07-10 and column address ADDR 08-17-10. Row address ADDR 00-07-10 connects to directory 202 and to one input each of 4 comparators 221a-d. Column address ADDR 08-17-10 connects to the data buffer 201, directory 202 and column address ADDR 08-17+ connects to round robin 224. Row addresses ADDR 00-07-20, -21, -22 and -23 connect to the second input each of 4 comparators 221a-d, logic signals HIT 0-3+ connect to an input of a 2:1 MUX 223 and also to one input each of 20 NAND 251a-t circuits, 20 NAND 252a-t circuits, 20 NAND 253a-t circuits and 20 NAND 254a-t circuits. The round robin 224 output, LEVEL 0-3+ connects to the second input of 2:1 MUX 223. The output of 2:1 MUX 223, the 4 logic signals WRITE 0-3 each connects to their respective level 0-3 of data buffer 201. The outputs of data buffer 201 20 bit signal busses CADP 00-19 -10, -11, -12 and -13 connect to the second input and logic signal INTERG- connects to the third input of NAND 251a-t, 252a-t, 253a-t and 254a-t whose respective output signal busses CADP 00-19+ connects to junction 216. Data word signal bus CADP 00-19+ connects between junction 216 and interface 6. The output signals HIT 0-3+ connect to the input of NAND 231, the output of which connects to cycle control 232 and FIFO R/W control 230. 2:1 MUX's 208 and 223 are switched by logic signals ADDRSO+ and REPLACE respectively. Logic signal REPLACE connects to round robin 224.</p><p>Data buffer 201 is organized in four levels, each level storing 1,024 data words in 1,024 word locations addressed by 10-bit column address ADDR 08-17-10. Four words, one from each level, CADP 00-19-10, -11, -12, and -13 are read out of data buffer 201 when the data buffer 201 is addressed. Directory 202 is also organized in four levels of 1,024 memory locations in each level. Each memory location stores an 8 bit row addresses. When 10 bit column address ADDR 08-17-10 inputs directory 202, four 8 bit row addresses ADDR 00-07-20, -21, -22 and -23 are read out of the four levels of directory 202 to four comparators 221a-d. These row addresses are compared with the input row address ADDR 00-07-10 and if there is an equal, that \"hit\" line HIT 0+, HIT 1+, HIT 2+ or HIT 3+ goes high gating the 20 bit output of data buffer 201 through the appropriate 20 circuits of NAND 251a-t, 252a-t, 253a-t or 254a-t to junction 216 and to CPU2.</p><p>If a data word in data buffer 201 is to be replaced, round robin 224 selects the directory 202 and data buffer 201 level for replacement by setting one of the level signals LEVEL 0-3+ high. 2:1 MUX selects this signal since logic signal REPLACE is high and logic signal WRTPLS- enables 2:1 MUX 223.</p><p>In an update mode the selected hit line HIT0-3+ is switched through 2:1 MUX 223 and inverted by inverter 255 to enable the selected level of data buffer 201 to write the data word DATA 00-19- into the selected column address ADDR 08-17-10. 2:1 MUX 223 is enabled by logic signal WRTPLS-.</p><p>Round robin 224 has two, one bit by 1024 address random access memories (RAM). For each address location, there is stored 2 bits in each RAM which when decoded selects the next level of that column address to be replaced.</p><p>The directory 202 and data buffer 201 are designed using random access memory chips 93 LS 425 and round robin 224 is designed using random access memory chips 93 415, described on pages 7-119 and 7-70 respectively in the Bipolar Memory Data Book, copyright 1977, by Fairchild Camera and Instrument Co. of Mountain View, California. Comparator 221a-d logic circuits are made up of Fairchild TTL/MSI 93S47 high speed 6 bit identity comparator circuits. 2:1 MUX 208 and 223 are 75S157 logic circuits described on page 7-181 of the aforementioned TTL Data Book. The round robin 224 operation is described in copending related application No. 2 listed supra.</p><h4>CACHE CPU INTERFACE UNIT 6</h4><p>Cache CPU Interface Unit 6 includes an 18 line address signal bus BAOR 05-22, a 20 line data signal bus CADP00-19 and a control signal bus containing a number of signal lines. The functions of the control signal lines CACHON, the cache on line logic signal, CNOMEM-, the NO HIT Fault logic signal, CACHRQ+, the cache request logic signal and CYCADN-, the cache done logic signal are described herein. CPU2 includes an A register and 3 Index Registers which are used by the CPU instructions, Copy Register to A and Copy A to register and were described supra. These instructions with the A register and 3 index registers are not part of the invention and are not further described. Cache-CPU Interface Unit 6 is fully described in copending related Application No. 9 listed supra.</p><h4>SYSTEM BUS 5 CONTROL SIGNALS</h4><p>The signals listed below are the bus 5 control signals necessary to describe the invention. The aforementioned U.S. Patent references fully describe all of the control signals associated with bus 5.</p><h4>Memory Reference (BSMREF)</h4><p>BSMREF high indicates that the address loads BSAD 05-22 contain a memory 3 word address.</p><p>BSMREF low indicates that the address leads BSAD 08-23 contain a channel address and a function code.</p><h4>Bus Write (BSWRIT)</h4><p>BSWRIT high indicates that a master unit is requesting a slave unit to execute a write cycle.</p><h4>Second Half Bus Cycle (BSSHBC)</h4><p>BSSHBC high indicates that main memory 3 is sending to cache 1 information previously requested by cache 1.</p><p>BSSHBC low indicates that this is a Test and Verification cycle.</p><h4>Double Pull (BSDBPL)</h4><p>BSDBPL is high when sent from cache 1 to main memory 3 to signal main memory 3 to read data in double pull mode.</p><p>BSDBPL is high when sent from main memory 3 to cache 1 with the first word of a two word response to a memory request.</p><p>BSDBPL is low when sent from main memory 3 to cache 1 with the second word of a two word response to a memory request.</p><p>This enables main memory 3 to send one or two words to cache. If, for example, PRA is the high order address of a memory bank then BSDBPL will be low indicating that only one word will be transferred in response to the memory request.</p><h4>My Acknowledge (MYACKR)</h4><p>MYACKR when high is sent by cache 1 to system bus 5 to indicate that cache 1 is accepting a system bus 5 data word transfer from main memory 3.</p><h4>My Bus Request (MYREQT)</h4><p>MYREQT when high is sent by cache 1 to system bus 5 to indicate that cache 1 is requesting a system bus 5 cycle.</p><h4>My Data Cycle Now (MYDCNN)</h4><p>MYDCNN high indicates that cache 1 is transferring information over system bus 5 to main memory 3.</p><h4>Data Cycle Now (BSDCNN)</h4><p>BSDCNN high indicates that main memory 3 has placed information on the bus 5 for use by cache 1.</p><h4>Acknowledge (BSACKR)</h4><p>BSACKR high indicates to cache 1 that main memory 3 has accepted the memory request sent by cache 1.</p><h4>Wait (BSWAIT)</h4><p>BSWAIT high indicates to cache 1 that main memory 3 is busy and cannot accept the memory request at this time.</p><h4>Bus Request (BSREQT)</h4><p>BSREQT high indicates to cache 1 that a system coupled to bus 5 has requested a bus cycle.</p><h4>Byte Mode (BSBYTE)</h4><p>BSBYTE high indicates a byte transfer rather than a word transfer.</p><h4>Master Clear (BSMCLR)</h4><p>BSMCLR high initializes cache and starts the QLT operation.</p><h4>CLOCK CONTROL 220--FIG. 3, Sheet 2</h4><p>The cache request logic signal CACHRQ+, FIG. 3, connects to Test and Verification Logic 240, a RESET terminal of a flop 301 and to an input terminal of a NAND 302. A clock signal CLOCK0+ connects to the CLK terminal of flop 301. The Q output of flop 301 connects to the second input of NAND 302. The CPUREQ+0A output of a NAND 306 connects to the third input of NAND 302 whose output connects to an input of 30 ns delay line 303 and an input of NAND 304. The output of delay line 303 connects to the other input of NAND 364. The Q output of flop 301, logic signal BLKREQ+ connects to a D and RESET input of flop 305. The logic \"1\" signal connects to the SET input of flop 305. A MYACKR logic signal connects to the CLK input of flop 305. The Q output signal INTERG+ connects to buffer bypass drivers 205 and the Q output signal INTERG- connects to the input of HIT0-3+ NAND gates 251a-t, 252a-t, 253a-t and 254 a-t in the cache directory and data buffer unit 12. Logic signal FEMPTY-20 connects to an input of AND 324 and to the input of inverter 307. A logic signal MEMREQ+ connects to an input of NAND 306. A logic signal ADDRSO-, the Q output of flop 309 connects to the select input of 2:1 MUX 208 in cache directory and data buffer unit 12. The output of NAND 308 connects to the SET terminal, CLOCK0+ connects to the CLK terminal and a general clear CLEAR- signal connects to the reset terminal of flop 309. Logic signals CYFIFO+0A and CYWRIT+0A connect to respective inputs of NAND 308. A CPUREQ logic signal connects the NAND 304 output to a SET terminal of flop 313. An FEMPTY- logic signal connects to a RESET terminal of flop 313 from an inverter 319 output. A Q output terminal logic signal FEMPTY+20 and a Q output logic signal FEMPTY-20 of flop 313 connect to the respective input of a NOR 310. A CYREAD logic signal connects between the Q output of a flop 330 and the third input of NOR 310 and CLOCK0+ connects to the fourth input of NOR 310. The output of NOR 310 connects to an input of NOR 311. The CLOCK0+ connects to an inverter 312 input. A CLOCK0- input signal of inverter 312 connects to an input of NAND 315.</p><p>Clock control 220 provides a timing signal CLOCK0+ to time the logic circuits of cache 1. CLOCK0+ starts cycling on either a CPU2 memory request or by FIFO 203 being loaded with information from bus 5. In the case of the CPU2 memory request, logic signal CACHRQ, the input to NAND 302 is forced high, which sets the output low. The other two inputs to NAND 302 BLKREQ- and CPUREQ+0A are high at this time. Flop 301 is not set so the Q output is high and both inputs to NAND 306 are low so the output is high. When the output of NAND 302 goes low, one input of NAND 304 goes low and 30 nanoseconds later the other input goes low due to the delay in delay line 303. The delayed signal low sets logic signal CPUREQ high. Logic signal CPUREQ the SET input of flop 313 high sets the Q output FEMPTY-20 low. Flop 313 is a 74S74 logic circuit which has both the Q and Q outputs high when both the SET and PRESET inputs are low. Flop 74S74 is described on page 5-22 of the aforementioned TTL Data Book.</p><p>The logic signal FEMPTY-20 low sets the output of NOR 310 high forcing the timing signal CLOCK0+ output of NOR 311 low. Fifty nanoseconds later, the output of delay line 314 forces the other input of NOR 311 low forcing timing signal CLOCK0+ high. Timing signal CLOCK0+ going high sets flop 301 setting the Q output logic signal BLKREQ- low. This forces the output of NAND 302 high forcing the NAND 304 output logic signal CPUREQ, the SET input to flop 313 low. This sets flop 313 and logic signal FEMPTY-20 is forced high keeping the timing signal CLOCK0+ output of NOR 311 high. Timing signal CLOCK0+ remains high as long as logic signal CACHRQ+ remains high. Logic signal CACHRQ+ will remain high until CPU2 receives the requested data word and the cache done logic signal CYCADN- is sent to CPU2.</p><p>Flop 313 which controls the start of cycling of CLOCK0+ is also controlled by the loading FIFO 205. The write address counter flops 316 and 317 in FIFO R/W control 230 advance to the next location after receiving acknowledged information from bus 5 (BSACKR high). This sets the output of comparator 318, logic signal FEMPTY+ low, setting the inverter 319 output logic signal FEMPTY- high. With the RESET input logic signal FEMPTY- of flop 313 high, the Q output logic signal FEMPTY+20 goes low starting the timing signal CLOCK0+ cycling as before. In this case, timing signal CLOCK0+ cycles as long as there is information in FIFO 203, and logic signal FEMPTY- keeps going low and logic signal CYREAD the input to NOR 310 is low. CPUREQ+0A output logic signal from NAND 306 stays low as long as the MEMREQ or ADDRS0- inputs to NAND 306 are high. This prevents a second CPU2 memory request cycle if logic signal CACHRQ+ is again high until the responses to the main memory 3 requests as a result of a previous CPU2 memory request is sent to cache 1. MYACKR logic signal going high at the start of the main memory 3 response to the CPU2 memory request sets flop 305, setting logic signal INTERG+ high to gate buffer bypass drivers 205 to send the CPU2 requested data (PRA) directly out on interface 6. INTERG- when high gates NAND 251a-t, 252a-t, 253a-t and 254a-t in cache directory and data buffer 12 to allow the selected word from data buffer 201 to be sent to CPU2 if the data word was stored in data buffer 201 when logic signal CACHRQ+ was set high. The logic signal FEMPTY+30 input to the SET terminal of flop 301 assures that the flop 301 does not set when logic signal CACHRQ+ comes high during a FIFO 203 cycle. Flops 301, 305 and 313 are 74S74 logic circuits described on page 5-22 of the aforementioned TTL Data Book. Flop 309 is a 74S175 logic circuit described on page 5-46 of the TTL Data Book.</p><h4>DETAILED DESCRIPTION OF FIFO R/W CONTROL 230--FIG. 3, Sheets 1 &amp; 2</h4><p>In FIG. 3, the output of a NAND 324 connects to the SET input, a general clear signal CLEAR- connects to the RESET input and timing signal CLOCK0+ connects to the CLK input of a flop 323. The Q output logic signal CYFIFO connects to a NAND 315 input. Timing signal CLOCK0- connects between the inverter 312 output and the other input of NAND 315. The Q output, logic signal CYFIFO also connects to cycle control 232. The Q output connects to the input of AND 324. Logic signal FEMPTY-20 connects to the other input of AND 324. A BUMPUP logic signal output of NAND 315 connects to the CLK inputs, the CLEAR-connects to the RESET inputs of flops 316 and 317. The logic \"1\" signals connect to the J, K and PRESET inputs of flop 316, and the PRESET input of flop 317. The Q output of flop 316 connects to the J and K inputs of flop 317 and to a comparator 318 input. The Q output of flop 317 connects to comparator 318. The Q outputs of flop 316 and 317 connect to the read address select terminals of FIFO 203. Logic signals BSACKR and BSWRIT connect between receiver 217 and inputs to a NAND 337 whose output connects to the other input of NOR 336. Logic signal CACHON+ connects between Test and Verification logic 245 and an input to a NOR 342. Logic signal BSMREF connects between receiver 217 and the other input of NOR 342 whose output connects to the third input of NAND 337. A MYACKR+ logic signal and a BSSHBC logic signal connects to NAND 322 whose output connects to an input of a NOR 336 whose output logic signal F plus 1 connects to the CLK inputs of flops 320 and 321. CLEAR- logic signals connect to the RESET inputs of flops 320 and 321. Logic 1 signals connects to the J, K and PRESET inputs of flop 320 and the PRESET input of flop 321. The Q output of flop 320 connects to comparator 318 and the J and K input of flop 321. The Q output of flop 321 connects to comparator 318. The Q outputs of flops 320 and 321 connect to the write address select terminals of FIFO 203. FIFO 41+ logic signal connects to the read enable terminals of address field FIFO bit positions 00-17 of FIFO 203. A ground signal connects to the read enable terminals of the data and control field FIFO bit positions 18-43 of FIFO 203. FIFO 41+ connects to the SET input of LR 204 replace-update bit position 41 flop. Logic signals CYFIFO and REPLACE connect to input terminals of NOR 325 whose output connects to a NOR 327, whose output logic signal CYWRIT+DA connects to the SET input of flop 330 and an input of NAND 308. Timing signal CLOCK0+ connects to the CLK terminal, and CLEAR- connects to the RESET terminal of flop 330 whose Q output logic signal CYREAD connects to round robin 224 and an input to NOR 310. Logic signal BSDCNN+ connects to the input of an inverter 326 whose output connects to the inputs of delay lines 328 and 329. Delay line 328 output connects to an input of inverter 331 whose output connects to an input of NAND 332. The output of delay line 329 connects to the other input of NAND 332 whose output logic signal FWRITE connects to the write enable terminal of FIFO 203. Logic signal NOHIT+ connects to an input of inverter 334 whose output logic signal NOHIT- connects to an input of a NOR 340 and to an input of NOR 333 whose output connects to the other input of NOR 327. Logic signals CYFIFO and UPDATE connect to the other inputs of NOR 333. Logic signal CYQLTO- connects between cycle control 232 and the input to NOR 340 whose output connects to an input of NOR 325.</p><p>Logic signal BSDCNN+ goes high at the start of every main memory 3 to cache 1 data transfer cycle, is inverted by inverter 326, is delayed 10 nanoseconds by delay line 328, and is again inverted by inverter 331 appearing at the first input of NAND 332 as a delayed positive logic signal. The output of delay line 329 is a negative going logic signal appearing at the second input of NAND 332 delayed 40 nanoseconds. The 2 inputs to NAND 332 are positive for 30 nanoseconds forcing the FWRITE write enable input to a negative going pulse 30 nanoseconds wide, delayed 10 nanoseconds from the rise of BSDCNN+. This strobes the bus 5 information at the output of receivers 213, 215 and 217 into a location of FIFO 203 defined by the Q outputs of the write address flops 320 and 321 logic signals FWADDR- and FWBDDR-. MYACKR goes high, if a cache identification AND 546 output, FIG. 5, goes high indicating that cache ID 0002<sub>8</sub> was received from bus 5 through receiver 213 and that this is not a main memory 3 write operation. When BSDCNN+ delayed 60 nanoseconds goes high, flop 516 sets and logic signal MYACKR, the input to NAND 322 goes high. Since this is a response to a memory request, BSSHBC is high forcing the output of NAND 332 low forcing the output of NOR 336 logic signal F PLUS 1 low. Forcing the CLK inputs of flops 320 and 321 low increments the write address counter flops 320 and 321. Since the output of logic signals FWADDR+ and FWBDDR+, of the write address counter flops 320 and 321 and logic signals FRADDR+ and FRBDDR+, outputs of the read address counter flops 316 and 317 are no longer equal, logic signal FEMPTY+, the output of comparator 318 goes low, starting CLOCK0+ cycles as previously described in Clock Control 220.</p><p>Write address counter flops 320 and 321 and read address counter flops 316 and 317 are conventional JK flops 74S112 described on page 5-24 of the aforementioned TTL Data Book and they operate in the following manner. Assume flops 320 and 321 are both reset, that is the Q outputs FWADDR- and FWBDDR- are high. When FPLUS 1 goes low, flop 320 sets on the fall of logic signal FPLUS 1. The Q output of flop 320 being low keeps flop 321 reset. With flop 320 set and its Q output high, flop 320 resets and flop 321 sets on the next fall of logic signal FPLUS 1. On the next fall of logic signal FPLUS 1, both flops 320 and 321 are set and on the fourth fall of logic signal FPLUS 1, both flops are reset. During an update operation, the three inputs of NAND 337, logic signal BSACKR, BSWRIT and the output of NOR 342 are high forcing the output of NOR 326 logic signal F PLUS 1 low advancing the write address counter, flops 320 and 321. During the Test and Verification operation however, if the cache is placed in a bypass cache mode, logic signal CACHON+ is low, forcing the output of NOR 342 low. This forces the output of NAND 337 high forcing the output of NOR 336, logic signal F PLUS 1 high. This prevents information on bus 5 from being written into directory 202 and data buffer 201 by preventing the write address counter flops 320 and 321 from advancing. Cache 1 remains in this bypass mode as long as logic signal CACHON+ remains low. The rise of CLOCK0+ sets flops 323 and its Q output, logic signal CYFIFO goes high. When CLOCK0+ next goes low, both logic signals CYFIFO and CLOCK0- inputs to NAND 315, go high forcing the output logic signal BUMPUP low, advancing the read address counter flops 316 and 317. The inputs to comparator 318 equals FWADDR+ and FWBDDR+ equals signals FRADDR+ and FRBDDR+ thereby setting FEMPTY+ high. This stops timing signal CLOCK0+ if no bus 5 cycle logic signal BSDCNN+ is present. Logic signal FEMPTY+ is inverted by inverter 319 and the output logic signal FEMPTY- going low sets the FEMPTY+20 output of flop 313 high, forcing the output of NOR 310 low, forcing the CLOCK0+ output of NOR 311 high. Logic signal CYFIFO, FIG. 2, going high sets the FIFO 203 output of the location indicated by the read address counter flops 316 and 317 (FRADDR- and FRBDDR-) into LR 204. If the information in FIFO 203 was a response to a memory request, FIFO 41+ is high. This sets LR 204, F/F 41, FIG. 3, so that its Q output, logic signal REPLACE is high. The output of NOR 340 is high during the QLT mode since the logic signal CYQLTO- is low. This sets the output of NOR 325 low and the output of NOR 327 high, so that at the next rise of CLOCK0+, flop 330 sets and the Q output logic signal CYWRIT goes high and continues cycling for the remainder of the QLT operation.</p><p>During normal operation, logic signal CYQLTO-, the input to NOR 340 is high. Therefore, in a replacement mode with logic signals REPLACE and CYFIFO high if the directory 202 search results in a \"NO HIT\", then the 3 inputs to NOR 325 are high and logic signal CYWRIT, the Q output of flop 330 goes high as before. Flop 309 of clock control 220 was previously set since CYWRIT+0A and CYFIFO+0A were low in previous cycles setting the Q output ADDRSO<sup>+</sup> high, switching 2:1 MUX 208 FIG. 2, to receive memory address BAOR 05-22+. At the rise of CLOCK0+, logic signal CYFIFO+0A is high, since flop 323 is not set and the Q output which is high inputs AND 324. The FEMPTY-20 input to AND 324 is also high, forcing the CYFIFO+0A input to NAND 308 high, setting the output low. Since the SET input to flop 309 is low, the Q output ADDRS0+ goes low, switching 2:1 MUX 208, FIG. 2, to receive the FIFO 00-17+ address output from LR 204. Flop 323 when set is reset on the next rise of CLOCK0+ since the Q output which inputs AND 324 is low, forcing the SET input of flop 323 low, resetting flop 323 and the Q output logic signal CYFIFO goes low. Inverter 334 and NOR 333 are not necessary to describe this invention. Their contribution to the logic will be described in copending application 3 listed supra.</p><p>Flops 323 and 330 are 74S175 logic circuits described on page 5-46 of the aforementioned TTL Data Book.</p><h4>DETAILED DESCRIPTION OF AOR AND RAF CONTROL 235--FIG. 4, Sheet 1</h4><h4>READ ADDRESS MULTIPLEXER 223 AND WRITE ADDRESS COUNTER 234--FIG. 4, Sheet 2</h4><p>The outputs of a NAND 417 and 418 connects to NOR 419 inputs. Logic signal BLOCKF connects between a NAND 417 and cycle control 232. Logic signal FEMPTY-20 connects between clock control 220 and an input to a NOR 442 whose output connects to the 3rd input of NOR 419. The output of NOR 419, logic signal AORCNT, connects to the inputs of delay lines 420 and 421, an input of a NAND 424 and an input to a NAND 416. Logic signals MEMREQ- and CYQLTO+ connect between cycle control 232 and inputs to a NAND 441. Logic signal CYFIFO connects between FIFO R/W control 230 and another input of NAND 441 whose output connects to an input of NOR 442. Logic signals CYQLTO-1A and CYQLTO-0B connect between cycle control 232 and inputs to a NAND 443 whose output connects to an input of NOR 419.</p><p>The output of NAND 424, logic signal BAORCk connects to the AOR 207. The delay line 421 output connects to an inverter 423 input whose output logic signal AORCNT-30 connects to the CLK inputs of flip 426 and 427. The delay line 420 output connects to an inverter 422 input whose output connects to inputs of NAND 416 and NAND 424. Logic signal BAWRIT connects between the output of NAND 416, the input of NAND 425, and the WRITE strobe terminal of RAF 206. Logic signal MEMREQ connects to NAND 425 input, the RESET input flops 412 and 413 and cycle control 232. The output of NAND 425 connects to the reset terminals of flops 426 and 427 and the J and K inputs of flop 427. The Q output of flop 426, logic signal ADDRRO+ connects to the Write Address terminal 2 of RAF 206 and connects to the input of NAND 418. Logic signal MYACKR connects between another input of NAND 418 and cycle control 232. The Q output of flop 426 logic signal ADDRRO- connects to the inputs of NAND 417 and NAND 424. The Q output of flop 427, logic signal ADDRRI+ connects to the Write Address Terminal of RAF 206 and the input of NAND 417. Logic signal BSDCND+ connects between cycle control 232 and the CLK terminal of a flop 409. Logic signal BSAD 23+ connects to the SET input of flop 409 and the output of Receiver 217. Logic signal MYACKD connects between cycle control 232 and input of NAND 410 and 411. The Q output of flop 409, logic signal BSAD 23+10, connects to the other input of NAND 410. The Q output of flop 409, logic signal BSAD 23-10, connects to the other input of NAND 411. The output of NAND 410 connects to the CLK terminal of flop 412 and the output of NAND 411 connects to the CLK terminal of flop 413. Logic \"1\" signal connects to the PRESET, J and K terminals of flops 412 and 413. The Q output of flop 412, logic signal FCHONE+ connects to the input of FIFO bit position 43 of FIFO 203, FIG. 4. The Q output of flop 413, logic signal FCHZRO+, connects to the input of the FIFO bit position 42 of FIFO 203. Logic signal BSAD23+ connects to the input of the FIFO bit position 18 of FIFO 203. The output of the FIFO bit position 18 connects to a select terminal 1 of MUX 414 and 415. The MUX's are 74 S153 dual 4 lines to 1 line Data Selectors/Multiplexers described on page 5-42 of the aforementioned TTL Data Book. Terminal 1 of a Banked-interleaved select switch 407 is connected to ground. Terminal 2 is connected to logic \"1\". Logic signal BANKED+00 connects between terminal 3 and an input to NOR 408 whose output logic signal ADDRWD+ connects to select terminal 2 of 4:1 MUX 414 and 415. Logic signal CYQLT0- connects between Cycle Control 232 and the other input of NOR 408. Logic signal BANKED+00 also connects to cycle control 232. The enable input and the terminal 2 input of 4:1 MUX 414 are connected to ground as is the enable input and the terminal 0 input of 4:1 MUX 415. Input 3 of 4:1 MUX 414 and input 1 of  4:1 MUX 415 are connected to logic \"1\". Input 0 of 4:1 MUX 414 and input 2 of 4:1 MUX 415 connect to the FIFO bit position 42 output of FIFO 203 and input 1 of 4:1 MUX 414 and input 3 of 4:1 MUX 415 connects to the FIFO bit position 42 output of FIFO 203. The outputs of MUX 414 and 415, logic signals ADDRWD+0B and ADDRWD+0A connect to the Read Address terminals 1 and 2 respectively of RAF 206 and also connect to cycle control 232. Logic signal FIFO 41- connects to the read enable input of RAF 206. Logic signal BSDCNB+ connects between the RESET input of flop 409 and cycle control 232.</p><p>When CACHRQ+, FIG. 3, goes high indicating that CPU2 is requesting a data word and CPU2 also sends the main memory 3 address location BAOR 05-22+, FIG. 2, of the requested data word, the address BAOR 05-22 (PRA) appears at the inputs of AOR 207 and location 00 of RAF 206. In addition, the address is sent to directory 202 and data buffer 201 as row address ADDR00-07-10 and column address ADDR 08-17-10. 2:1 MUX 208 is switched by ADDRSO+ high to input BAOR 05-22+ and a directory 202 search is started. When FEMPTY-20, the output of flip 313, FIG. 3, goes low the AORCNT output of NOR 419, FIG. 4, goes high, setting one input to NAND 416 and 424 high. Since the other inputs to NAND 416 and 424 are high logic signals BAWRIT and BAORCK go low. 50 nanoseconds later the output of delay line 420 goes high setting the output of inverter 422 low, setting the outputs of NAND 416 and 424 logic signals BAWRIT and BAORCK high. PRA is strobed into AOR 207 and into location 00 of RAF 206 when BAWRIT and BAORCK are low. Logic signal AORCNT going high is delayed 70 nanoseconds by delay line 421 and is inverted by inverter 423. Inverter 423 output logic signal AORCNT-30 going low advances Write Address Counter 234 to location 01. The Write Address Counter is made up of JK flops 426 and 427 whose operation has been described supra. Logic signal ADDRRI+ is now high and ADDRR0+ is low settng the Write Address in RAF 206 to location 01. Assuming the data requested by CPU2 of Cache 1 is not stored in Cache 1 then MEMREQ+, FIG. 5, is forced high. In FIG. 2 logic signal MEMREQ- low forces the output of NAND 241 high which transfers the 2:1 MUX 209 to receive the AORO05-22+ output of ADDER 211. Since logic signal ADDRR1+ is high and logic signal ADDRO+ is low, the +1 output of EXCLUSIVE OR 237 is high forcing PRA+1 on the address signal lines AORO05-22+ and on the 2:1 MUX 209 output signal lines BAOR 05-22.</p><p>For both banked and interleaved memories the first memory request is sent to main memory 3 over bus 5 and an acknowledge signal BSACKR returned by main memory 3 to cache 1 over bus 5 sets logic signal BLOCKF+ high, FIG. 5. When BLOCKF+ goes high the 3 inputs to NAND 417, FIG. 4, are high setting the output low. This sets the output of NOR 419 logic signal AORCNT high, which sets logic signal BAWRIT, the RAF 206 write strobe and logic signal BAORCk the AOR 207 strobe low as described supra. This sets PRA+1 into AOR 207 and Location 01 of RAF 206. Logic signal AORCNT-30 going low as before advances the write address counter 234 to Location 02. For Location 01 logic signal ADDRRI+ is set high and logic signal ADDRO+ is set low. The fall of logic signal AORCNT-30 sets logic signals ADDRRO+ high and sets ADDRRI+ low and the Write Address Counter 234 addresses Location 02. The banked memory system now awaits the main memory 3 response to the first memory request whereas the interleaved memory system sends a second memory request.</p><p>At the end of the second memory request cycle logic signal MYACKR+, FIG. 5, goes high to start the first main memory 3 to cache 1 data response cycle. Since logic signal ADDRRO+ is also high the output of NAND 418 goes low setting signal AORCNT, the output of NOR 419 high. As previously described, logic signal BAWRIT goes low setting PRA+2 into location 02 of RAF. In FIG. 2, PRA+1 remains stored in AOR 207. When the Write Address Counter 234 is set at location 02 the output logic signals ADDRRO+ high and ADDRR1+ low results in the +1 output from EXCLUSIVE OR 236 going high. This results in forcing the output of ADDER 211, PRA+2, on the address signal, AORO 05-22+ and BAOR 05-22, the output of 2:1 MUX 209. Note that logic signal BAORCK the write strobe for AOR 207 is not set low since the logic signal ADDRRO- input to NAND 424 is low. The Write Address Counter 234 is advanced to location 03 when AORCNT-30 goes low as described supra and logic signals ADDRRO+ and ADDRR1+ are both set high. This results in the +2 output of AND 236, FIG. 2, going high which sets the output of ADDER 211 to PRA+3. Logic signal MYACKR again comes high at the start of the second main memory 3 to cache 1 data word cycle in response to the first memory request again forcing logic signal AORCNT high. This forces logic signal BAWRIT low thereby forcing PRA+3 into location 03 of RAF 206 and advancing the Write Address Counter 234 to location 00.</p><p>For an interleaved memory 4 data words are transferred from main memory 3 to cache 1 over bus 5 on 4 separate bus 5 cycles. FIG. 8c shows the format of the responses. The low order bit BSAD23 of the Function Code identifies whether the data word is in response to the first memory request or the second memory request for data words. Logic signal BSAD 23+ and the Function Code history flops 412 and 413 identify the location of RAF 206 that stores the main memory 3 address for the data word being transferred. The first data word is at the PRA main memory 3 location and transfers from main memory 3 cache 1 with the Function Code set to 00<sub>8</sub>. BSAD 23+ the low order bit of Function Code 00<sub>8</sub> is low and sets into FIFO bit position 18 of FIFO 203 FIG. 2, when the FIFO strobe FWRITE- goes low. Also, at this time the function history flops 412 and 413 are not set and the output logic signals FCHZRO+ and FCHONE+ are low setting the FIFO 42 and FIFO 43 bit positions low. With Switch 407 set to interleaved, the input to inverter 408 logic signal BANKED is low setting the output logic signal ADDRWD+ high, setting the SELECT terminal 2 high. This sets the 2 and 3 input terminals of 4:1 MUX 414 and 415 active. FIFO 18 sets SELECT terminal 1 of 4:1 MUX 414 and 415 low setting input 2 active. Since FIFO 42 is low the outputs of 4:1 MUX 414 and 415 logic signals ADDRWD+ OB and ADORWD+OA are low which set the read address of RAF 206 to location 00 and PRA appears on address signal lines AORO 05-22, FIG. 2, and is strobed into LR 204 when logic signal CYFIFO goes high. BSAD 23+ is low the Q output which inputs NAND 411 goes high. When logic signal MYACKD, the input of NAND 411 goes high, the output of NAND 411 goes low setting flop 413 with the Q output logic signal FCHZRO+ high.</p><p>On the next bus 5 cycle the data word PRA+2 location in main memory 3 is transferred to cache 1 and the Function Code on bus 5 signal lines BSAD 18-23 is still 00 and BSAD 23+ the low order bit is low. In this case, in FIG. 4, FIFO bit position 18 of FIFO 203 is set low and FIFO bit position 42 is high, since flop 413 is set with the Q output logic signal FCHRZO+ high. The outputs of 4:1 MUX 414 and 415, logic signal ADDRWD+OB is low and logic signal ADDRWD+OA is high since the 2 input terminal of 4:1 MUX 414 is at logical ZERO and the 2 input terminal of 4:1 MUX 415 is a at logical ONE, thereby resulting in the readout of location 02 of RAF 206 which has the PRA+2 address stored.</p><p>The third data word transfer cycle over bus 5 brings the data word from the PRA+1 main memory 3 location with a Function Code of 01<sub>8</sub>. In this case, BSAD 23+ is high and FIFO bit position 18 of FIFO 203, FIG. 4, is high setting the 3 input terminal of 4:1 MUX 414 and 415 active. FIFO bit position 43 is low and FIFO bit position 42 is a \"don't care\". In this case with FIFO 18 high the ADDRWD+0B output of flop 414 is high and the ADDRWD+0A output of flop 415 is low reading out from RAF 206 location 01 which contains PRA+1. BSAD 23 high causes flop 409 to set when logic signal BSDCND+ goes high, setting the Q output logic signal BSAD23+10 high forcing the output of NAND 410 low when logic signal MYACKD+ goes high. This sets flop 412 and its Q output logic signal FCHONE+ goes high. The 4th bus 5 cycle bringing the data word from the PRA+3 location in main memory 3 has a Function Code of 01. BSAD 23 high as before sets FIFO bit position 18 high and FIFO bit position 43 is set high since logic signal FCHONE+ is high.</p><p>The output of 4:1 MUX 414 and 415 logic signals ADDRWD+0B and ADDRWD+0A are high reading out RAF 206 location 03 which stores PRA+3. Flops 412 and 413 are reset when logic signal MEMREQ+ goes low.</p><p>For a banked memory, two data words are transferred from main memory 3 to cache 1 over bus 5 on two separate bus 5 cycles. In this case, switch 407 is set to terminal 2 (banked), setting the input of inverter 408 high, forcing the output logic signal ADDRWD+ low. Also, for the banked memory, the function code is 00<sub>8</sub> as the response to the memory request. Therefore, BSAD23+ is low for both data words sent to cache 1 from main memory 3 over bus 5. FIFO bit position 18 of FIFO 203 is therefore low for both data words. The select inputs of 4:1 MUX 414 and 415 of terminals 1 and 2 are both low thereby activating input terminal 0. When the first data word is read into FIFO 203 from bus 5, logic signals ADDRWD+OB and ADDRWD+OA are both low and PRA stored in location 00 is read out of RAF 206. Then, when logic signal MYACKD is forced high, the output of NAND 411 goes low, setting flop 413. BSAD23-10 Q the output of flop 409 is high at this time. The Q output FCHZRO+ flop 413 high is stored in FIFO bit position 42 on the next FWRITE enable pulse of FIFO 203. This forces the output of 4:1 MUX 414 ADDRWD+0B high, so that the address in RAF 206 location 01 (PRA+1) is transferred to LR 204 with the second data word in response to the memory request.</p><p>Flops 412, 413, 426 and 427 are 74S112 logic circuits described on page 5-34 and flop 409 is a 74S175 logic circuit described on page 5-46 of the aforementioned TTL Data Book.</p><p>In the QLT mode the RAF write strobe BAWRIT and the AOR write strobe BAORCK are forced low when the 2 inputs to NAND 443 are forced low when the 2 inputs to NAND 443, logic signal CYQLTO-1A and CYQLTO+0B are high. This forces the output of NAND 443 low, forcing the output of NOR 419, logic signal AORCNT high. As previously discussed, write strobes BAWRIT and BAORCK are forced low. This sets PRA address location 0000 into AOR 207 and location 00 of RAF 206. The RAF Write Address Counter 234 is advanced to location 01 when logic signal AORCNT-30, the output of inverter 423 is forced low. Logic signals ADDRR1+, the Q output of flop 427 and ADDRR0-, the Q output of flop 426 are set high. This forces the +1 terminal of ADDER 211, the output of EXCLUSIVE OR high and signal lines AORO 05-22+, the outputs of ADDER 211 are forced to hexadecimal 0001.</p><p>When logic signal BLOCKF+, the input to NAND 417, is forced high the 3 inputs to NAND 417, FIG. 4, are high and the output is forced low forcing logic signal AORCNT, the output of NOR 419. This forces write strobes BAWRIT and BAORCK low setting address location 0001 into RAF 206 location 01 and AOR 207. The write address counter 234 then advances to location 02. The Q output of flop 426, logic signal ADDRRO+ is set high and logic signal ADDRR1+, the Q output of flop 427 is set low, in FIG. 2, the output of EXCLUSIVE OR 237 logic signal +1 again goes high forcing the output of ADDER 211, signal lines AORO 05-22+ to 0002.</p><p>When MYACKR+ the input to NAND 418, FIG. 4, goes high, the output is forced low, forcing logic signal AORCNT, the output of NOR 419 high. In this case, write strobe address BAORCK remains high since the input to NAND 424, logic signal ADDRRO- is low. Write strobe BAWRIT is forced low setting 000,002<sub>8</sub> into location 02 of RAF 206. Write address counter 234 is advanced to location 03. Logic signal MYACKR+ again goes high and address location 0002 is stored in location 03 of RAF 206 and the write address counter is advanced to location 00.</p><p>Locations 02 and 03 of RAF 206 are considered \"dummy\" locations and are not used in the QLT mode.</p><p>When the inputs to NAND 441, logic signals MEMREQ-, CYQLTO+ and CYFIFO are high the output is low forcing the output of NOR 442 low forcing logic signal AORCNT, the output of NOR 419 high. This sets address location 0002 into AOR 207 and RAF 206 location 00 and advances the write address counter 234 to location 01.</p><p>The above sequence continues until address location 4096 is set into AOR 207 and RAF 206 and the QLT operation is concluded.</p><p>Logic signal ADDRWD+, the output of NOR 408 remains high for the QLT mode since the input, logic signal CYQLTO- remains low. This forces terminals 2 of 4:1 MUX 414 and 415 high, since FIFO bit position 18 of FIFO 203, FIG. 4, remains low. Select terminals 1 of 4:1 MUX 414 and 415 are forced low. Therefore, input terminal 2 of 4:1 MUX 414 and 415 are active since select terminal 1 is low and select terminal 2 is high.</p><h4>DETAILED DESCRIPTION OF CYCLE CONTROL 232--FIG. 5, Sheets 1 &amp; 2</h4><p>Logic signals MYACKD, BSDBPL, BSWAIT, MYDCNN+, MEMREQ+, BSDCND-, BSACKR and CLRREQ connect to system bus control 219. MEMREQ+ also connects to Test and Verification Logic 240, AOR and RAF control 235 and 2:1 MUX 209. Logic signals CYFIFO, CYREAD+ and FEMPTY+30 connect to FIFO R/W control 230. Logic signal NO HIT+ connects to directory 202. Logic signal MYACKD connects to an input of NAND 516 and BSDBPL connects to the other input of NAND 516 whose output connects to an input of OR 507 whose output, logic signal DATACK- connects to the CLOCK inputs of flop 508 and 509. Logic signal BSWAIT connects to an input of NAND 505 and MYDCNN+ connects to the other input of NAND 505 and a SET input to flop 504. Logic signal BLOCKF+ connects between the Q output of flop 504 and the other input to NAND 505 whose output connects to the other input of OR 507. Logic signal BSACKR connects to the CLOCK input of flop 504 whose Q output logic signal BLOCKF- connects to an input to NOR 536 and an input of AND 512. Logic signals NOHIT+, CYREAD and FEMPTY+30 connect to the inputs of NOR 501 whose output connects to an input of NOR 502 whose output connects to the SET input of flop 503. The Q output of flop 503, logic signal MEMREQ+ connects to the other input of NOR 502. The CLOCK0+ signal connects to the CLK input of flop 503 whose Q output logic signal MEMREQ+ connects to the RESET inputs of flops 508, 509 and 504 of the CLK input of flop 511. Logic \"1\" connects to the SET input of flop 508 whose output, logic signal DATCTO, connects to the SET input of flop 508 whose output, logic signal DATCTI, connects to an input of NAND 510 whose output logic signal MEMREQ RESET, connects to the RESET input of flop 503.</p><p>Logic signals ADDRWD+0A and ADDRW+0B connect to the inputs of their respective inverters 523 and 524 whose outputs, logic signals ADDRWD-0A and ADDRWD-0B connect to the inputs of AND 533 whose output connects to an input of NOR 527. FIFO41+ connects to another input of NOR 527. Logic signal FEMPTY+30 connects to inputs of NOR 526 and Inverter 534 whose output logic signal FEMPTY-30 connects to another input of NOR 527. Logic signal CYREAD connects to inputs of NOR 526 and 527. Logic signal NOHIT+ connects to an inverter 525 input whose output logic signal CAHIT connects to an input of NOR 526. The outputs of NOR 526 and 527 connect to their respective inputs of NOR 528 whose output connects to the D input of flop 529. The Q output of flop 529 logic signal CYCADN+, connects to inputs of inverters 520 and 532. The output of Inverter 530 connects to the input of Delay line 531 whose output connects to the RESET terminal of flop 529. The output of Inverter 532 is logic signal CYCADN- connects to cache CPU interface unit 6. CLOCK0+ connects to the CLK input of flop 509. Logic signal BANKED+00 connects between AOR and RAF control 235 and an input of inverter 537 whose output connects to the input of NOR 536 and the PRESET input of flop 508. Logic signal CYQLTO- connects to the other input of NAND 537. CYFIFO connects to the other input of NAND 510. Logic signals CYQLTO+ and CLEAR- connect to inputs of a NAND 561 whose output connects to inputs of delay lines 562 and 563 and an inverter 567a. The output of delay line 562 logic signal CYQLTO+0B connects to the input of an inverter 564 and to AOR and RAF control 235. The output of inverter 564, logic signal CYQLTO-1B connects to an input of a NOR 565 whose output logic signal CYQLTO+0D connects to the PRESET input of flop 503. The output of delay line 563, logic signal CYQLTO+0C connects to the other input of NOR 565. The output of inverter 567, logic signal CYQLTO-1A connects to AOR and RAF control 235.</p><p>Logic signals REPLACE and FIFO 17+ connect between inputs of an AND 567 and LR 204. Logic signal CYWRIT connects between FIFO RW control 230 and the 3rd input of AND 567 whose output connects between the input of a NOR 569 and a NAND 570. The output of NOR 569 logic signal MEMREQ+0e connects to an input of a NOR 502. Logic signal BAOR 10+10 connects between AOR 207, the input of an inverter 568 and the other input to NAND 570. The output of inverter 568, logic signal QLTDUN- connects to another input of NOR 569. The output of NAND 570 connects to the RESET input of a flop 571. Logic signal 1 connects to the PRESET and D inputs and logic signal CLEAR- connects between system bus control 219 and the CLK input of flop 571. The Q output logic signal CYQLTO+ connects to the 3rd input of NOR 569 and the Q output, logic signal, CYQLTO- connects to an input of AND 533.</p><p>During the first memory request cycle flop 503 sets on the rise of CLOCK0+ if the CPU2 requested address PRA is not stored in the directory 202. The output of NAND 231, FIG. 2, logic signal NO HIT+ is high forcing the output of NOR 501, FIG. 5, low, forcing the output of NOR 502 high setting flop 503. The Q output logic signal MEMREQ+ going high sets the cycle request flop 511 of system bus control 219 to request a bus 5 cycle. This acknowledge response from main memory 3, logic signal BSACKR going high sets flop 504 whose Q output BLOCKF+ inputs the AOR and RAF control 235 which is described supra.</p><p>If there is a \"hit\" during the first memory request cycle, the logic signal NO HIT+ input to inverter 525 is low, setting the logic signal CAHIT input to NOR 526 high setting the input to NOR 528 low, setting the D input to flop 529 high. FEMPTY+30 is high since FIFO 203 is empty. On the rise of timing signal CLOCK0+ flop 529 sets and the Q output logic signal CYCADN+ goes high forcing the output of inverter logic signal CYCADN- low which signals CPU2 that the requested data is available. Logic signal CYCADN+ is inverted by inverter 530, delayed 25 ns. by delay line 531 and resets flop 529. If there was not a \"hit\" in the first memory request cycle then during the cycle that sends the PRA data word from main memory 3 to cache 1 over bus 5, CYCADN+ is again set high as follows. The Read Address Multiplexer 233, FIG. 2, output logic signals ADDRWD+0B and ADDRWD+0A are low and are forced high by inverters 523 and 524 which set the output of AND 533 high, setting the output of NOR 527 low, setting the output of NOR 528 high, setting flop 529 as before. At this time FIFO 203 is not empty, and CYREAD is high at this time since logic signal CYFIFO, FIG. 3, has not cycled high.</p><p>Flops 508 and 509 are configured as a counter. For an interleaved memory, logic signal MYACKD goes high during each bus 5 cycle where the data word is sent from main memory 3 to cache 1 over bus 5 in response to a CPU2 request. Logic signal BSDBPL goes low for the 2nd word of the 2 word response or if only one word is sent from main memory 3 to cache 1 over bus 5. This happens when the word is in the high order address of a memory bank of main memory 3 to a memory request. This sets the output of NAND 506 low, forcing the output of OR 507 logic signal DATACK- low setting flop 508 in response to the 2nd word received from main memory 3. DATACK- goes low for the 4th word since MYACKD and BSDBPL- are again high setting flop 509 since the SET input logic signal DATCTO is high. The Q output of flop 509, logic signal DATCTI, going high sets the output of NAND 510, logic signal MEMREQ RESET low, resetting flop 503 through NOR 566. CLEAR- the other input to NOR 566 going low also resets flop 503. Flop 503 was held set through the logic signal MEMREQ- input to NOR 502 set low. This kept the SET input of flop 503 high at every rise of CLOCK0+. If the main memory 3 response to the 2nd memory request was logic signal BSWAIT high then the output of NAND 505 goes low forcing DATACK-, the output of OR 507 low thereby setting flop 508. Since the 2nd memory request is aborted if the main memory 3 response is BSWAIT, the Data Counter flop 508 must be set since only 2 data words will be received from main memory 3. For the banked memory, the input to inverter 537, logic signal BANKED+00, is high setting the output low which sets the PRESET input of flop 508 low setting the Q output, logic signal DATCTO, high. Since the banked memory system only makes one memory request and cache 1 received 2 data words in response, the 2nd data word in response will set flop 509 as above and reset flop 503. Logic signal MEMREQ+ going low resets flops 504, 508 and 509.</p><p>During a system initialization cycle, logic signal CLEAR- is transferred over bus 5 to receiver 217, FIG. 2, as a negative going pulse which sets flop 571, FIG. 5, on the rise of the trailing edge. This sets logic signal CYQLT0+ high and logic signal CYQLT0- low.</p><p>The output of NOR 561 is normally high. When logic signals CLEAR- and CYQLT0+, the inputs to NOR 561 are high, the output is forced low. 160 ns. later, the output of delay line, logic signal CYQLT0+0B is forced low which forces the output of inverter 564, logic signal CYQLTO-1B high. This signal inputs NOR 565. The other input to NOR 565, logic signal CYQLTO+0C, the output of delay line 563 is high at this time and remains high for 40 ns. This forces the output, logic signal CYQLTO+0D low for 40 ns. setting flop 503 and the Q output MEMREQ+ goes high starting a main memory 3 request cycle as before.</p><p>When logic signal MEMREQ+ is high, 2 bus 5 cycle requests are made by cache 1. The first request sends the even address to main memory 3 and the second address sends the odd address to main memory 3. The first data word to cache 1 cycle from the even address location of main memory 3 to cache 1 sets the data counter, flop 508, FIG. 5. The second data word to cache 1 cycle from the odd address location of main memory 3 sets the data counter flop 509 whose Q output logic signal DATCTI forces the output of NAND 510 low when CYFIFO is high thereby resetting the memory request flop 503 which in turn resets the data counter flops 508 and 509.</p><p>During the second data cycle, the input to AND 567, logic signal FIFO 17+, the low order address bit stored in LR 204, is high. The other inputs, logic signals CYWRIT and REPLACE going high force the output low. This forces the output of flop 569, logic signal MEMREQ+0C low, forcing the output of NOR 502 high. On the next rise of CLOCK0+ flip 503 sets and the Q output, MEMREQ+, again goes high starting the next bus 5 cycle request.</p><p>The logic signal CYQLTO- input to NOR 501, which is low during the QLT mode, simulates a directory 202 \"no hit\" condition.</p><p>When the 4096<sup>th</sup> word is requested from main memory 3 address location 7777<sub>8</sub>, AOR 207, FIG. 2, is incremented +1 by ADDER 211. The next address 10000<sub>8</sub> is set into AOR 207 as described supra. The output line BAOR 10+ is high and inputs NAND 570, FIG. 5. During the cycle when the 4096<sup>th</sup> data word is transferred from main memory 3 to cache 1 over bus 5 the inputs to AND 567, CYWRIT, REPLACE and FIFO17+ are high forcing the output, logic signal MEMREQ+0D high. This forces the output of NAND 570 low resetting flop 571 and the Q output, logic signal CYQLT0+ goes low. The logic signal QLTDUN- high input to NOR 569 prevents flop 503 from setting after the 4096<sup>th</sup> data word is received. Logic signal CYQLT0-, the input to AND 533, prevents flop 529 from setting.</p><h4>DETAILED DESCRIPTION OF SYSTEM BUS CONTROL 219--FIG. 5, Sheets 3 &amp; 4</h4><p>Logic signals BSAD 08-15, 16+ and 17- connect between the receiver 213 output and an AND 546 whose output logic signal MYCHAN, connects to the SET input of flop 516. BSMREF+ connects between receiver 217 and inverter 547 whose output BSMREF- connects to the AND 546 input. Logic signal BSDCNN+ connects between the receiver 217 cycle control 232, a delay line 522 input, and one input of an OR 521. The output of delay line 522 connects to the other input of OR 521 whose output logic signal BSDCNB+ connects to AOR and RAF control 235, Test and Verification Logic 240 and to the RESET terminal of flops 514, 516, 536, 574 and AOR and RAF control 235. The output of delay line 522, logic signal BSDCND+, also connects to the CLK terminals of flops 516, 536 and 574. Logic signal MYACKR connects between the Q output of flop 516 and the input terminals of delay lines 517, 518, Test and Verification Logic 240, AOR and RAF control 235, FIFO R/W control 230 and driver 218. The output of delay line 517 connects to an input of AND 520 whose output logic signal MYACKD connects to AOR and RAF 235 and to an input of NAND 506 in cycle control 232. The output of delay line 518 connects to an inverter 519 input whose output connects to the other input of AND 520. Logic \"1\" signal connects to the SET input of flop 536 whose Q output, logic signal BSDCND-, connects to an input of NAND 535 in cycle control 232. Logic \"1\" signal connects to the PRESET and D inputs of flop 511. The Q output of flop 511 logic signal CYREQ+ connects to an input of NAND 513. Logic signal BSBUSY- connects between an output of NOR 540 and the other input of NAND 513 whose output logic signal SETREQ- connects to a PRESET input of flop 515. Logic \"1\" signal connects to a PRESET input of flop 514. Logic signal BSDCND+ connects to the D input and the RESET input. MYDCNN- connects between a Q output of flop 541, the CLK input of flop 514 and the enabling inputs of drivers 212, 214 and 218. The Q output of flop 514 logic signal MYREQR+ connects to the CLK input of flop 515. The CLEAR- logic signal connects to the RESET input of flop 515. Logic signals BSWAIT and BLOCKF- connect to inputs of AND 512 whose output logic signal MYREQ+ connects to the D input of flop 515 whose Q output logic signal MYREQT connects to Driver 218 and an input to AND 542. BSDCNB+ connects to an inverter 544 input whose output connects to the input of AND 542 whose output, logic signal SETDCN- connects to the PRESET input of flop 541. Logic signals BSACKR and BSWAIT connect between inputs of NOR 543 and Receiver 217. The NOR 543 output connects to the RESET input of flop 541. CLEAR connects between an inverter 573 output and to the input of NOR 543. CLEAR- connects between an input of inverter 573 and receiver 217. BSDCNB- connects between the output of inverter 544 and an input of AND 538. BSREQT+ connects between the input of AND 538 and Receiver 217 and CLEAR connects to the input of AND 538 whose output connects to the input of delay line 539 and an input of NOR 540. The output of delay line 539 connects to the other input of NOR 540. The Q output of flop 541, logic signal MYDCNN+ connects to driver 218 and the input of NAND 535 in cycle control 232. The output of NOR 536, logic signal BSDCNB- connects to the input of NAND 535. Priority logic signals BSAUOK-BSIUOK connect between AND 542 inputs and receiver 217.</p><p>Logic signals MEMREQ+ and CLRREQ-0A connect between cycle control 232 and the CLK and RESET inputs respectively of flop 511. Logic signal BSDBPL+ connects between the SET input of flop 574 and receiver 217. The Q output of flop 574 connects to cycle control 232.</p><p>During the first memory request cycle, if the CPU2 requested data is not in cache 1 then the MEMREQ+ CLK input to flop 511 goes high setting the Q output, logic signal CYREQ+, the input to NAND 513 high. The logic signal BSBUSY- is high if the bus 5 is not busy and the output of NAND 513, logic signal SETREQ- goes low setting flop 515 whose Q output MYREQT goes high and inputs AND 542 requesting a bus 5 cycle. If bus 5 does not have a high priority request the logic signals BSAUOK through BSIUOK are high, and if bus 5 is not transferring information then logic signal BCDCNB- is high and the logic signal SETDCN- output of AND 542 goes low setting flop 541 and the Q output MYDCNN+ goes high gating drivers 212, 214 and 218 putting out on bus 5 information in the format 8b of FIG. 8. When main memory 3 receives the bus 5 information, the acknowledge logic signal BSACKR is sent back to cache 1 over bus 5 and reset flop 541 by setting the NOR 543 output low. The Q output, logic signal MYDCNN-, going high sets flop 514 whose Q output logic signal MYREQR+ high, resets flop 515 since the D input logic signal MYREQ is low. This sets the Q output logic signal MYREQT low. A BSWAIT signal returned by main memory 3 indicating that main memory 3 is busy, resets flops 541 since the output of NAND 543 goes low. However, since the output of AND 512 is high when flop 514 sets and its Q output logic signal MYREQR+ goes high, the Q output of flop 515, logic signal MYREQT remains high and the first memory request is repeated.</p><p>In the interleaved mode when main memory 3 acknowledges the first memory request by sending the BSACKR logic signal, flop 511 remains set with the Q output logic signal CYREQ+ high to start the second memory request cycle. Flop 511 remains set during the interleaved mode since the output of NAND 535 remains high as does the CLK input MEMREQ+. The CLRREQ+OB input to NAND 535 is low as long as BLOCKF- input to NOR 536 is high. Logic signal BLOCKF- goes low after the first BSACKR acknowledge. When MYDCNN+ goes high during the second memory request cycle flop 511 is reset since BLOCKF- is low.</p><p>However, if the system is in the banked mode flop 511 is reset since the output of NAND 535 in cycle control 232 goes low at the end of the first memory request cycle. Logic signal CLRREQ+OB, the input to NAND 535 is high forcing the output of NAND 535, logic signal CLRREQ-OA low when MYDCNN+ goes high. A second memory request cycle starts when logic signal BSREQT the input to AND 538 goes low when there is no request being made of bus 5 and the output of AND 538 goes low forcing the NOR 540 input low. 20 ns. later the other input to NOR 540 goes low forcing the output logic signal BSBUSY- high. Note that CLEAR is normally high and goes low during system initialization to reset functions. With both inputs to NAND 513 high, the output, logic signal SETREQ- going low again sets the Q output of flop 515 logic signal MYREQT high which requests a bus 5 cycle. Again the output of NAND 542 logic signal SETDCN- goes low setting flop 541 whose Q output logic signal MYDCNN+ goes high gating drivers 212, 214 and 218 to send out the second memory request in the format 8b of FIG. 8 over bus 5 to main memory 3. If main memory 3 sends back the acknowledge logic signal BSACKR flop 541 is reset as before which sets flop 514 which resets flop 515 setting the Q output logic signal MYREQT low. Logic signal MYDCNN+ the input to NAND 535 going high sets the RESET input to flop 511 low setting the Q output logic signal CYREQ+ low thereby preventing subsequent memory request bus 5 cycles. Logic signal CLEAR the input to NOR 543 also resets flop 541.</p><p>If main memory 3 were busy and sent back a BSWAIT logic signal in response to the second memory response, flop 541 resets since logic signal BSWAIT going high forces the NOR 543 output low, and the Q output of flop 541, logic signal MYDCNN- goes high setting flop 514 whose Q output logic signal MYREQR goes high. The D input to flop 515 is low since logic signal BLOCKF+ is high at this time forcing the output of NOR 572 low. This forces the output of AND 512, logic signal MYREQ+ low. When logic signal MYREQR+ goes high flop 515 resets setting the Q output logic signal MYREQT low. Since flop 511 was reset during the second memory request cycle as before the second memory request is aborted. However, in the QLT mode logic signal CYQLTO-, the input to NOR 572 is low forcing the output high. When the BSWAIT response is given the output of AND 512 is high setting flop 515. The Q output logic signal MYREQT high starts another memory request.</p><p>The flops 503, 504, 511, 514, 515, 529 and 541 are 74S74 circuits described on page 5-22 of the aforementioned TTL Data Book. Flops 508 and 509 are 74S112 logic circuits described on page 5-34 and flops 516, 536 and 574 are 74S175 logic circuits described on page 5-46 of the aforementioned TTL Data Book.</p><p>Main memory 3 sends the logic signals BSDCNN+ and the information in the format 8c of FIG. 8 out on bus 5 to receivers 213, 215 and 217 and the information is strobed into FIFO 203. BSAD 08-17 input AND 546 along with logic signal BSMREF- which was inverted by inverter 547. If the cache 1 identification is 0002<sub>8</sub>, that is BSAD16+ is high and BSAD 00-15 and 17- are high and that is not a main memory 3 write, i.e., BSMREF- is high, then the output of AND 546 logic signal MYCHAN goes high. Logic signal BSDCNN+ high sets the output of OR 521, logic signal BSDCNB+, high which sets the RESET input of flop 516 high. Logic signal BSDCNN+ is delayed 60 ns. by delay lines 522 and sets flop 516 whose output logic signal MYACKR going high advances the FIFO Write Address Counter flops 320 and 321, FIG. 3. This operation was described supra. Logic signal MYACKR high sets flops 305, FIG. 3, and the Q output logic signal INTERG+ going high gates the data through buffer bypass drivers 205, FIG. 2, to junction 216 since this first data word from main memory 3 is in response to the CPU2 request. Logic signal MYACKR also goes out on bus 5 to acknowledge to main memory 3 that cache 1 received the information sent out by main memory 3 addressed to cache 1. In FIG. 5, logic signal MYACKR is delayed 20 ns. by delay line 517 and inputs AND 520 whose output, logic signal MYACKD goes high 20 ns. after the rise of MYACKR. Logic signal MYACKR is delayed 40 ns. by delay line 518, is inverted by inverter 519 and sets the other input of AND 520 low. Logic signal MYACKD is a positive going 20 ns. pulse delayed 20 ns. from the rise of MYACKR. Logic signal MYACKD delays the setting of the Function Code History flops 412 and 413, FIG. 4, until after the data received from bus 5 is set into FIFO 203.</p><p>The above sequence is repeated in the interleaved mode for the 4 cycles in which the data words are transferred from main memory 3 to cache 1 in response to the first and second memory requests. In the banked mode the sequence is repeated for 2 cycles in response to the one memory request.</p><h4>SYSTEM BUS 5 FORMATS</h4><p>FIG. 8 shows the system bus 5 formats processed by cache 1 and/or main memory 3. 8a of FIG. 8 shows the memory address field with an 18 bit main memory 3 word address BSAD 05-22 of a 20 bit data word BSDT 00-15, A, B, DSDP 00, 08. This format is used by CPU2 to update main memory 3 over system bus 5. Cache 1 reads the address and data in FIFO 203 from bus 5 through receivers 213, 215 and 217. Cache 1 senses that logic signal BSMREF is high, indicating that the address field contains a main memory 3 address, senses that BSWRIT is high indicating this is a write operation, and checks if the address location is written into cache 1. If the address is found in directory 202, FIG. 2, then the data word stored in data store 201 is updated. If the address is not in the directory 202, then the data is discarded. A peripheral controller may send a 19 bit byte main memory 3 address BSAD 05-23. In that case, cache 1 would update byte 0 or byte 1 if either byte is stored in the data buffer 201.</p><p>8b of FIG. 8 shows the main memory 3 request sent from cache 1 to main memory 3. The address field contains the main memory 3 word address BSAD 05-22. The data field contains the 12 bit cache 1 identification code 0002<sub>8</sub>, BSDT A, B, 00-09 and the 6 bit function code 00<sub>8</sub> or 01<sub>8</sub>. A function code of 00<sub>8</sub> designates the bus cycle as the first memory request cycle. The function code of 01<sub>8</sub> designates the bus 5 cycle as the second memory request cycle. BSMREF is high since this is a request of main memory 3.</p><p>8c of FIG. 8 shows the main memory 3 response format to the memory read request 86 of FIG. 8. The address field contains the destination number of cache 1, 0002<sub>8</sub> and the function code 00<sub>8</sub>, indicating a response to a first memory request or the function code 01<sub>8</sub> indicating a response to a second memory request, BSWAIT+ indicates that main memory 3 is requesting cache 1 to write the data word in cache 1 at the address indicated by the 8b of FIG. 8 main memory 3 read request. BSSHBC high indicates that this is in response to a memory request. An interleaved memory main memory 3 request in the format of 8b of FIG. 8 contains PRA for the first request address and PRA+1 for the 2nd request address. Main memory 3 responds with the PRA and PRA+2 data words in response to the first request and the PRA+1 and PRA+3 data words in response to the 2nd request.</p><p>A banked memory main memory 3 request in the format of 8b of FIG. 8 contains PRA. Main memory 3 responds with the PRA and PRA+1 data words.</p><h4>ROUND ROBIN 224--FIG. 6</h4><p>Logic signal CYWRIT connects between FIFO R/W Control 230, the inputs to delay lines 603 and 605, CLK inputs of flops 610 and 611. The output of delay line 603 connects to the input of an AND 604. The output of delay line 605 connects to an input of an inverter 614 whose output connects to the other input of AND 604. The output of AND 604 connects to inputs of an inverter 606 and a NAND 607. The output of inverter 606, logic signal WRTPLS- connects to the ENABLE terminal of 2:1 MUX 223. Logic signal REPLACE connects between LR 204, the other input of NAND 607 and the SELECT terminal of 2:1 MUX 223. The outputs of AND 613a-d, logic signals LEVEL0-3+ connect to the \"1\" input terminals of 2:1 MUX 223. The output of NAND 607, logic signal RNDWRT- connects to the Write Enable terminals of Random Access Memory RAM 601 and 602; the Read Enable terminals are connected to ground.</p><p>Signal lines ADDR 08-17+ connect between 2:1 MUX 208 and the ADDRESS select terminals of RAM 601 and 602. Logic signal RNDAPP+ connects between NOR/AND 612 and the data input of RAM 601 whose data output ROUND0+0A connects to the D input of a flop 610. Logic signals BAOR 11+10 and BAOR 12+10 connect between AOR 207 and inputs to a NOR 608 whose output logic signal ROUNDR- connects to the D input of a flop 609. Logic signal CYFIFO connects between FIFO R/W control 230 and the CLK input of flop 609. The Q output of logic signal ROUND0-OR connects to the CLR inputs of flops 610 and 611. Logic signal CYQLTO+ connects between cycle control 232 and the CLR input of flop 609.</p><p>The Q output of flop 610, logic signal ROUND0+ connects to inputs of NOR/AND 612, AND 613c and AND 613d. The Q output, logic signal ROUND0- connects to the inputs of NOR2/AND 612, AND 613a and AND 613b. The Q output of flop 611, logic signal ROUND1+, connects to inputs of NOR1/AND 612, AND 613b and AND 613d. The Q output connects to inputs of NOR2/AND 612, AND 613a, AND 613c and the data input of RAM 602. The data output of RAM 602 connects to the D input of flop 611.</p><p>Signal lines HITO-3+ connect between the COMPARE 221a-d outputs and the 0 terminal of 2:1 MUX 223. Signal lines WRITE0-3 connect between the 2 terminal of 2:1 MUX 223 and data buffer 201 and directory 202.</p><p>Round robin 224 selects the next level of data buffer 201 and directory 202, FIG. 2, into which new information is written. Round robin 224 points to the oldest information for that column address ADDR 08-17. That is the information for replacement.</p><p>The two 1 bit by 1024 RAM 601 and 602 are set to level 0 for each column address; that is, the 1024 addresses in RAM 601 and the 1024 addresses in RAM 602 are set to 0 during the QLT mode.</p><p>Initially, logic signal CYQLT0+, the CLR input to flop 609 is high. Both inputs to NOR 608, logic signals BAOR 11+10 and BAOR 12+10 are low forcing the output logic signal ROUNDR- high. When logic signal CYFIFO goes high flop 609 sets and the Q output, logic signal ROUND0-0R goes low preventing flop 610 and 611 from setting. Logic signals ROUND0- and ROUND1- are high forcing the output of AND 613a, logic signal LEVEL0+ high.</p><p>The 2 inputs to NOR1/AND 612, logic signals ROUND0+ and ROUND1+ are low forcing the output logic signal RNDADD+ low. The data input to RAM 601 therefore is low. Since the Q output of flop 611, logic signal ROUND1- is high, the data input to RAM 602 is high.</p><p>During the QLT mode, the first 4096 data words in main memory 3 are written into the data buffer 201 and their respective row addresses ADDR 00-07-10 are written into directory 202. The first 1024 data words with their row addresses are written into level 0, the second 1024 data words with their row addresses are written into level 1, the third 1024 data words with their row addresses are written into level 2 and the last 1024 data words with their row addresses are written into level 3. The levels are selected by the round robin RAM 601 and 602.</p><p>For each of the first 1024 write cycles, logic signal CYWRIT the input to delay lines 603 and 605 goes high. 20 ns. later the output of delay lines 603 goes high. Both inputs to AND 604 are high and the output logic signal WRITPLS+ is high. REPLACE is high in the QLT mode. This forces the output of NAND 607, logic signal RNDWRT- low enabling the write function of RAM 601 and 602. The output of inverter 606, logic signal WRTPLS- goes low enabling 2:1 MUX 223. 50 ns. later the output of delay line 605 goes high forcing the output of inverter 614 low. This forces the output of AND 604 low forcing the output of inverter 606, logic signal WRTPLS- high. Logic signal RNDWRT-, the output of NAND 607 goes high terminating the write enable pulse.</p><p>All zeros are forced into the 1024 successive addresses of RAM 601 and all ones are forced into the 1024 successive addresses (0-1023) of RAM 602.</p><p>When address 1024 (2000<sub>8</sub>) is stored in AOR 207, BAOR 12+10 is high forcing the output of NOR 608, logic signal ROUNDR- low. When logic signal CYFIFO goes high, flop 609 resets and the Q output logic signal ROUND0-0R goes high. Flops 610 and 611 are now activated. ADDR 08-18+ selects address 0000<sub>8</sub> of RAM 601 and 602. The data output, logic signal ROUND0+0A is low and logic signal ROUND1+0A is high. When logic signal CYWRIT goes high flop 611 sets and the Q output logic signal ROUND1+ is high. Logic signals ROUND1+ high and ROUND0- high select the output of AND 613b, logic signal LEVEL 1+. Also, the output of NOR/AND 612 at address 0000<sub>8</sub> and a \"0\" in RAM 602 at address 000<sub>8</sub>.</p><p>This sequence continues until 1024 level 1 locations in data buffer 201 and directory 202 are filled and RAM 601 stores a \"1's\" and RAM 602 stores all \"0's\".</p><p>Logic signal BAOR 11+10 is high for the transfer of data words in addresses 2048 to 4096 keeping flop 609 reset. Flop 610 is set and flop 611 is reset for the 3rd 1024 data words with their row addresses to be written into data buffer 201 and directory 202. In this case, the output of AND 613c, logic signal LEVEL 2+ is high. During this 3rd sequence \"1's\" are written into all addresses of RAM 601 and 602.</p><p>During the 4th sequence flops 610 and 611 are set selecting the output of AND 613d, logic signal LEVEL 3+ high. This results in all 0's being written into RAM 601 and 602. During the sequence when the 4096th data word is transferred from main memory 3 and written into cache 1, logic signal CYQLT0+ goes low resetting flop 609 thereby enabling flips 610 and 611 for subsequent replacement and update operation.</p><p>Flop 609 is a 74S74 logic circuit described on page 5-22. Flops 610 and 611 are 74S175 logic circuits described on page 5-46 and NOR/AND 612 is a 74LS51 logic circuit described on page 5-16. The above are described in the aforementioned TTL Data Book.</p><h4>TEST AND VERIFICATION LOGIC--FIG. 10</h4><p>Logic signals MYACKR and BSDCNB+ connect between system bus control 219 and the CLR and RESET terminals of a flop 150. Logic signal BSSHBC+ connects between receiver 217 and an inverter 62 whose output, logic signal BSSHBC- connects to the D input of flop 50 and Logic 1 connects to the PRESET input of flop 50 whose Q output, logic signal BSSHBH connects to the inputs of an AND 51, an AND 57 and an AND 58. Logic signals BSDT 08, BSDT 14 and BSDT 12 connect between Receiver 217 and the other inputs of AND 51, AND 57 and AND 58 respectively.</p><p>The output of AND 51 connects to the CLK terminal of flop 52. The output of AND 57 connects to the CLK terminal of flop 59. The output of AND 58 connects to an input of an OR 60. Logic signal BSMCLR connects between Receiver 217 and the other input of OR 60 whose output, logic signal CLEAR+ connects to an inverter 61 input. The output, logic signal CLEAR- connects to Cycle Control 232, the PRESET terminal of flop 59 and an input of a NOR 54. Logic signal MEMREQ+ connects between Cycle Control 232, the input of a NAND 53 and the input to a NAND 55. Logic signal CACHRQ+ connects between cache-CPU Interface Unit 6, the input to an inverter 56 and the input to NAND 55. The output of inverter 56 logic signal CACHRQ- connects to the input of NAND 53 whose output connects to the input of NOR 54. The output of NOR 54 connects to the RESET terminal of flop 52. The Q output of flop 52, logic signal TESTMD, connects to the input of NAND 55 whose output, logic signal CNOMEN- connects to the RESET terminal of flop 59 and cache CPU Interface Unit 6. The Q output of flop 59, logic signal CACHON connects to Cache-CPU Interface Unit 6. Logic signals BSDT 09 and BSDT 15 connect between Receiver 215 and the D inputs of flop 52 and 59 respectively.</p><p>CPU2 starts a T&amp;V cycle by putting information out on bus 5. The information contains the cache identification 0002<sub>8</sub>, data bits BSDT 8, 9, 12, 14 and 15, the memory reference, BSMREF low and second-half bus cycle logic signal BSSHBC+ low.</p><p>Cache 1 in its normal monitoring of bus 5 receives the information as described supra. The cache identification bits input AND 546 and the output MYCHAN is forced high since logic signal BSDCNN+ is high, logic signal BSDCND+ the output of delay line 522 goes high setting flop 516 whose Q output MYACKR goes high acknowledging that cache 1 received the bus 5 information.</p><p>When logic signal MYACKR, the CLK input to flop 50, FIG. 10, goes high, flop 50 sets and the Q output, logic signal BSSHBH goes high.</p><p>During normal operation, main memory 3 sends the data word requested by cache 1, with the cache identification 0002<sub>8</sub> and line BSSHBC high indicating that this is the second half bus cycle in response to a memory request.</p><p>If data bit BSDT 12 is high indicating that the CPU2 is requesting that the cache be initialized and the low order 4096 words of main memory 3 be transferred to cache then the output of AND 58 is high forcing the output of OR 60, logic signal CLEAR+ high forcing the output of inverter 61, logic signal CLEAR- low. When data bit BSDT 12 goes low at the conclusion of the bus 5 cycle, logic signal CLEAR- goes high setting flop 571, FIG. 5. This forces the Q output, logic signal CYQLT0+ high thereby starting the QLT cycle. Flop 50, FIG. 10, resets at the end of the bus 5 cycle when logic signal BSDCNB+ goes low.</p><p>CPU2 by sending the data bit BSDT 12 high in the T&amp;V mode, results in cache 1 being loaded with the first 4096 address locations from main memory 3.</p><p>CPU2 now puts out on bus 5 T&amp;V information to put cache 1 off line. In this case, data bits BSDT 14 is high and BSDT 15 is low. Since logic signal BSSHBC+ is low, flop 150 again is set for the bus 5 cycle duration as described supra. When the Q output, logic signal BSSHBH goes high, the output of AND 57 going high resets flop 59. The Q output CACHON going high signals CPU2 that cache 1 is off line. Flop 59 was set at the start of the QLT cycle when the PRESET input, logic signal CLEAR- was forced low.</p><p>A number of tests are now possible. CPU2 may verify that directory 202 stores the row addresses of the first 4096 main memory 3 address locations.</p><p>CPU2 forces the cache request signal line CACHRQ+ high and sends, in FIG. 2 by way of signal lines BAOR 05-22, BAOR 05-22+, through 2:1 MUX 208 to directory 202. The first address location sent by CPU2 to cache 1 is 000000<sub>8</sub>. Column address 0000<sub>8</sub> location is read out of each of the 4 levels. The output is compared with row address 000<sub>8</sub>. In this case, level 0 stores row address 000<sub>8</sub>. This forces the output of comparator 221A high, forcing the output of NAND 231, logic signal NO HIT+ low.</p><p>Logic signal CACHRQ high, in FIG. 3, resets flop 313 and the Q output of FEMPTY-20 going low starts timing signal CLOCK0+ cycling. The rise of CLOCK0+ sets flop 529. Logic signal NO HIT+ low forced the output of NOR 526 low, forces the D input of flop 529 high. The Q output logic signal CYCADN+ going high forces the output of inverter 532, logic signal CYCADN- low. This signal received by CPU2 indicates that the row address sent to cache 1 was stored in the directory 202 at the column address set to cache 1.</p><p>The above sequence cycles through for 4096 address locations checking out all address locations in all levels of directory 202.</p><p>If there had been a \"no hit\" response, that is, the directory 202 did not store a row address then the logic signal NO HIT+ output of NAND 531, FIG. 2, would be high. This forces, in FIG. 5, the output of NOR 501 low, forcing the output of NOR 502 high. On the rise of CLOCK0+, flop 503, sets and the Q output, logic signal MEMREQ+ goes high requesting a bus 5 cycle as described supra.</p><p>In FIG. 10, CPU2 had previously sent out on bus 5 a T&amp;V cycle with signal bits BSDT 08 and BSDT 09 high with logic signal BSSHBC+ low. Again flop 50 is set and when the Q output, logic signal BSSHBH goes high, flop 52 sets. The D input signal bit BSDT 09 is high when the output of AND 51 is forced high setting flop 52. Flop 52 is set to test the no hit fault logic circuitry.</p><p>With the 3 inputs of NAND 55 high the output, logic signal CNOMEN- goes low signaling CPU2 that the row address sent to cache 1 was not stored in cache 1. The 3 inputs of NAND 55 high indicate that the NO HIT fault test mode was operative (TESTMD), that CPU2 requested a main memory address (CACHRQ+) and that the row address was not stored in the directory (MEMREQ+).</p><p>When CPU2 receives the CNOMEN- logic signal low indicating a no hit fault, CPU2 forces the CACHRQ+ logic signal low, forcing the output of inverter 56, FIG. 10 high. Since logic signal MEMREQ+ is high, the output of NAND 53 goes low forcing the output of NOR 54 low, resetting flop 52. Logic signal CNOMEN- going low also resets flop 59 putting cache 1 in the bypass mode.</p><p>CPU2 through signal bits BSDT 14 and BSDT 15 controls flop 59. During the T&amp;V mode with flop 50 set and the Q output BSSHBH high, signal bit BSDT 15 forces the D input of flop 59 high to put cache 1 on line and low to put cache 1 off line when the output of AND 57, the CLK input to flop 59 goes high.</p><p>In a similar manner, CPU2, through signal bits BSDT 08 and BSDT 09 control flop 52 in the T&amp;V mode. Signal bit BSDT 09 forces terminal D of flop 52 high to set the no hit fault mode and low to reset the No Hit Fault mode. With the Q output of flop 50, logic signal BSSHBH, high, flop 52 sets when the output of AND 51, the CLK input to flop 52 goes high.</p><p>Flops 50, 52 and 59 are 74S74 logic circuits described on page 5-22 of the aforementioned TTL Data Book.</p><h4>DESCRIPTION OF OPERATION--TEST AND VERIFICATION MODE</h4><p>CPU2 controls Test and Verification (T&amp;V) Logic of the system components including cache, two CPU2 instructions, Copy Register to A (CRA) and Copy A to Register (CAR) allow T&amp;V access to registers and control associated with the CPU2.</p><p>Two types of CRA instructions are available for testing the cache 1, the Load Cache Memory and the Store Cache Memory.</p><p>For the Load Cache Memory, the A register 2a, FIG. 2, in CPU2 contains the number of words to be transferred from main memory 3 to cache 1. Index Register 1 2b stores the starting address of the main memory 3 segment to be loaded into cache 1.</p><p>CPU2 requests a data word from cache 1 by sending to cache 1 over the private CPU - cache interface 6 a cache request signal and the main memory 3 address stored in Index Register 1 2b. Cache 1 requests the data word from CPU2 from main memory 3 over bus 5. Main memory 3 sends the data word to cache 1 where it is stored in data buffer 201 and sent to the CPU2. CPU2 discards the data word, increments the Index Register 1 2b and decrements Register A 2a. The above operation is repeated until Register A 2a counts down to zero. CPU2 then terminates the instruction performing a system bus 5 transfer from the CPU to cache to set the cache in a bypass mode, i.e., \"off line\". It is now possible to alter the contents of the main memory 3 segment used to load cache 1 without disturbing the contents of cache 1.</p><p>In the cache store memory operation, the A Register 2a contains the number of words to be read from cache 1 and stored in main memory 3. Index Register 2 2c contains the starting main memory 3 address for accessing cache 1. Index Register 3 2d contains the starting main memory 3 address to store the data words read from cache 1.</p><p>CPU2 resets the cache bypass mode, i.e., puts the cache \"on line\" and sets the no hit fault mode on. CPU2 requests a data word from cache 1 using the address stored in Index Register 2 2c and stores the data word in the main memory 3 location specified by Index Register 3 2d. After each cycle the A Register 2a is decremented and Index Registers 1 2b and 2 2c are incremented. If the CNOMEN- logic signal goes low indicating that the requested data is not in cache 1 then that signal is sent to CPU2. CPU2 performs an illegal store operation indicating that a hardware directory fault exists. Since the processing of faults in the CPU is not a part of this invention, no further description is given.</p><p>If no \"no hit\" fault occurs, then the above cycle is repeated until the A Register 2a has decremented to zero after which CPU2 puts the cache in a bypass mode and exits to the next instruction of the test program.</p><p>Therefore, under control of CPU2 through use of the CRA instructions, the cache 1 is loaded from one are of main memory 3. Cache 1 is then unloaded to another portion of main memory 3. If the No Hit Fault did not occur then CPU2 compares the data words in the two areas of main memory 3 for discrepancies. Apparatus in cache 1 under CPU2 control verifies that the data word address locations are written into cache 1 and also sets cache 1 \"off line\" and \"on line\" at the appropriate times during the above sequence.</p><p>For the purpose of the present invention the operations specified by the above CRA instructions are conventional. The Copy A to Register (CAR) instructions which initiate the Test and Verification mode are illustrated in FIG. 10.</p><p>The CAR instructions requested by CPU2 of cache 1 are listed in the following table.</p><p></p><pre listing-type=\"tabular\" xml:space=\"preserve\"><!--Greenbook tabular data-->______________________________________                                    \n              BSDT Signal Line States                                     \nCAR Instructions                                                          \n                8      9      12   14   15                                \n______________________________________                                    \nReset No Hit Fault                                                        \n                1      0      --   --   --                                \nSet No Hit Fault                                                          \n                1      1      --   --   --                                \nInitialize Cache                                                          \n                --     --     1    --   --                                \nBypass Cache    --     --     --   1    0                                 \nReset Bypass Cache                                                        \n                --     --     --   1    1                                 \n______________________________________                                    \n</pre><p>Note that each control function requires a separate bus 5 cycle with logic signal BSSHBC+ low.</p><p>The Test and Verification Mode starts in block 150, FIG. 11, as does every other communication with cache 1. In decision block 151, the clearing of cache 1 is not requested. Since there is bus 5 cycle, in decision block 152 logic signal BSDCNN is high starting a FIFO 203 Write Cycle in block 153. This generates the FIFO 203 write pulse logic signal FWRITE in block 154.</p><p>FIFO 203 stores, as described in block 155, the cache identification 0002<sub>8</sub>, data information BSDT 08, 09, 12, 14 and 15, the second half bus signal BSSHBC+ low indicating a T&amp;V control function and the memory reference signal BSMREF low indicating that this is not a main memory 3 write operation.</p><p>The bus 5 information is written into FIFO 203, FIG. 2, and also inputs T&amp;V logic 245. The information stored in FIFO 203 is not used if logic signal BSSHBC is low calling for the T&amp;V mode.</p><p>In decision block 156 the cache identification is verified logic signal MYCHAN goes high. In decision block 157, logic signal BSSHBC+ is tested and if low indicates in block 158 that bus 5 cycle, this calls for a T&amp;V operation and in block 159 MYACKR is set acknowledgeing that cache 1 has accepted the bus 5 cycle as described supra.</p><h4>Initialization</h4><p>CPU2 sends to cache 1 in decision block 160, bit position BSDT 12 high as CPU2 desires to fill data buffer 201 with the first 4096 data words of main memory 3 and fill directory 202 with the row addresses of the respective data word locations. This will enable CPU2 to test all 4 levels of the directory 202 and the round robin 224 logic circuitry. In block 161, the cache clear signal is generated which initiates the QLT operation of FIG. 9. In FIG. 10, the Q output of flop 50, logic signal BSSHBH is high. Since signal bit BSDT 12 is high the output of AND 58 is high forcing the output of OR 60 high. This forces the output of inverter 61, logic signal CLEAR- low. At the end of the bus 5 cycle, CLEAR- is forced high. This sets flop 571, FIG. 5, and the Q output, logic signal CYQLTO+ going high in block 162 starts the QLT operation. At the conclusion of the initialization operation CPU2 sends the Bypass Cache instruction to cache 1 over bus 5.</p><h4>No Hit Fault Set</h4><p>To verify the correct directory 202 and round robin 224 operation the CPU2 sets the NO HIT Fault flop 52, FIG. 10. CPU2 sends over bus 5 information as in block 163 with signal bits BSDT 08 and BSDT 09 both set to \"1\". Flop 52, FIG. 10, sets and the Q output, logic signal TESTMD is high in block 114.</p><h4>Set Bypass Cache</h4><p>CPU2, in order to assure that cache 1 is not updated during the cache 1 test operation, sets the cache off line by sending signal bits BSDT 14 high and BSDT 15 low to cache 1 in decision block 167. In FIG. 10, this reset flop 59. Logic signal CACHON- is forced high in block 168 indicating to CPU2 that cache 1 is off line.</p><h4>Directory 202 and Round Robin 224 Test</h4><p>CPU2 sends logic signals CACHRQ+ through private CPU2 Cache 1 Interface 6. The logic tests the various decision blocks 151 (if a cache clear signal was received), decision block 152 (if a bus 5 cycle is present), decision block 171 (if FIFO 203 is empty) and decision block 175 (if logic signal CACHRQ is high).</p><p>In block 176, with logic signal CACHRQ high, CLOCK0+ cycles since flop 313, FIG. 3, is set with the Q output, logic signal FEMPTY-20 going low. The first address location to be tested is sent by CPU2 to cache 1. Initially, address signal bus BAOR 05-22 carries address location 000000<sub>8</sub> for row address 0000<sub>8</sub>. In block 178 the Block Request flop 301, FIG. 3, sets to prevent another CLOCK0+ cycle by forcing the output of NAND 302 high which forces the output of NAND 304 low forcing the Q output of flop 313, logic signal FEMPTY-20 high. This forces the output of NOR 311, timing signal CLOCK0+ high.</p><p>Decision block 180 tests the Directory 202, FIG. 2, for the row address. In this case, the output of level 0, address bus ADDR 00-07-20 should equal row address ADDR 00-07-10 and the output of comparator 221A, logic signal HIT0+ is forced high, forcing the output of NAND 231, logic signal NO HIT+, low. As described supra, flop 529, FIG. 5, sets and the Q output logic signal CYCADN+ going high forces the output of inverter 532, logic signal CYCADN- low, signaling CPU2 that the cache 1 cycle is completed. CPU2 forces CACHRQ+ low. The data sent to CPU2 from the data buffer 201 on data bus CADP 00-19 is discarded.</p><p>CPU2 again forces logic signal CACHRQ+ high and sends over address bus BAOR 05-22, address location 000001<sub>8</sub> and the above sequence is repeated. If the operation cycles for 4096 successive address locations then the directory 202 and round robin 224 logic circuitry is operating correctly.</p><p>CPU2 checks out the NO HIT logic by sending the cache 1 an address location greater than 4096. In this case, in decision block 180 there will not be a \"hit\" and in block 181 the memory request flop 503, FIG. 5, sets and the Q output logic signal MEMREQ+ goes high. The output of NOR 501 is forced low since logic signal NO HIT+, the output of NAND 231, FIG. 2, is high. Flop 503, FIG. 5, sets on the rise of timing signal CLOCK0+.</p><p>In decision block 182 the NO HIT Fault flop 52, FIG. 10, is tested and if set in block 183, logic signal CNOMEN-, the output of NAND 55 is forced low since the 3 inputs logic signals TESTMD, MEMREQ+ and CACHRQ+ are high. Logic signal CNOMEN- signals CPU2 that a NO HIT Fault was detected. Logic signal CNOMEN- going low also resets the Bypas Cache flop 59, FIG. 10, to take cache 1 off line. CPU2 forces logic signal CACHRQ low which, with MEMREQ+ high in FIG. 10, forces the output of NAND 53 low, which forces the output of NOR 54 low resetting flop 52 and the Q output logic signal TESTMD goes low. The operation is concluded in block 184.</p><p>The CPU2 takes appropriate action when receiving logic signal CNOMEM- low. In the above example, logic signal CNOMEM- low denoted correct operation. If logic signal CNOMEM- was forced low during the above sequence of the CPU2 requesting the first 4096 address locations that would have denoted incorrect operation and the CPU2 would have taken corrective action. Since the CPU2 operation is not a part of the invention, it is only described insofar as necessary to provide continuity to the description.</p><h4>No Hit Fault Reset</h4><p>Decision block 165 resets the NO HIT fault flop 52, FIG. 10, in block 166 since signal bits BSDT 08 is high and BSDT 09 is low.</p><h4>Reset Bypass Cache</h4><p>Decision block 169 sets the Bypass Cache flop 59, FIG. 10 in block 170, since signal bits BSDT 14 and BSDT 15 are high. The Q output logic signal CACHON- low indicates to CPU2 that cache 1 is on line. CPU2 turns cache on line by sending T&amp;V information on.</p><p>During the bus 5 cycle, decision block 171 tests logic signal BSDCNN. When it is low in block 172, MYACKR is reset concluding the bus 5 cycle in block 193.</p><p>FIG. 12 shows the timing relationships during the Test and Verification cycle and also during the No Hit Fault cycles.</p><p>BSDCNN 270 going high signals cache 1 that information is on bus 5. The information is decoded in cache 1 and if the cache identification code 0002<sub>8</sub> is sensed with logic signal BSMREF+ low then the output of AND 546, FIG. 5, is high and flop 516 sets. The Q output MYACKR 271, FIG. 12, goes high setting flop 150, FIG. 10. The Q output, BSSHBH 273, FIG. 12, going high conditions the T&amp;V logic of FIG. 10. One or two signal bits BSDT 08, 09, 12, 14 or 15 272, FIG. 12, are high for the cycle. If the BSDT 08 and BSDT 09 are high then TESTMD 274 the output of flop 152, FIG. 10, goes high. If BSDT 12, 272, is high then CLEAR- 275 goes low forcing CYQLT0+ 276 high at the rise of CLEAR- 275. This initiates the QLT mode which transfers the first 4096 main memory 3 address locations to cache 1.</p><p>CPU2 tests cache 1 during No Hit Fault Cycles and TESTMD 274 is high by forcing CACHRQ+ 277 high. This forces FEMPTY-20 278 low and a clock cycle CLOCK0+ 279 results. If HIT0-3 280 goes high indicating that the row address sent by CPU2 to cache 1 was stored in the column address location of directory 202 then CYCADN- 281 negative going pulse is sent to CPU2 and CACHRQ 277 is forced low.</p><p>CPU2 sends another CACHRQ+ 277. In this case there is not hit. Hit 0-3 280 remains low and MEMREQ+ 282 is forced high initiating the CNOMEM- 283 negative going pulse which is sent to CPU2. CPU2 then forces CACHRQ+ 277 low.</p><p>CPU2 then takes the necessary corrective action which is not further described since it is not a part of the invention.</p><p>CACHON-284 goes low if BSDT 14 and BSDT 15 are high. CACHON-284 also goes low when CLEAR- 275 goes low. CNOMEN- 283 going low forces CACHON-284 high indicating to the CPU2 that the cache 1 is off line.</p><p>FIG. 9 is a flow diagram illustrating the Quality logic test (QLT) mode. As a result of system initialization, a negative going CLEAR- signal is sent over bus 6 to cache 1. As a consequence of receiving the CLEAR- signal, the contents of the first 4096 address locations in main memory 3 are stored in the 4 levels of data buffer 201, FIG. 2. The directory 202 is loaded with the respective row addresses of the first 4096 address locations and the round robins RAMs are set point to Level 0 as the first level in data buffer 201 and directory 202 to be replaced.</p><p>FIG. 7 is a timing diagram of the QLT operation and will be used with FIG. 9 in the description of the overall operation.</p><p>START 901 designates a bus 5 transfer cycle. Cache 1 receives all bus 5 transfers for possible updating or replacement. These operations are described in copending related applications 1 and 3 listed supra.</p><p>In the QLT operation logic signal CLEAR- is received by cache 1 over bus 5. This is indicated by START 900.</p><p>The decision block 901 selects the QLT mode 902 and in block 903, flop 571, FIG. 5, sets on the rise of logic signal CLEAR- and Q output logic signal CYQLTO+ goes high. This forces the output of NOR 561 low and logic signal CYQLTO-1A, the output of inverter 567a is forced high. Logic signal CYQLTO+OB, the output of delay line 562 remains high for 160 ns. In FIG. 4 the output of NAND 443 goes low forcing the output of NOR 419, logic signal AORCNT, high.</p><p>In block 904 the output of ADDER 211, FIG. 2, signal lines AORO 05-22+ are at 000000<sub>8</sub>. The output of NAND 241 is high switching 2:1 MUX 209 to allow signal lines AORO 05-22+ through to input AOR 207.</p><p>Logic signal AORCNT, FIG. 4, forces logic signals BAWRIT, the output of NAND 416 low, and BAORCK, the output of NAND 424 low writing the PRA 000000<sub>8</sub> into AOR 207, FIG. 2, and location 00 into RAF 206. 70 ns. later logic signal AORCNT-30, the output of inverter 423, goes low advancing the RAF write address counter 234 to location 01.</p><p>160 ns. after logic signal CYQLTO+ rises, logic signal CYQLTO+00, the output of NOR 565, FIG. 5, goes low setting flop 503. This forces the Q output MEMREQ+ high, block 905, setting flop 511. This forces the Q output, logic signal CYCRSQ+ high, block 906, requesting a bus 5 cycle in block 907.</p><p>In FIG. 7, timing signal CLEAR- 701 goes high at 0 ns. of the first bus 5 request forcing CYQLTO+ 701 high. This results in BAWRIT 710 and BAORCK 711 going low strobing 000000<sub>8</sub> into AOR 207 and RAF 206. AORCNT-30 713 advances the RAF write address counter 234 to location 01. 160 ns. after the rise of CYQLTO+ 702, CYQLTO+0D 703 falls forcing MEMREQ+ 704 high which forces CYCREQ+ 705 high.</p><p>In decision block 907a logic signal BSBUSY-, the input to NAND 513, FIG. 5, goes high. Since logic signal CYCREQ+ is high, flop 513 sets and the Q output MYREQT goes high in block 907b.</p><p>In block 907c, if there is no higher priority request on bus 5 then the output of NAND 542 goes low setting flop 541. The Q output logic signal MYDCNN+ going high, block 907d enables drivers 212, 214 and 218 which send out on bus 5 in block 907c  the output of AOR 207, 000000<sub>8</sub>, the cache 1 identication and function code, BSDBPL and BSMREF.</p><p>The response from main memory 3 in decision block 907f BSACKR, acknowledging the information sent from cache 1 is sent back over bus 5. Signal BSACKR is applied to the input of NOR 543, FIG. 5, thereby forcing the output low. This results in flop 541 resetting flop 514 setting and flop 515 resetting. This is shown in block 907, FIG. 9. The Q outputs MYDCNN+ and MYREQT are now low and in block 907k, the Bus Cycle Request is concluded.</p><p>If the main memory 3 response was BSWAIT in decision block 907f then in decision 907g the output of NOR 543, FIG. 5, goes low resetting flop 541 and the Q output, logic signal MYDCNN+ goes low. In blocks 907h and 907g the output of NOR 572, FIG. 5, is high forcing the output of AND 512 high keeping flop 515 set with the Q output logic signal MYREQT high, requesting another bus 5 cycle.</p><p>PRA+1 address (000000<sub>8</sub>) now appears at the output of ADDER 211 in block 908.</p><p>The BSACKR response to the first bus 5 cycle request sets flop 504, FIG. 5, and the Q output BLOCKF+ is high. Since the write address counter 234 is set to location 01, the output of NOR 417, FIG. 4, goes low forcing the output of NOR 419, logic signal AORCNT high. This loads 000001<sub>8</sub> into AOR 207 and location 01 of RAF 206. When logic signal AORCNT-30 goes low the RAF write address counter advances to location 02.</p><p>If FIG. 7, MYREQT 706 goes high forcing MYDCNN+ 707 high when the bus 5 is available. MYDCNN- strobes the cache 1 information onto bus 5 and when main memory 3 receives the information it sends back BSACKR 708 which resets MYDCNN+ 707 and sets BLOCKF 709. MYDCCN+ going low causes MYREQT 706 to reset. When the bus 5 is no longer busy MYREQT 706 goes high requesting another bus 5 cycle. When Block F 709 goes high to start the 2nd bus 5 cycle request BAWRIT 710 and BAORCK 711 strobe the address appearing at the output of ADDER 211, FIG. 2, into AOR 207 and RAF 206. AORCNT-30 713 then advances the RAF write address counter 234 to location 02.</p><p>Since CYCREQ+ 705 is still high in the 2nd bus 5 cycle request MYREQT 706 again goes high requesting the bus 5 cycle.</p><p>Block 907-i requests the 2nd bus 5 cycle and blocks 907a-j as described above, send the next address in sequence out on bus 5 with the cache identification 0002<sub>8</sub>, the function code, BSDBPL and BSMREF.</p><p>In FIG. 7, MYREQT 706 high starts the 2nd bus 5 cycle request by forcing MYDCNN+ 707 high which resets CYCREQ+ 705 and strobes the information out on bus 5 as before. When main memory 3 receives the information, BSACKR 708 is sent to cache 1 over bus 5 and resets MYDCNN 707 which results in MYREQT 706 resetting.</p><p>In block 910, cache 1 waits for the first data word from main memory 3. In block 900, information is on bus 5. In decision block 901 CLEAR is not set selecting decision block 911 where BSDCNN+ is high indicating that information on bus 5 is to be written into FIFO 203 in block 912. In block 912 a logic signal FWRITE, the output of NAND 332, FIG. 3, forces the write enable terminal OF FIFO 203 low and in FIG. 2 the output of receivers 213, 215 and 217 are strobed into FIFO 203. As shown in block 912b FIFO 203 is loaded with the data word in response to the first bus 5 cycle request whereby PRA 000000<sub>8</sub> was sent to main memory 3. Also loaded into FIFO 203 are the Octal Cache I.D. (0002<sub>8</sub>) and the function code (00<sub>8</sub>) signals, as well as logic BSDBPL high, BSMREF Low and BSSHBC high.</p><p>Decision block 912c tests the cache identification code for 0002<sub>8</sub> and that BSMREF is low. In that case in FIG. 5 the output of AND 546, logic signal MYCHAN goes high starting the second half bus cycle of block 913.</p><p>In block 913a with logic signal MYCHAN high, the CLK input of flop 516, logic signal BSDCND+ goes high, flop 516 sets and the Q output, logic signal MYACKR goes high and acknowledges to main memory 3 that the information was received.</p><p>In block 913b the output of NAND 322, FIG. 3, logic signal FPLUS1 sets the FIFO 203 write address counter flop 320 thereby advancing the counter. This forces the output of comparator 318 low resulting in flop 313 setting. The Q output logic signal FEMPTY+20 going low starts timing signal CLOCK0+ the output of NOR 311 to cycle in block 913c.</p><p>Since the function code is 00<sub>8</sub>, BSAD23 is low in decision block 913d, that in 913f the FCHZRO, flop 413, FIG. 4, sets and a \"1\" is forced into FIFO 203 bit position 42.</p><p>Decision block 913g tests for BSDBPL high. In the QLT mode BSDBPL is low and flop 574, FIG. 5, remains reset and the Q output, logic signal BSDBPL- is high forcing the output of NAND 506 low setting the output of NOR 507, logic signal DATACK- low setting the data counter flop 508.</p><p>Decision block 913 2 is tested for flop 509, FIG. 5, set. In this case flop 509 is not set and the output of NAND 510 remains high. In decision block 913j, logic signal BSDCNN+ is tested and 60 ns. after it goes low in block 913k, flop 516 resets and the Q output logic signal MYACKR falls and cache 1 goes into an idle cycle waiting in start block 900.</p><p>The second data word in response to the 2nd Bus Cycle Request 907-1 is transferred to cache 1. When BSDCNN+ is high FIFO write block 912-1 is activated since the data word is from an odd address location in main memory 3.</p><p>The FIFO write sequence described above is repeated through blocks 912a-c to second half bus cycle block 913-1. The second half bus cycle sequence of blocks 913a-g is repeated. In block 913h data counter flop 509, FIG. 5, is set and the Q output logic signals CYFIFO and DATCTI high in decision block 913i forces the output of NAND 510 low resetting flop 503 in block 913n and the Q output logic signal MEREQ+ falls.</p><p>The MYACKR flop 516 is reset as previously described. In block 913a, logic signal MEMREQ+ going low resets flops 508, 509, 504, FIG. 5 and 413, FIG. 4. This forces logic signals DATCTO, DATCTI, BLOCKF+ and FCHZRO low.</p><p>Cache 1 returns to START 900 for the first FIFO 203 read cycle.</p><p>In FIG. 7, BSDCNN+ 714 is high to start the FIFO write cycle in which the first data word from the even address location in main memory 3 is transferred to cache 1. FWRITE 715 strobes the bus 5 information into FIFO 203. MYACKR 716 is forced high when FIFO 203 contains the Cache I.D. 0002<sub>8</sub> and BSMREF is low. MYACKR 716 high advances the FIFO write address counter by forcing F PLUS 1 717 low. FIFO 203 is now not empty and FEMPTY+20 goes low starting CLOCKO+ 719 to cycle to start the first FIFO 203 read cycle.</p><p>During the first word to cache cycle BSDBPL low forced the data counter clock pulse DATACK 728 low. During the 2nd FIFO write cycle BSDBPL is again low and DATACK 728 is again forced low forcing DATCTI 729 high. This resets MEMREO+ 704 which resets BLOCK F 709 and DATCTI 729.</p><p>In block 913b of the second half bus cycle, the FIFO write address counter was incremented. This set the output of comparator 318, FIG. 3, logic signal FEMPTY+ low, indicating in decision block 916 that FIFO 203 was not empty, starting the clock cycling by setting flop 313 in block 913c and started a FIFO read operation in block 914.</p><p>The FIFO read address counter flops 316 and 317 select in block 914a the FIFO address from which information is transferred from FIFO 203 to LR 204.</p><p>Since the output of decision block 914b is high, that is the bit position 41 of FIFO 203 is high, the replacement block 915 is selected. The update block 914c is not active in the QLT operation.</p><p>RAF 206 stores the address for the data word stored in the selected FIFO 203 address location. In block 915a the RAF read address multiplexer 4:1 MUX 414 and 415, FIG. 4, select location 00. Logic signal CYQLTO- is low forcing the output of NOR 440 high forcing select terminal 2 of 4:1 MUX 414 and 415 high. Since bit position 18 of FIFO 203 is low, select terminal 1 of 4:1 MUX 414 and 415 are low; therefore input terminal 2 is enabled. 4:1 MUX 414 input terminal 2 is low as is input terminal 2 of 4:1 MUX 415.</p><p>In block 915b, the address from location 00 of RAF 206 and the data word and controls from FIFO 203 are transferred to LR 204 on the rise of logic signal CYFIFO. The output of AND 324, FIG. 3, is high and on the rise of timing signal CLOCK0+  flop 323 sets and the Q output, logic signal CYFIFO goes high loading LR 204.</p><p>Decision block 915c tests BAOR11 and BAOR12. If both are low indicating that the first 1024 data words are being transferred then in block 915d the Round Robin Register is held reset selecting level 0 of the data buffer 201 and directory 202. In FIG. 6 the output of NOR 608 logic signal ROUNDR- is high. When logic signal CYFIFO goes high flop 609 sets and the Q output, logic signal ROUND-OR goes low holding flops 610 and 611 reset. In block 915e therefore the Q outputs logic signals ROUND0- and ROUND1- are high forcing the output of AND 613a logic signal LEVEL 0+ high.</p><p>In block 915h at the selected column address, the data word is written into the data buffer 201, the row address is written into the directory 202 and the round robin RAM's are incremented +1. The output of NOR 340, FIG. 3, is high forcing the output of NOR 325 low when logic signal CYFIFO is high, forcing the output of NOR 327 high. This sets flop 330 and the Q output CYWRIT goes high. In FIG. 6 logic signal CYWRIT high develops a 30 ns. negative going pulse delayed 20 ns. to the enable input of 2:1 MUX 223. This forces logic signal WRITE0 high, writing the data word into level 0 of data buffer 201 and writing the row address into directory 202 at the selected column address. The output of NAND 607 goes low enabling the write input of RAM 601 and 602 forcing a \"1\" in RAM 602 and a \"0\" in RAM 601 at the selected column address ADDR 08-17+.</p><p>In decision block 914c, address locations between 1024 and 4095 have bit positions BAOR 11+10 and/or BAOR 12+10, the output of AOR 207, FIG. 2, high. In block 915f normal round robin 224 operation takes place, i.e., in FIG. 6, the output of RAM 601 and 602 at the column address location ADDR 08-17+ is loaded into flops 610 and 611 at the rise of logic signal CYWRIT. The output of flops 610 and 611 is decoded by AND 613a-d in block 915g to select the level in directory 202 and data buffer 201 into which the data word is written. This was described supra.</p><p>The FIFO Read timing is shown in FIG. 7 by F PLUS 1 717 advancing the FIFO 203 write address counter flops 320 and 321, FIG. 3. This results in flop 313 setting the Q output FEMPTY+20 718 going low starting CLOCK0+ 719, loading the data word and control bits from FIFO 203 and the address location from RAF 206 in LR 204. LR 726 shows the timing.</p><p>CYREAD 721 and CYWRITE 722, the Q and Q outputs respectively of flop 330, FIG. 3, switch on the rise of CLOCK0+ 719 when CYFIFO 720 is high. REPLACE 723 is high since FIFO bit position 41 is high for the QLT operation. REPLACE 723 comes high at the rise of CYFIFO 720 and remains high for the 4096 data word QLT transfer.</p><p>WRITE 0-3- 727 is generated in round robin 224, FIG. 6. Logic signal CYWRIT outputs AND 604 as a positive going pulse 30 ns. wide, delayed 20 ns. which is inverted by inverter 606 and enables 2:1 MUX 223. Since the select input logic signal REPLACE is high, the 1 input terminal is activated. The rise of logic signal CYWRIT sets the selected output of RAM's 601 and 602 into flops 610 and 611 forcing one of the outputs of AND 613a-d, logic signals LEVEL 0-3+, high. This selected signal inputs terminal 1 of 2:1 MUX 223 and exits terminal 2, is inverted by inverter 255, FIG. 2 and enables the writing into data buffer 201 and directory 202 as the negative going 30 ns. wide pulse WRITE 0-3-.</p><p>The FIFO read address counter is advanced by BUMP UP 724 which causes FEMPTY+20 718 to go high and stop CLOCK0+ 719 from cycling. However, the odd word is being received by cache 1 from main memory 3 so that F PLUS 1 717 again advances the FIFO write address counter, forcing FEMPTY+20 718 low keeping CLOCK0+ 719 cycling to store the odd word in the data buffer 201, and its row address in the directory 202. After the odd word is stored FEMPTY+20 718 stays high and CLOCKO+ 720 remains high at the completion of the cycle which stores the data word from the odd address location into cache 1.</p><p>In FIG. 9, decision block 915i is tested for the 4096th word. If the last word was not received then in block 915j the address at the ADDER 211 output, FIG. 2 is incremented +1 and the RAF write address counter 234 is advanced.</p><p>Decision block 915k is tested. If the data word received into FIFO 203 is from an even address location in main memory 3 then cache 1 returns to START 900 to await the next word from main memory 3 from the odd address location. If the data word received into FIFO 203 is from an odd address location in main memory 3 then in block 9151 the next address is loaded into AOR 207 and RAF 206 and the write address counter 234 is advanced. Note that in block 915j the WAC 234 is advanced an extra count for each data word transferred. This is so the WAC 234 stores the even address location in location 00 of RAF 206 and the odd address location in location 01 of RAF 206. Locations 02 and 03 are not used.</p><p>In block 915, flop 503, FIG. 5, is set. The output of AND 567 is high, since input signals CYWRIT, REPLACE and FIFO 17+20 are high. This forces the output of NOR 569, logic signal MEMREQ+0C low forcing the output of NOR 502 high setting flop 503 on the next rise of timing signal CLOCK0+. The Q output logic signal MEMREQ+ going high starts a memory request cycle by returning to block 906 where the cycle request flop 511 is set and the Q output, logic signal CYCREQ+ goes high.</p><p>In FIG. 7, MEMREQ+ 704 goes high at the end of the cycle in which the data word from the odd address location in main memory 3 is written into cache 1. This occurs when CYWRITE 722 is high on the last rise of CLOCK0+ 719.</p><p>Cache 1 continues to cycle, first requesting 2 data words from main memory 3, then writing those data words in data buffer 201 and the row address in directory 202 until in decision block 915i, the 4096th word is received into LR 204, FIG. 2. In that case BAOR 10+10, are input to NAND 570, FIG. 5, is high. When the output of AND 567 goes high during the cycle in which the data word from the odd address location is written into cache, the output of NAND 570 goes low resetting flop 571. In block 915n this forces the Q output, logic signal CYQLTO+ low concluding the QLT operation.</p><p>BAOR 10+10 high forces the output of inverter 568, logic signal QLTDUN- low forcing the output of NOR 569, logic signal MEMREQ+0C high. This forces the output of NOR 502 low. With the D input low, flop 503 resets on the next rise of timing signal CLOCK0+ and the Q output logic signal MEMREQ+ goes low preventing further requests of main memory 3.</p><p>In FIG. 7, QLTDUN 712 goes high during the last bus 5 cycle request forcing MEMREQ+ 704 low at the next rise of CLOCK0+  719. CYQLTO+ 702 goes low during the next cycle when CYWRITE 722 is high, the data word from the odd address location is in LR 726 at the last rise of CLOCK0+ 719.</p><p>While in accordance with the provisions and statutes there has been illustrated and described the best form of the invention known, certain changes may be made to the system described without departing from the spirit and scope of the invention as set forth in the appended claims and that in some cases, certain features of the invention may be used to advantage without a corresponding use of other features.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Thomas F.", "last_name": "Joyce", "name": ""}, {"first_name": "William", "last_name": "Panepinto, Jr.", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "HONEYWELL INFORMATION SYSTEMS INC."}], "ipc_classes": [{"primary": true, "label": "G06F  11/00"}, {"primary": false, "label": "G06F  13/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  12/16        20060101AFI20051220RMJP"}, {"label": "F02B  75/02        20060101A N20051008RMEP"}, {"label": "G06F  12/08        20060101ALI20051220RMJP"}, {"label": "G06F  11/267       20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "714042"}, {"primary": false, "label": "714E1116"}], "ecla_classes": [{"label": "G06F  11/267"}, {"label": "R02B75:02S4"}], "cpc_classes": [{"label": "F02B2075/027"}, {"label": "F02B2075/027"}, {"label": "G06F  11/267"}, {"label": "G06F  11/267"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1977-12-22", "application_date": "1977-12-22", "family_members": [{"ucid": "CA-1126405-A1", "titles": []}, {"ucid": "CA-1126405-A", "titles": [{"lang": "FR", "text": "INDICATEUR D'ABSENCE EN ANTEMEMOIRE EN  MODE DE TEST"}, {"lang": "EN", "text": "OUT OF STORE INDICATOR FOR A CACHE  STORE IN A TEST MODE"}]}, {"ucid": "YU-163182-A1", "titles": []}, {"ucid": "YU-163182-A", "titles": [{"lang": "EN", "text": "SYSTEM FOR INITIALIZING THE CACHE STORAGE"}]}, {"ucid": "US-4190885-A", "titles": [{"lang": "EN", "text": "Out of store indicator for a cache store in test mode"}]}, {"ucid": "JP-S5496937-A", "titles": [{"lang": "EN", "text": "DATA PROCESSING SYSTEM HAVING CACHE STORAGE NO MEMORY DISPLAY UNIT IN TEST MODE"}]}]}