{"patent_number": "US-5694572-A", "publication_id": 71592255, "family_id": 23436798, "publication_date": "1997-12-02", "titles": [{"lang": "EN", "text": "Controllably operable method and apparatus for predicting addresses of future operand requests by examination of addresses of prior cache misses"}, {"lang": "EN", "text": "IN A DATA PROCESSING SYSTEM"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"docdb\" mxw-id=\"PA10644863\" source=\"national office\"><p>In a data processing system which employs a cache memory feature, a method and exemplary special purpose apparatus for practicing the method are disclosed to lower the cache miss ratio for called operands. Recent cache misses are stored in a first in, first out miss stack, and the stored addresses are searched for displacement patterns thereamong. Any detected pattern is then employed to predict a succeeding cache miss by prefetching from main memory the signal identified by the predictive address. The apparatus for performing this task is preferably hard wired for speed purposes and includes subtraction circuits for evaluating variously displaced addresses in the miss stack and comparator circuits for determining if the outputs from at least two subtraction circuits are the same indicating a pattern yielding information which can be combined with an address in the stack to develop a predictive address. The cache miss prediction mechanism is only selectively enabled during cache \"in-rush\" following a process change to increase the recovery rate; thereafter, it is disabled, based upon timing-out a timer or reaching a hit ratio threshold, in order that normal procedures allow the hit ratio to stabilize at a higher percentage than if the cache miss prediction mechanism were operated continuously.</p></abstract>"}, {"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA37702385\"><p>In a data processing system which employs a cache memory feature, a method and exemplary special purpose apparatus for practicing the method are disclosed to lower the cache miss ratio for called operands. Recent cache misses are stored in a first in, first out miss stack, and the stored addresses are searched for displacement patterns thereamong. Any detected pattern is then employed to predict a succeeding cache miss by prefetching from main memory the signal identified by the predictive address. The apparatus for performing this task is preferably hard wired for speed purposes and includes subtraction circuits for evaluating variously displaced addresses in the miss stack and comparator circuits for determining if the outputs from at least two subtraction circuits are the same indicating a pattern yielding information which can be combined with an address in the stack to develop a predictive address. The cache miss prediction mechanism is only selectively enabled during cache \"in-rush\" following a process change to increase the recovery rate; thereafter, it is disabled, based upon timing-out a timer or reaching a hit ratio threshold, in order that normal procedures allow the hit ratio to stabilize at a higher percentage than if the cache miss prediction mechanism were operated continuously.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"1\"><claim-text>1. An operand address prediction procedure for selectively predicting operand request addresses from historic cache miss addresses practiced in a data processing system incorporating a processor for running successive processes, a cache memory and a main memory, the procedure comprising the computer-implemented steps of:<claim-text>during the system hardware, firmware and software design procedure, performing the preliminary step of:<claim-text>A) establishing a first in, first out miss stack for storing a plurality of cache miss addresses by employing at least a selected one of hardware, firmware and software design and implementation techniques; and, during system operation, performing the following steps within the system:</claim-text><claim-text>B) waiting for a cache miss resulting from the absence in the cache of called information requested of the cache;</claim-text><claim-text>C) when a cache miss occurs, placing the address of the called information onto the top of the miss stack;</claim-text><claim-text>D) selecting, from among a plurality of pattern groups comprising a pattern repertoire, a current pattern group;</claim-text><claim-text>E) examining the cache miss addresses resident in the miss stack for a match with a selected address pattern in the current pattern group;</claim-text><claim-text>F) if the selected pattern is not matched, determining if all the patterns in the current group have been examined;</claim-text><claim-text>G) if all the patterns in the current pattern group have not been examined, selecting, from the current pattern group, a different pattern than the pattern last examined and returning to step E);</claim-text><claim-text>H) if all the patterns in all the groups in the pattern repertoire have been searched, returning to step B);</claim-text><claim-text>I) if all the patterns in the current pattern group have been examined, assigning a new pattern group, different from the pattern group last examined, as the current group, selecting a pattern from the new current group and returning to step E); and</claim-text><claim-text>J) if the selected pattern is matched:<claim-text>1) using the matched pattern and at least one of the addresses in the miss stack to calculate a predictive address pointed to a signal group stored in the main memory;</claim-text><claim-text>2) prefetching into cache memory from the main memory the signal group identified by the predictive address; and</claim-text><claim-text>3) assigning another group as the current group and returning to step E);<claim-text>wherein said procedure of said steps B through J is performed only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximum rate of increase in the operative hit rate of said cache memory is reached following said process change.</claim-text></claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"2\"><claim-text>2. The system of claim 1 in which the operand address prediction procedure is disabled at the end of a predetermined period which begins when a new process is commenced.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim num=\"3\"><claim-text>3. The system of claim 2 in which the predetermined period is specified by the new process.</claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"4\"><claim-text>4. The system of claim 1 in which the operand address prediction procedure is disabled when a predetermined instantaneous cache hit ratio is reached.</claim-text></claim>"}, {"num": 5, "parent": 4, "type": "dependent", "paragraph_markup": "<claim num=\"5\"><claim-text>5. The system of claim 4 in which the predetermined cache hit ratio is specified by the new process.</claim-text></claim>"}, {"num": 6, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"6\"><claim-text>6. In a data processing system including a processor for running successive processes, a cache memory, a main memory and an operand address prediction mechanism for developing a predictive address for prefetching operands, each identified by an address, from the main memory into the cache memory, which operand address prediction mechanism comprises a first mechanism including:<claim-text>A) a first in, first out stack for storing a plurality of addresses representing cache misses;</claim-text><claim-text>B) a plurality of electronic switch means each having a plurality of address inputs and a single address output;</claim-text><claim-text>C) means coupling said addresses stored in said stack individually to said electronic switch means inputs in predetermined orders;</claim-text><claim-text>D) means for switching said electronic switch means to transfer said addresses applied to said electronic switch means inputs to said electronic switch outputs to establish at said electronic switch outputs predetermined combinations of said addresses;</claim-text><claim-text>E) at least two subtraction circuit means, each said subtraction circuit means being coupled to receive a unique pair of addresses from said electronic switch means outputs and to issue a value representing the displacement therebetween;</claim-text><claim-text>F) at least one comparator circuit means coupled to receive a pair of outputs from a corresponding pair of said subtraction circuit means and responsive thereto for issuing a prefetch enable logic signal if there is a compare condition;</claim-text><claim-text>G) predictive address development means adapted to combine one of said addresses appearing at one of said electronic switch outputs and displacement information appearing at one of said subtraction circuit means to obtain a predictive address;<claim-text>whereby, the coordinated presence of said predictive address and said prefetch enable logic signal causes a signal group identified by said predictive address to be prefetched from said main memory into said cache memory; and</claim-text><claim-text>a control circuit coupled to said first mechanism for enabling said first mechanism to operate only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximum rate of increase in the operative hit rate of the cache memory is reached following said process change.</claim-text></claim-text></claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim num=\"7\"><claim-text>7. The system of claim 6 in which said first mechanism is disabled at the end of a predetermined period which begins when a new process is commenced.</claim-text></claim>"}, {"num": 8, "parent": 7, "type": "dependent", "paragraph_markup": "<claim num=\"8\"><claim-text>8. The system of claim 7 in which said predetermined period is specified by the new process.</claim-text></claim>"}, {"num": 9, "parent": 6, "type": "dependent", "paragraph_markup": "<claim num=\"9\"><claim-text>9. The system of claim 6 in which said first mechanism is disabled when a predetermined instantaneous cache hit ratio is reached.</claim-text></claim>"}, {"num": 10, "parent": 9, "type": "dependent", "paragraph_markup": "<claim num=\"10\"><claim-text>10. The system of claim 9 in which said predetermined cache hit ratio is specified by the new process.</claim-text></claim>"}, {"num": 11, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"11\"><claim-text>11. An operand address prediction procedure for selectively predicting operand request addresses from historic operand cache misses practiced in a data processing system incorporating a processor for running successive processes, a cache memory, a main memory and a data stack, said procedure comprising the computer-implemented steps of:<claim-text>A) waiting for an operand cache miss resulting from the absence in the cache of a called operand requested of said cache memory;</claim-text><claim-text>B) when an operand cache miss occurs, entering the address of the called operand on the top of said stack;</claim-text><claim-text>C) examining said stack for an address pattern among the operand miss addresses resident therein following step B);</claim-text><claim-text>D) if a pattern is not matched, returning to step A; and</claim-text><claim-text>E) if a pattern is matched:<claim-text>1) using the matched pattern and at least one of the addresses in said stack to calculate a predictive address pointing to a signal group stored in said main memory;</claim-text><claim-text>2) prefetching into said cache memory from said main memory the signal group pointed to by said predictive address; and</claim-text><claim-text>3) returning to step A); wherein said procedure of said steps A-E is performed only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximium rate of increase in the operative hit rate of said cache memory is reached following said process change.</claim-text></claim-text></claim-text></claim>"}, {"num": 12, "parent": 11, "type": "dependent", "paragraph_markup": "<claim num=\"12\"><claim-text>12. The procedure of claim 11, wherein said predetermined event occurs at the end of a predetermined period following said process change.</claim-text></claim>"}, {"num": 13, "parent": 12, "type": "dependent", "paragraph_markup": "<claim num=\"13\"><claim-text>13. The procedure of claim 12 wherein said predetermined period is determined by the process commencing execution following said process change.</claim-text></claim>"}, {"num": 14, "parent": 11, "type": "dependent", "paragraph_markup": "<claim num=\"14\"><claim-text>14. The procedure of claim 11, wherein said predetermined event occurs when said operative hit rate reaches a predetermined value.</claim-text></claim>"}, {"num": 15, "parent": 14, "type": "dependent", "paragraph_markup": "<claim num=\"15\"><claim-text>15. The procedure of claim 14, wherein said predetermined value is determined by the process commencing execution following said process change.</claim-text></claim>"}, {"num": 16, "parent": 11, "type": "dependent", "paragraph_markup": "<claim num=\"16\"><claim-text>16. The procedure of claim 11 wherein said procedure comprises the additional step preceding step A of:<claim-text>during the design procedure for the system comprising said processor, cache memory, main memory and data stack, establishing said stack as a first in, first out stack for storing a plurality of said addresses of called operands; and<claim-text>performing steps A-E during system operation.</claim-text></claim-text></claim-text></claim>"}, {"num": 17, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"17\"><claim-text>17. The method for predicting operand addresses of operand requests in a data processing system in which a cache thereof is repeatedly interrogated to determine whether an address corresponding to a request operand address is stored therein, which stored operand address corresponds to an operand also stored in said cache; wherein said data processing system includes a main memory and a stack for holding addresses; said method being carried out by said data processing system in operating said cache, characterized by the computer-implemented steps of:<claim-text>A) upon the occurence of a cache miss when an operand is requested from said cache, entering the request operand address into said stack;</claim-text><claim-text>B) examining the request operand addresses present in said stack to determine whether one of a plurality of predetermined operand address patterns is represented by said request operand addresses; and</claim-text><claim-text>C) (1) if no one of said patterns is determined to be represented in step (B), returning to step (A), but<claim-text>(2) (i) if one of said patterns is determined to be represented in step (B), generating an operand address of a predicted operand request,<claim-text>(ii) using said generated operand address to obtain an operand from said main memory and write such operand into said cache, and</claim-text><claim-text>(iii) returning to step (A); wherein said method of steps A-C is performed only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximum rate of increase in the operative hit rate of said cache is reached following said process change.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 18, "parent": 17, "type": "dependent", "paragraph_markup": "<claim num=\"18\"><claim-text>18. The method of claim 17, further characterized by:<claim-text>in step C(2), said operand address is generated by performing a calculation using said one predetermined pattern and one of said request operand addresses present in said stack.</claim-text></claim-text></claim>"}, {"num": 19, "parent": 18, "type": "dependent", "paragraph_markup": "<claim num=\"19\"><claim-text>19. The method of claim 18, wherein said stack is a first in-first out stack, further characterized by:<claim-text>in step (A), said request operand address is entered on the top of said stack.</claim-text></claim-text></claim>"}, {"num": 20, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"20\"><claim-text>20. Apparatus for controllably generating a predicted operand address of an operand request in a data processing system in which a cache thereof is repeatedly interrogated to determine whether an address corresponding to a request operand address is stored therein, which stored operand address corresponds to an operand also stored in said cache; wherein said data processing system includes a store for holding a plurality of said addresses in respective cells thereof; said apparatus being characterized by:<claim-text>a controllable operand address prediction mechanism comprising:<claim-text>a plurality of switches, each of said switches having a plurality of input terminals, an output terminal and a control terminal, whereby a control signal applied to said control terminal causes said switch to couple one of said input terminals to said output terminal;</claim-text><claim-text>said control signal being delivered to said control terminals to cause the input terminals of said switches to be successively coupled to said output terminals;</claim-text><claim-text>a circuit coupling each of said input terminals of said switches to one of said cells;</claim-text><claim-text>a plurality of first arithmetic circuits, each of said first arithmetic circuits having a pair of input terminals and an output terminal, the input terminals of each of said first arithmetic circuits being coupled to the respective output terminals of two of said switches, each of said first arithmetic circuits performing an arithmetic operation on the two addresses received by its input terminals from the two cells of said store coupled to said input terminals by said two switches and delivering a signal at its output terminal which represents the result of said arithmetic operation;</claim-text><claim-text>a plurality of comparators, each of said comparators having a pair of input terminals and an output terminal, the input terminals of each of said comparators being coupled to the respective output terminals of two of said first arithmetic circuits, each of said comparators comparing the two arithmetic result signals received thereby and delivering a signal at its output terminal denoting whether said result signals are alike;</claim-text><claim-text>a second arithmetic circuit having a pair of input terminals and an output terminal, a first input terminal of said second arithmetic circuit being coupled to the output terminal of one of said switches and the second input terminal of said second arithmetic circuit being coupled to the output terminal of one of said first arithmetic circuits, said second arithmetic circuit performing an arithmetic operation on the address received by said first input terminal and the arithmetic result represented by the signal received by said second input terminal and delivering an output signal at its output terminal which represents the result of said arithmetic operation performed by said second arithmetic circuit;</claim-text><claim-text>whereby when the signals delivered at the output terminals of all of said comparators denote that the compared arithmetic results are alike, the arithmetic result represented by the concurrent output signal of said second arithmetic circuit represents said predicted operand request address; and</claim-text></claim-text><claim-text>a control circuit coupled to said prediction mechanism for enabling said prediction mechanism to operate only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximum rate of increase in the operative hit rate of said cache is reached following said process change.</claim-text></claim-text></claim>"}, {"num": 21, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"21\"><claim-text>21. The method for predicting operand addresses of operand requests in a data processing system in which a cache thereof is repeatedly interrogated to determine whether an operand address corresponding to a requested operand is stored therein, said cache storing operands and their corresponding operand addresses; wherein said data processing system includes a main memory; said method being carried out by said data processing system in operating said cache, characterized by the computer-implemented steps of:<claim-text>A) upon the generation of and interrogation of said cache by a request operand address,</claim-text><claim-text>B) determining whether a plurality of earlier-generated request operand addresses correspond to one of a plurality of predetermined operand address patterns, and</claim-text><claim-text>C) (1) if no one of said patterns is determined to correspond to said plurality of request operand addresses in step (B), returning to step (A), but<claim-text>(2) (i) if one of said patterns is determined to correspond to said plurality of request operand addresses, generating an operand address of a predicted operand request using said one pattern,<claim-text>(ii) obtaining the operand from the main memory location represented by said predicted operand address and writing said operand into said cache, and</claim-text><claim-text>(iii) returning to step (A),</claim-text></claim-text></claim-text><claim-text>wherein said method of steps A-C is performed only during intervals which commence immediately after a process change and terminate upon the first occurence of a succeeding predetermined event, which predetermined event occurs after the maximum rate of increase in the operative hit rate of said cache is reached following said process change.</claim-text></claim-text></claim>"}, {"num": 22, "parent": 21, "type": "dependent", "paragraph_markup": "<claim num=\"22\"><claim-text>22. The method of claim 21, wherein said steps A-C are disabled at the end of a predetermined period which begins when a new process is commenced.</claim-text></claim>"}, {"num": 23, "parent": 21, "type": "dependent", "paragraph_markup": "<claim num=\"23\"><claim-text>23. The method of claim 21, wherein said steps A-C are disabled when a predetermined cache hit rate is reached.</claim-text></claim>"}, {"num": 24, "parent": 21, "type": "dependent", "paragraph_markup": "<claim num=\"24\"><claim-text>24. The method of claim 21, wherein said predetermined event occurs at the end of a predetermined period following said process change.</claim-text></claim>"}, {"num": 25, "parent": 24, "type": "dependent", "paragraph_markup": "<claim num=\"25\"><claim-text>25. The method of claim 24, wherein said predetermined period is determined by the process commencing execution following said process change.</claim-text></claim>"}, {"num": 26, "parent": 21, "type": "dependent", "paragraph_markup": "<claim num=\"26\"><claim-text>26. The method of claim 21, wherein said predetermined event occurs when the operative hit rate reaches a predetermined value.</claim-text></claim>"}, {"num": 27, "parent": 26, "type": "dependent", "paragraph_markup": "<claim num=\"27\"><claim-text>27. The method of claim 26, wherein said predetermined value is determined by the process commencing execution following said process change.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES317731307\"><?RELAPP description=\"Other Patent Relations\" end=\"lead\"?><h4>CROSS REFERENCE TO RELATED APPLICATION</h4><p>This is a Continuation-in-Part of U.S. patent application Ser. No. 07/364,943, filed Jun. 12, 1989, for CACHE MISS PREDICTION METHOD AND APPARATUS by Charles P. Ryan, now U.S. Pat. No. 5,093,777.</p><?RELAPP description=\"Other Patent Relations\" end=\"tail\"?><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>FIELD OF THE INVENTION</h4><p>This invention relates to the art of data processing systems which include a cache memory feature and, more particularly, to a method and apparatus for selectively predicting memory cache misses for operand calls and using this information to transfer data from a main memory to cache memory to thereby lower the cache miss ratio.</p><h4>BACKGROUND OF THE INVENTION</h4><p>The technique of employing a high speed cache memory intermediate a processor and a main memory to hold a dynamic subset of the information in the main memory in order to speed up system operation is well known in the art. Briefly, the cache holds a dynamically variable collection of main memory information fragments selected and updated such that there is a good chance that the fragments will include instructions and/or data required by the processor in upcoming operations. If there is a cache \"hit\" on a given operation, the information is available to the processor much faster than if main memory had to be accessed to obtain the same information. Consequently, in many high performance data processing systems, the \"cache miss ratio\" is one of the major limitations on the system execution rate, and it should therefore be kept as low as possible.</p><p>The key to obtaining a low cache miss ratio is obviously one of carefully selecting the information to be placed in the cache from main memory at any given instant. There are several techniques for selecting blocks of instructions for transitory residence in the cache, and the more or less linear use of instructions in programming renders these techniques statistically effective. However, the selection of operand information to be resident in cache memory at a given instant has been much less effective and has been generally limited to transferring one or more contiguous blocks including a cache miss address. This approach only slightly lowers the cache miss ratio and is also an ineffective use of cache capacity.</p><p>Thus, those skilled in the art will understand that it would be highly desirable to provide means for selecting operand information for transitory storage in a cache memory in such a manner as to significantly lower the cache miss ratio. That end was accomplished in accordance with the invention disclosed and claimed in U.S. Pat. application No. 364,943, filed Jun. 12, 1989, now U.S. Pat. No. 5,093,777 by special purpose apparatus in the cache memory which stores recent cache misses and searches for operand patterns therein. Any detected operand pattern is then employed to anticipate a succeeding cache miss by prefetching from main memory the block containing the predicted cache miss.</p><p>It has been determined, however, that under certain operating conditions, the full time use of the foregoing procedure can actually raise the long term miss ratio (i.e., lower the long term hit ratio).</p><p>In a typical cache based processor that executes a single process during a given period, the cache hit ratio will stabilize after some time interval following the institution of the process. If a change to another process is made, new instructions and data must be loaded into the cache such that cache hit ratio instantaneously drops dramatically and then increases as the new process is \"experienced\". If the cache miss prediction mechanism is in operation, the initial rate of increase in the cache hit ratio is much faster. However, the hit ratio never reaches the level it would reach in the long term if the cache miss prediction mechanism was not in use. This result is caused by the fact that the cache miss prediction mechanism continues to find and load from main memory the next possible miss which, however, is not used, thus forcing the cache to replace blocks that are more important.</p><p>The invention disclosed and claimed herein overcomes the limiting effect of using the cache miss prediction mechanism continuously after a process has been changed.</p><h4>OBJECTS OF THE INVENTION</h4><p>It is therefore a broad object of this invention to provide an improved cache memory in a data processing system.</p><p>It is another object of this invention to provide a cache memory particularly characterized by exhibiting a lower cache miss ratio in operation.</p><p>It is a more specific object of this invention to provide a cache memory selectively incorporating circuitry for effectively predicting cache misses during an \"in-rush\" period following a process change.</p><h4>SUMMARY OF THE INVENTION</h4><p>Briefly, these and other objects of the invention are achieved by special purpose apparatus which stores recent cache misses and searches for address patterns therein. Any detected pattern is then employed to anticipate a succeeding cache miss by prefetching from main memory the block containing the predicted cache miss. The cache miss prediction mechanism is only selectively enabled during cache \"in-rush\" following a process change to increase the recovery rate; thereafter, it is disabled, based upon timing-out a timer or reaching a hit ratio threshold, in order that normal procedures allow the hit ratio to stabilize at a higher percentage than if the cache miss prediction mechanism were operated continuously.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>DESCRIPTION OF THE DRAWING</h4><p>The subject matter of the invention is particularly pointed out and distinctly claimed in the concluding portion of the specification. The invention, however, both as to organization and method of operation, may best be understood by reference to the following description taken in conjunction with the subjoined claims and the accompanying drawing of which:</p><p>FIG. 1 is a generalized block diagram of a typical data processing system employing a cache memory and therefore constituting an exemplary environment for practicing the invention;</p><p>FIG. 2 is a flow diagram illustrating, in simplified form, the sequence of operations by which the address prediction feature of the invention is practiced;</p><p>FIG. 3 is a logic diagram of a simple exemplary embodiment of the address prediction mechanism;</p><p>FIG. 4 is a logic diagram of a more powerful exemplary embodiment of the address prediction mechanism;</p><p>FIG. 5 is a graph showing generalized curves of the cache hit recovery characteristics after a change of process using, not using and selectively using the address prediction mechanism;</p><p>FIG. 6 is a block diagram of a first embodiment of the invention; and</p><p>FIG. 7 is a block diagram of a second embodiment of the invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF THE INVENTION</h4><p>Referring now to FIG. 1, there is shown a high level block diagram for a data processing system incorporating a cache memory feature. Those skilled in the art will appreciate that this block diagram is only exemplary and that many variations on it are employed in practice. Its function is merely to provide a context for discussing the subject invention. Thus, the illustrative data processing system includes a main memory unit 13 which stores the data signal groups (i.e., information words, including instructions and operands) required by a central processing unit 14 to execute the desired procedures. Signal groups with an enhanced probability for requirement by the central processing unit 14 in the near term are transferred from the main memory unit 13 (or a user unit 15) through a system interface unit 11 to a cache memory unit 12. (Those skilled in the art will understand that, in some data processing system architectures, the signal groups are transferred over a system bus, thereby requiring an interface unit for each component interacting with the system bus.) The signal groups are stored in the cache memory unit 12 until requested by the central processing unit 14. To retrieve the correct signal group, address translation apparatus 16 is typically incorporated to convert a virtual address (used by the central processing unit 14 to identify the signal group to be fetched) to the real address used for that signal group by the remainder of the data processing system to identify the signal group.</p><p>The information stored transiently in the cache memory unit 12 may include both instructions and operands stored in separate sections or stored homogeneously. Preferably, in the practice of the present invention, instructions and operands are stored in separate (at least in the sense that they do not have commingled addresses) memory sections in the cache memory unit 12 inasmuch as it is intended to invoke the operation of the present invention as to operand information only.</p><p>The cache miss prediction mechanism which is a feature of the invention is based on recognizing and taking advantage of sensed patterns in cache misses resulting from operand calls. In an extremely elementary example, consider a sensed pattern in which three consecutive misses ABC are, in fact, successive operand addresses with D being the next successive address. This might take place, merely by way of example, in a data manipulation process calling for successively accessing successive rows in a single column of data. If this pattern is sensed, the likelihood that signal group D will also be accessed, and soon, is enhanced such that its prefetching into the cache memory unit 12 is in order.</p><p>The fundamental principles of the cache miss prediction mechanism are set forth in the operational flow chart of FIG. 2. When a processor (or other system unit) asks for an operand, a determination is made as to whether or not the operand is currently resident in the cache. If so, there is a cache hit (i.e., no cache miss), the operand is sent to the requesting system unit and the next operand request is awaited. However, if there is a cache miss, the request is, in effect, redirected to the (much slower) main memory.</p><p>Those skilled in the art will understand that the description to this point of FIG. 2 describes cache memory operation generally. In the context of the present invention, however, the address of the cache miss is meaningful. It is therefore placed at the top of a miss stack, which stack will be described in further detail below. The miss stack (which contains a history of the addresses of recent cache misses in consecutive order) is then examined to determine if a first of several patterns is present. This first pattern might be, merely byway of example, contiguous addresses for the recent cache misses. If the first pattern is not sensed, additional patterns are tried. Merely by way of example again, a second pattern might be recent cache misses calling for successive addresses situated two locations apart. So long as there is no pattern match, the process continues through the pattern repertoire. If there is no match when all patterns in the repertoire have been examined, the next cache miss is awaited to institute the process anew.</p><p>However, if a pattern in the repertoire is detected, a predictive address is calculated from the information in the miss stack and from the sensed pattern. This predictive address is then employed to prefetch from main memory into cache the signal group identified by the predictive address. In the elementary example previously given, if a pattern is sensed in which consecutive operand cache miss operand addresses ABC are consecutive and contiguous, the value of the predictive address, D, will be C+1.</p><p>In order to optimize the statistical integrity of the miss stack, the predictive address itself may be placed at the top of the stack since it would (highly probably) itself have been the subject of a cache miss if it had not been prefetched in accordance with the invention.</p><p>Since speed of operation is essential, the cache miss prediction mechanism may advantageously be embodied in a \"hard wired\" form (e.g., in a gate array) although firmware control is contemplated. Consider first a relatively simple hardwired implementation shown in FIG. 3. A miss stack 20 holds the sixteen most recent cache miss addresses, the oldest being identified as address P with entry onto the stack being made at the top. Four four-input electronic switches 21, 22, 23, 24 are driven in concert by a shift pattern signal via line 25 such that: in a first state, addresses A, B, C, D appear at the respective outputs of the switches; in a second state, addresses B, D, F, H appear at the outputs; in a third state, addresses C, F, I, L appear at the outputs; and in a fourth state, addresses D, H, L, P appear at the outputs. Subtraction circuits 26, 27, 28 are connected to receive as inputs the respective outputs of the electronic switches 21, 22, 23, 24 such that: the output from the subtraction circuit 26 is the output of the switch 21 minus the output of the switch 22; the output from the subtraction circuit 27 is the output of the switch 22 minus the output of the switch 23; and the output from the subtraction circuit 28 is the output of the switch 23 minus the output of the switch 24.</p><p>The output from the subtraction circuit 26 is applied to one input of an adder circuit 31 which has its other input driven by the output of the electronic switch 21. In addition, the output from the subtraction circuit 26 is also applied to one input of a comparator circuit 29. The output from the subtraction circuit 27 is applied to the other input of the comparator circuit 29 and also to one input of another comparator circuit 30 which has its other input driven by the output of the subtraction circuit 28. The outputs from the comparator circuits 29, 30 are applied, respectively, to the two inputs of an AND-gate 32 which selectively issues a prefetch enable signal.</p><p>Consider now the operation of the circuit shown in FIG. 3. As previously noted, miss stack 20 holds the last sixteen cache miss addresses, address A being the most recent. When the request for the signal group identified by address A results in a cache miss, circuit operation is instituted to search for a pattern among the addresses resident in the miss stack. The electronic switches 21, 22, 23, 24 are at their first state such that address A is passed through to the output of switch 21, address B appears at the output of switch 22, address C appears at the output of switch 23 and address D appears at the output of switch 24. If the differences between A and B, B and C, and C and D are not all equal, not all the outputs from the subtraction circuits 26, 27, 28 will be equal such that one or both the comparator circuits 29, 30 will issue a no compare; and AND-gate 32 will not be enabled, thus indicating a \"no pattern match found\" condition.</p><p>The switches are then advanced to their second state in which addresses B, D, F, H appear at their respective outputs. Assume now that (B-D)=(D-F)=(F-H); i.e., a sequential pattern has been sensed in the address displacements. Consequently, both the comparators 29, 30 will issue compare signals to fully enable the AND-gate 32 and produce a prefetch enable signal. Simultaneously, the output from the adder circuit 31 will be the predictive address (B+(B-D)). It will be seen that this predictive address extends the sensed pattern and thus increases the probability that the prefetched signal group will be requested by the processor, thereby lowering the cache miss ratio.</p><p>If a pattern had not have been sensed in the address combination BDFH, the electronic switches would have been advanced to their next state to examine the address combination CFIL and then on to the address combination DHLP if necessary. If no pattern was sensed, the circuit would await the next cache miss which will place a new entry at the top of the miss stack end push address P out the bottom of the stack before the pattern match search is again instituted.</p><p>Consider now the somewhat more complex and powerful embodiment of the cache miss prediction mechanism illustrated in FIG. 4. Electronic switches 41, 42, 43, 44 receive at their respective inputs recent cache miss addresses as stored in the miss stack 40 in the exemplary arrangement shown. It will be noted that each of the electronic switches 41, 42, 43, 44 has eight inputs which can be sequentially selectively transferred to the single outputs under the influence of the shift pattern signal. It will also be noted that the miss stack 40 stores, in addition to the sixteen latest cache miss addresses A-P, three future entries WXY. Subtraction circuits 45, 46, 47 perform the same office as the corresponding subtraction circuits 26, 27, 28 of the FIG. 3 embodiment previously described. Similarly, adder circuit 48 corresponds to the adder circuit 31 previously described.</p><p>Comparator circuit 49 receives the respective outputs of the subtraction circuits 45, 46, and its output is applied to one input of an AND-gate 38 which selectively issues the prefetch enable signal. Comparator circuit 50 receives the respective outputs of the subtraction circuits 46, 47, but, unlike its counterpart comparator 30 of the FIG. 3 embodiment, its output is applied to one input of an OR-gate 39 which has its other input driven by a reduce lookahead signal. The output of OR-gate 39 is coupled to the other input of AND-gate 38. With this arrangement, activation of the reduce lookahead signal enables OR-Gate 39 and partially enables AND-gate 38. The effect of applying the reduce lookahead signal is to compare only the outputs of the subtraction circuits 45, 46 in the comparator circuit 49 such that a compare fully enables the AND-gate 38 to issue the prefetch enable signal. This mode of operation may be useful, for example, when the patterns seem to be changing every few cache misses, and it favors the most recent examples.</p><p>With the arrangement of FIG. 4, it is advantageous to try all the patterns within pattern groups (as represented by the \"YES\" response to the \"&gt;1 PATTERN GROUP?\" query in the flow diagram of FIG. 2) even if there is a pattern match detected intermediate the process. This follows from the fact that more than one of the future entries WXY to the miss stack may be developed during a single pass through the pattern repertoire or even a subset of the pattern repertoire. With the specific implementation of FIG. 4 (which is only exemplary of many possible useful configurations), the following results are obtainable:</p><p></p><pre listing-type=\"tabular\" xml:space=\"preserve\"><!--Greenbook tabular data-->______________________________________                                    \nSWITCH STATE     PATTERN   GOAL                                           \n______________________________________                                    \n0                ABCD      W                                              \n1                ACEG      X                                              \n2                ADGJ      Y                                              \n3                BDFH      W                                              \n4                BEHK      X                                              \n5                CFIL      W                                              \n6                CGKO      X                                              \n7                DHLP      W                                              \n______________________________________                                    \n</pre><p>The goal states are searched in groups by switch state; i.e.: Group 1 includes switch states 0, 1, 2 and could result in filling future entries WXY; Group 2 includes states 3, 4 and could result in filling entries WX; Group 3 includes states 5, 6 and could also result in filling entries WX; and Group 4 includes state 7 and could result in filling entry W. When a goal state is reached that has been predicted, the search is halted for the current cache miss; i.e., it would not be desirable to replace an already developed predictive address W with a different predictive address W.</p><p>Those skilled in the art will understand that the logic circuitry of FIGS. 3 and 4 is somewhat simplified since multiple binary digit information is presented as if it were single binary digit information. Thus, in practice, arrays of electronic switches, gates, etc. will actually be employed to handle the added dimension as may be necessary and entirely conventionally. Further, timing signals and logic for incorporating the inventive structure into a given data processing system environment will be those appropriate for that environment and will be the subject of straightforward logic design.</p><p>Attention is now directed to FIG. 5 which is a time versus hit ratio (also called \"hit rate\" herein) diagram illustrating the recovery characteristics of a cache memory following a process change. Since most or all the data stored in the cache will typically not be of interest to the new process, a precipitous drop in the cache hit ratio is observed at T1, the instant the new process is started. Assuming first that the cache miss prediction mechanism is not enabled, the recovery follows the representative curve 40 and ultimately stabilizes at a hit ratio represented by the line 41 with which the curve 40 blends at about time T2. (These curves, of course, are highly generalized and idealized. For example, those skilled in the art will understand that the hit ratio represented by the line 41 would not be perfectly straight in practice but rather would transiently vary plus and minus about the line 41.)</p><p>Consider now the recovery characteristics of the hit ratio when the cache miss prediction mechanism is enabled. After the precipitous drop in the hit rate observed at T1, recovery takes place along the representative curve 42 which eventually merges with the line 43. Two important aspects of this recovery characteristic will be seen. First, the immediate hit rate recovery is very much faster; i.e., the curve 42 is much steeper (greater rate of increase of hit rate) than the curve 40. Second, the long term stabilized hit ratio represented by the line 43 is somewhat lower than the long term stabilized hit ratio represented by the line 41. For this reason, as discussed above, the cache miss prediction mechanism is very effective shortly after a process change, but its application can be detrimental to the long term hit ratio.</p><p>By the use of the present invention, the accelerated recovery following a process change obtained by the use of the cache miss prediction mechanism and represented by the curve 42 may be enjoyed for long term processes while also enjoying the higher long term hit ratio represented by the line 41. Fundamentally, this result is achieved by enabling the cache miss prediction mechanism immediately following a process change and disabling it at some time when the cache has recovered to a hit ratio near that of stabilization along the line 43. This procedure is represented by the curve 44 which couples the point 45 (at which the cache miss prediction mechanism is disabled) along the line 42 to the line 41. The trigger mechanism for selectively enabling the cache miss prediction mechanism may be either a predetermined time period extending in the example from T1 to T4 or the time between T1 and the time at which a predetermined hit ratio, represented by the line HRT (hit ratio threshold), is reached. In FIG. 5, the crossover points are the same merely for purposes of illustration.</p><p>Referring now to FIG. 6, exemplary apparatus for establishing the period T1-T4 during which the cache miss prediction mechanism is enabled is shown. When the processor 14 calls for a new process, it alerts a timer 51 which includes a presettable counter 52 and also enables the cache miss prediction logic 50 (e.g., the logic of FIG. 3 or FIG. 4). While enabled, the prediction logic 50 functions as previously described in concert with the processor 14, cache 12 and main memory 13.</p><p>In its most elementary form, the counter 52 in the timer 51 is simply preset to a first fixed predetermined number when the \"process change\" signal is received from the processor 14 and then clocks to a second fixed number (typically zero or -1) whereupon a \"disable\" signal is issued to the prediction logic 50 to permit the cache to ascend to its best hit ratio after the cache inrush has been handled by the prediction logic. Alternatively, and preferably, the \"process change\" signal includes count information predetermined for the new process which sets the counter 52 to an initial count which optimizes the time period during which the prediction logic 50 is enabled for that specific process. Thus, the new process itself specifies the time period during which the cache miss prediction mechanism is enabled. This initial count may be predetermined simply from experience with a given process or family of processes. Thus, the new process itself specifies the time period during which the cache miss prediction mechanism is enabled.</p><p>FIG. 7 shows the similar structure by which the determination of the shift from curve 42 to curve 44 at exemplary point 45 may be made in accordance with the attainment of a predetermined HRT along the curve 42. The logic block 55 includes a division circuit 57 which receives from the cache 12 a series of \"snapshots\" along the curve 42 (FIG. 5) of the tries and hits, each taken during a brief period. For example, the period between point \"A\" and point \"B\" may be one such period; the period between point \"B\" and point \"C\", the next, and so on. Each hit ratio calculated by the divider 57 is compared to a hit ratio threshold stored in sub-block 56 by comparator 58. When the calculated instantaneous hit ratio reaches the hit ratio threshold (e.g. during the period between point \"Y\" and point \"Z\" along the curve 42), the comparator 58 issues the \"disable\" signal to the prediction logic 50 such that the hit ratio will ascend along the curve 44.</p><p>The hit ratio threshold stored in the sub-block 56 may be a fixed predetermined number or it may be a predetermined number received from the processor 14 in conjunction with the \"process change\" signal which reflects a hit ratio switchover point optimized for that specific process. Thus, the new process itself specifies the hit ratio threshold at which the cache miss prediction mechanism will be disabled. In some caches, the instantaneous hit ratio is routinely calculated such that the sub-block 57 need only receive the information for comparison with the hit ratio threshold rather than actually calculating it; in some other systems, the processor tracks the instantaneous hit ratio. It will therefore be understood that this calculation can be carried out by any convenient component in a given system and that the block 55 is only an exemplary embodiment of apparatus for performing this task.</p><p>Thus, while the principles of the invention have now been made clear in an illustrative embodiment, there will be immediately obvious to those skilled in the art many modifications of structure, arrangements, proportions, the elements, materials, and components, used in the practice of the invention which are particularly adapted for specific environments and operating requirements without departing from those principles.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Charles P.", "last_name": "Ryan", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "BULL HN INFORMATION SYSTEMS INC."}, {"first_name": "", "last_name": "BULL HN INFORMATION SYSTEMS, INC.                           A CORP. OF DELAWARE", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  13/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  12/08        20060101A I20051008RMAU"}, {"label": "G06F  12/10        20060101AFI20051220RMJP"}, {"label": "G06F   9/38        20060101A I20051008RMEP"}, {"label": "G06F  12/12        20060101ALI20051220RMJP"}], "national_classes": [{"primary": true, "label": "711118"}, {"primary": false, "label": "711E12057"}, {"primary": false, "label": "712225"}, {"primary": false, "label": "712E09047"}, {"primary": false, "label": "711003"}], "ecla_classes": [{"label": "S06F212:6026"}, {"label": "G06F   9/38D2"}, {"label": "G06F  12/08B8"}], "cpc_classes": [{"label": "G06F  12/0862"}, {"label": "G06F   9/383"}, {"label": "G06F   9/3832"}, {"label": "G06F2212/6026"}, {"label": "G06F  12/08"}, {"label": "G06F   9/383"}, {"label": "G06F2212/6026"}, {"label": "G06F  12/0862"}, {"label": "G06F   9/3832"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1989-06-12", "application_date": "1992-02-26", "family_members": [{"ucid": "JP-H0363852-A", "titles": [{"lang": "EN", "text": "METHOD FOR PREDICTING CACHE MISS AND DEVICE THEREFOR"}]}, {"ucid": "US-5093777-A", "titles": [{"lang": "EN", "text": "METHOD AND APPARATUS FOR PREDICTING ADDRESS OF A SUBSEQUENT CACHE REQUEST UPON ANALYZING ADDRESS PATTERNS STORED IN SEPARATE MISS STACK"}]}, {"ucid": "US-5694572-A", "titles": [{"lang": "EN", "text": "Controllably operable method and apparatus for predicting addresses of future operand requests by examination of addresses of prior cache misses"}, {"lang": "EN", "text": "IN A DATA PROCESSING SYSTEM"}]}, {"ucid": "DE-69028153-T2", "titles": [{"lang": "EN", "text": "Cache miss prediction method and apparatus"}, {"lang": "DE", "text": "Cache-Speicherfehlgriffsvorhersageverfahren und -vorrichtung"}]}, {"ucid": "SG-49211-A1", "titles": [{"lang": "EN", "text": "Cache miss prediction method and apparatus"}]}, {"ucid": "AU-638716-B2", "titles": [{"lang": "EN", "text": "CACHE MISS PREDICTION METHOD AND APPARATUS"}]}, {"ucid": "JP-1822864-C", "titles": []}, {"ucid": "DE-69028153-D1", "titles": [{"lang": "EN", "text": "Cache miss prediction method and apparatus"}, {"lang": "DE", "text": "Cache-Speicherfehlgriffsvorhersageverfahren und -vorrichtung"}]}, {"ucid": "JP-H0529939-B2", "titles": []}, {"ucid": "KR-910001547-A", "titles": [{"lang": "EN", "text": "Cache miss prediction method and device"}, {"lang": "KO", "text": "캐시 미스 예상방법 및 장치"}]}, {"ucid": "AU-5681990-A", "titles": [{"lang": "EN", "text": "CACHE MISS PREDICTION METHOD AND APPARATUS"}]}, {"ucid": "EP-0402787-A3", "titles": [{"lang": "FR", "text": "Procédé et appareil de prédiction de ratage d'antémémoire"}, {"lang": "DE", "text": "Cache-Speicherfehlgriffsvorhersageverfahren und -vorrichtung"}, {"lang": "EN", "text": "CACHE MISS PREDICTION METHOD AND APPARATUS"}]}, {"ucid": "EP-0402787-B1", "titles": [{"lang": "FR", "text": "Procédé et appareil de prédiction de ratage d'antémémoire"}, {"lang": "EN", "text": "Cache miss prediction method and apparatus"}, {"lang": "DE", "text": "Cache-Speicherfehlgriffsvorhersageverfahren und -vorrichtung"}]}, {"ucid": "KR-950011291-B1", "titles": [{"lang": "KO", "text": "캐시미스 예상방법 및 장치"}, {"lang": "EN", "text": "CUCHE MISS PREDICTION METHOD AND APPARATUS"}]}, {"ucid": "EP-0402787-A2", "titles": [{"lang": "FR", "text": "Procédé et appareil de prédiction de ratage d'antémémoire"}, {"lang": "EN", "text": "Cache miss prediction method and apparatus"}, {"lang": "DE", "text": "Cache-Speicherfehlgriffsvorhersageverfahren und -vorrichtung"}]}]}