{"patent_number": "US-5951655-A", "publication_id": 72079457, "family_id": 18149628, "publication_date": "1999-09-14", "titles": [{"lang": "EN", "text": "External storage subsystem having independent access paths for permitting independent access from a host and a storage device to respective cache memories"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA37959330\"><p>A plurality of independent cache units and nonvolatile memory units are provided in a disk controller located between a host (central processing unit) and a magnetic disk drive. A plurality of channel units for controlling the data transfer to and from the central processing unit and a plurality of control units for controlling the data transfer to and from the magnetic disk drive are independently connected to the cache units and the nonvolatile memory units through data buses and access lines.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"1\"><claim-text>1. A storage subsystem comprising:<claim-text>a rotating storage device storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of cache memories for storing the data transferred between the host and the rotating storage device,</claim-text><claim-text>a plurality of channel units for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units for controlling data transfer to and from the rotating storage device, and</claim-text><claim-text>a plurality of access paths for permitting independent access to the cache memories from the host and independent access to the cache memories from the rotating storage device, the plurality of access paths including a plurality of data buses;</claim-text></claim-text><claim-text>wherein each of said plurality of channel units having a plurality of access lines, each access line connected to each of said plurality of cache memories,</claim-text><claim-text>wherein each of said plurality of control units having a plurality of access lines, each access line connected to each of said plurality of cache memories.</claim-text></claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"2\"><claim-text>2. The storage subsystem of claim 1:<claim-text>wherein the plurality of cache memories includes at least two non-volatile semiconductor memories and two volatile semiconductor memories for temporarily storing the data transferred between the host and the rotating storage device.</claim-text></claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim num=\"3\"><claim-text>3. The storage subsystem of claim 2, further comprising:<claim-text>a plurality of first control processors each associated with one of said plurality of channel units, and a plurality of second control processors each associated with one of said plurality of control units,</claim-text><claim-text>wherein access to said cache memories by said channel units and said control units is under the control of said first control processors and said second control processors respectively.</claim-text></claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"4\"><claim-text>4. The storage subsystem of claim 1, further comprising:<claim-text>a plurality of first control processors each associated with one of said plurality of channel units, and</claim-text><claim-text>a plurality of second control processors each associated with one of said plurality of control units,</claim-text><claim-text>wherein access to said cache memories by said channel units and said control units is under the control of said first control processors and said second control processors respectively.</claim-text></claim-text></claim>"}, {"num": 5, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"5\"><claim-text>5. A storage subsystem comprising:<claim-text>a rotating storage device for storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including;<claim-text>a plurality of groups of cache memories including at least two semiconductor memories for storing the data transferred between the host and the rotating storage device,</claim-text><claim-text>a plurality of channel units for controlling data transfer to and from the host, a plurality of control units for controlling data transfer to and from the rotating storage device, and</claim-text><claim-text>a plurality of access paths for permitting independent access to the cache memories from the host and independent access to the cache memories form the rotating storage device, the plurality of access paths including a plurality of data buses,</claim-text></claim-text><claim-text>wherein each of said plurality of channel units having a plurality of access lines, each access line connected to each of said plurality of groups of cache memories,</claim-text><claim-text>wherein each of said plurality of control units having a plurality of access lines, each access line connected to each of said plurality of groups of cache memories.</claim-text></claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim num=\"6\"><claim-text>6. The storage subsystem of claim 5,<claim-text>wherein the plurality of groups of cache memories includes at least two non-volatile semiconductor memories and two volatile semiconductor memories for temporarily storing the data transferred between the host and the rotating storage device.</claim-text></claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim num=\"7\"><claim-text>7. The storage subsystem of claim 6, further comprising:<claim-text>a plurality of first control processors, each associated with one of said plurality of channel units, and a plurality of second control processors each associated with one of said plurality of control units,</claim-text><claim-text>wherein access to said groups of cache memories by said channel units and said control units is under the control of said first control processors and said second control processors respectively.</claim-text></claim-text></claim>"}, {"num": 8, "parent": 5, "type": "dependent", "paragraph_markup": "<claim num=\"8\"><claim-text>8. The storage subsystem of claim 5, further comprising:<claim-text>a plurality of first control processors each associated with one of said plurality of channel units, and a plurality of second control processors each associated with one of said plurality of control units,</claim-text><claim-text>wherein access to said groups of cache memories by said channel units and said control units is under the control of said first control processors and said second control processors respectively.</claim-text></claim-text></claim>"}, {"num": 9, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"9\"><claim-text>9. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage,</claim-text><claim-text>a plurality of data buses; and</claim-text><claim-text>a cache memory for storing the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of channel units having a plurality of access lines, each access line connected to each of said plurality of data buses,</claim-text><claim-text>each of said plurality of control units having a plurality of access lines, each access line connected to each of said plurality of data buses, and</claim-text><claim-text>said cache memory having a plurality of access lines, each access line connected to each of said plurality of data buses.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 10, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"10\"><claim-text>10. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage, and</claim-text><claim-text>a plurality of cache memories for storing the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of channel units and control units having a plurality of access lines, each access line coupled to each of said plurality of cache memories.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 11, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"11\"><claim-text>11. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage, and</claim-text><claim-text>a plurality of cache memories for storing the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of channel units and control units having two access lines,</claim-text><claim-text>each of one half of said plurality of cache memories having a plurality of access lines,</claim-text><claim-text>each access line connected to each of one of said two access lines,</claim-text><claim-text>each of the other half of said plurality of cache memories having a plurality of access lines, each access line connected to each of the other of said two access lines.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 12, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"12\"><claim-text>12. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage, and</claim-text><claim-text>a plurality of cache memories for storing the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of cache memories having two access lines,</claim-text><claim-text>each of said plurality of channel units having a plurality of access lines, each access line connected to each of one of said two access lines of said cache memories,</claim-text><claim-text>each of said plurality of control units having a plurality of access lines, each access line connected to each of the other of said two access lines of said cache memories.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 13, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"13\"><claim-text>13. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage,</claim-text><claim-text>a plurality of data buses; and</claim-text><claim-text>a plurality of cache memories for storing the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of channel units having a plurality of access lines, each access line connected to each of said plurality of data buses,</claim-text><claim-text>each of said plurality of control units having a plurality of access lines, each access line connected to each of said plurality of data buses, and</claim-text><claim-text>each of said plurality of cache memories having a plurality of access lines, each access line connected to each of said plurality of data buses.</claim-text></claim-text></claim-text></claim-text></claim>"}, {"num": 14, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"14\"><claim-text>14. A storage subsystem comprising:<claim-text>rotating storage storing data from a host and sending data to the host in response to a request from the host; and</claim-text><claim-text>a memory controller including:<claim-text>a plurality of channel units coupled to the host, for controlling data transfer to and from the host,</claim-text><claim-text>a plurality of control units coupled to the rotating storage, for controlling data transfer to and from the rotating storage,</claim-text><claim-text>a plurality of data buses; and</claim-text><claim-text>a plurality of cache memories for permitting independent access to the data transferred between the host and the rotating storage, wherein<claim-text>each of said plurality of cache memories having a plurality of independent access lines, which permit for each access line independently access to said plurality of channel units and said plurality of control units.</claim-text></claim-text></claim-text></claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES67334914\"><?RELAPP description=\"Other Patent Relations\" end=\"lead\"?><p>This is a continuation of application Ser. No. 08/502,045 filed Jul. 13, 1995, U.S. Pat. No. 5,689,729 which is a continuation of application Ser. No. 07/984,763 filed Dec. 3, 1992, now U.S. Pat. No. 5,459,856.</p><?RELAPP description=\"Other Patent Relations\" end=\"tail\"?><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>The present invention relates to an external storage subsystem, and more particularly to a technology effective for an improvement of reliability of an external storage subsystem having a cache function.</p><p>For example, in a magnetic disk subsystem used as an external storage in a general purpose computer system, a well-known cache memory comprising a semi-conductor memory is interleaved at a portion of a disk controller to avoid as much as possible the reduction of a data transfer rate due to a mechanical factor such as a rotational delay time or a latency time in a magnetic disk drive.</p><p>A cache structure in such a disk controller is discussed in \"A Multiport Page-Memory Architecture and A Multiport Disk-Cache System\" New Generation Computing 2 (1984) 241-260 OHMSHA, LTD. and Springer-Verlag, in which it is proposed to improve an access performance to the cache by dividing into a plurality of memory banks. Further, a switching network called an interconnection network is proposed as a system for coupling the memory banks and a channel or a disk controller.</p><p>The conventional technology above intends to improve the cache performance by providing a plurality of memory banks and the switching network. As to a data bus structure in the disk controller, the switching network system called the interconnection network is proposed. However, the switching network system is imparted with a hardware restriction when a data bus configuration for exchanging data is to be constructed by connecting a plurality of memory banks and a plurality of channel units or a plurality of control units.</p><p>It does not refer to the multiplexity of the cache unit comprising the memory banks.</p><h4>SUMMARY OF THE INVENTION</h4><p>It is an object of the present invention to provide a data bus structure for connecting a plurality of cache units of a host and a plurality of channel units or a plurality of control units of a rotating storage, by taking restrictive conditions of a data transfer rate and a data bus width on hardware into consideration.</p><p>It is another object of the present invention to provide an external memory subsystem which has a high tolerance to failures and has a highly reliable cache function.</p><p>The above and other objects and features of the present invention will be apparent from the following description of the present invention when taken in conjunction with the attached drawings.</p><p>Representative features of the present invention are briefly explained below.</p><p>The external storage subsystem of the present invention comprises a rotating storage for storing data to be accessed from a host and an external memory control unit having a cache mechanism for responding to an access request from the host to the rotating storage by temporarily holding data exchanged between the rotating storage and the host and having at least one of a non-volatile (persistent) semiconductor memory and a volatile (non-persistent) semiconductor memory as a storage medium. It further comprises a plurality of independent cache mechanisms and a plurality of independent access paths for permitting independent accesses from the host and the rotating storage to the respective cache mechanisms.</p><p>In the external storage subsystem of the present invention, the external memory control unit comprises a plurality of channel units for controlling the transfer of data to and from the host and a plurality of control units for controlling the transfer of data to and from the rotating storage, and each of the channel units and the control units has a plurality of the first access paths to which a plurality of cache mechanisms are to be independently connected.</p><p>In the external storage subsystem of the present invention, the external memory control unit comprises a plurality of channel units for controlling the transfer of data to and from the host and a plurality of control units for controlling the transfer of data to and from the rotating storage, and each of the cache mechanisms has a plurality of the second access paths to which the channel units and the control units are to be connected.</p><p>In the external storage subsystem of the present invention, the external memory control unit comprises a plurality of channel units for controlling the transfer of data to and from the host, a plurality of control units for controlling the transfer of data to and from the rotating storage, and a plurality of independent access paths to the channel units, the control units and the cache mechanisms. The respective channel units, control units and cache mechanisms are connected to the third access paths.</p><p>In the external storage subsystem of the present invention, the external memory control unit comprises a plurality of channel units for controlling the transfer of data to and from the host, a plurality of control units for controlling the transfer of data to and from the rotating storage, and the fourth access paths for directly and independently connecting the respective channel units and control units with the respective cache mechanisms.</p><p>In the external storage subsystem of the present invention, since the cache units are multiplexed and the access paths to the respective cache units by the host and the rotating storage are of independent configuration, the data transfer rate or the data bus width can be optimized by combining a plurality of cache units and a plurality of channel units or a plurality of control units.</p><p>Further, since the cache units and the access paths to the cache units are multiplexed, a probability of maintaining the cache function in case a trouble occurs is enhanced and the reliability of the external storage subsystem and the tolerance to the failures are certainly improved.</p><p>The effects of the representative features of the present invention are as follows.</p><p>In the external storage subsystem of the present invention, the cache units in the external storage subsystem including the rotating storage can be coupled, in a simple construction, to the channel units of the host and the control units of the rotating storage. Accordingly, the cache function and performance in the disk control unit are improved.</p><p>Further, in the external storage subsystem of the present invention, since both the cache units and the access paths to the cache units are multiplexed, the tolerance to the failures is high and the highly reliable cache function is attained.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 shows a block diagram of one embodiment of an external storage subsystem of the present invention,</p><p>FIG. 2 shows a signal configuration of a data bus connecting a channel unit or control unit in a disk controller and a plurality of cache units or nonvolatile memory units,</p><p>FIG. 3 shows a conceptual view of data bus protocol when read data, write data and command status are exchanged between the channel unit or the control unit and the cache units or the nonvolatile memory units,</p><p>FIG. 4 illustrates a data bus mode for specifying a status of a data bus,</p><p>FIG. 5 shows a block diagram of a configuration of another embodiment of the external storage subsystem of the present invention,</p><p>FIG. 6 shows a block diagram of other embodiment of the external storage subsystem of the present invention, and</p><p>FIG. 7 shows a block diagram of a further embodiment of the external storage subsystem of the present invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><p> Embodiment 1!</p><p>One embodiment of the external memory subsystem of the present invention is explained with reference to the drawings here.</p><p>As shown in FIG. 1, a computer system of the present embodiment comprises a central processing unit (CPU) 1 and a disk subsystem which includes a disk controller 2 and a magnetic disk drive 3.</p><p>The CPU 1 and the disk controller 2 are connected through a plurality of channel interfaces 4, and the disk controller 2 and the magnetic disk drive 3 are connected through a plurality of control interfaces 5.</p><p>The CPU 1 issues an access command to the disk controller 2 through the channel interface 4 to control the read and write of data by the magnetic disk drive 3 by the disk controller 2 through the control interface 5 in accordance with the command from the CPU 1. In other expression, the CPU 1 controls the read and write of data by controlling the magnetic disk drive 3 by the disk controller 2,through the control interface 5 in accordance with the access command issued to the disk controller 2 through the channel interface 4 from the CPU 1.</p><p>In the disk controller 2, a plurality of channel units 60 and channel units 61 which operate under a channel control processor 110 and a channel control processor 111 are provided on the side of the channel interface 4, and control units 70 and control units 71 which operate under a control unit control processor 120 and a control unit control processor 121 are provided on the side of the control interface 5.</p><p>A command issued from the CPU 1 to the disk controller 2 is accepted by the channel units 60 and 61, decoded by the channel control processors 110 and 111 and delivered to the control unit processors 120 and 121 necessary for controlling the magnetic disk drive 3. The control unit processors 120 and 121 control the magnetic disk drive 3 through the control units 70 and 71.</p><p>The disk controller 2 includes two independent cache units 80 and 81 for temporarily storing data in a semiconductor memory as a storage medium, which is not described in figure however, and two independent nonvolatile memory units 90 and 91. The nonvolatile memory units 90 and 91 are rewritable memories and have a capability of holding data for a certain time period without regard to the presence or absence of external power supply.</p><p>Each capacity of the cache units 80 and 81, for example, is determined to permit a sufficient individual cache operation compatible to a memory capacity of the magnetic disk drive 3. Similarly, a capacity of each of the nonvolatile memory units 90 and 91, for example, is determined to permit a sufficient individual cache operation compatible to the memory capacity of the magnetic disk drive 3.</p><p>The channel unit 60 is provided with a plurality of independent data buses 60A and 60B. The cache unit 80 and the nonvolatile memory unit 91 are independently connected to the data bus 60A through the respective access lines 80a and 91a. The cache unit 81 and the nonvolatile memory unit 90 are connected to the data bus 60B through the respective access lines 81a and 90a.</p><p>Similarly, the channel unit 61 is provided with a plurality of independent data buses 61A and 61B. The cache unit 80 is connected to the data bus 61A through an access line 80c, and the nonvolatile memory unit 91 is connected through an access line 91c. The cache unit 81 is connected to the data bus 61B through an access line 81c and the nonvolatile memory unit 90 is connected through an access line 90c.</p><p>The control unit 70 is provided with a plurality of independent data buses 70A and 70B. The cache unit 80 is connected to the data bus 70A through an access line 80p, and the nonvolatile memory unit 91 is connected through an access line 91b. The cache unit 81 is connected through an access line 81b and the nonvolatile memory unit 90 is connected through an access line 90b.</p><p>Similarly, the control unit 71 is provided with a plurality of independent data buses 71A and 71B. The cache unit 80 is connected to the data bus 71A through an access line 80d and the nonvolatile memory unit 91 is connected through an access line 91d. The cache unit 81 is connected to the data bus 71B through an access line 81d and the nonvolatile memory unit 90 is connected through an access line 90d.</p><p>In the configuration of the present embodiment, each of the channel units 60 and 61 and the control units 70 and 71 can access to the cache units 80 and 81 and the nonvolatile memory units 90 and 91 through independent paths.</p><p>An operation of the external memory subsystem of the present embodiment is explained below.</p><p>Write data sent from the CPU 1 to the disk controller 2 is temporarily stored in one of the cache unit 80 and 81 and the nonvolatile memory unit 90 and 91 through the channel unit 60 or 61 and the one of the data buses 60A, 60B, 61A and 61B, in accordance with the command from the channel control processor 110 or 111. Then, the data is read from one of the cache units 80 and 81 or one of the nonvolatile memory units 90 and 91 by the command from the control unit control processor 120 or 121 and the write data is stored in the magnetic disk drive 3 through the data bus between 70A and 71B (70A to 71B) and the control unit 70 or 71.</p><p>On the other hand, when the channel control processor 110 or 111 receives a data read request from the CPU 1 through the channel unit 60 or 61, it searches the contents of the cache unit 80 or 81 and the nonvolatile memory unit 90 or 91, and if there is data requested by the CPU 1, it sends the read data from the cache unit 80 or 81 or the nonvolatile memory unit 90 or 91 through one of the data bus between 60A and 61B (60A to 61B) and the channel unit 60 or 61.</p><p>If the data requested by the CPU 1 is not present in any of the cache units 80 and 81 and the nonvolatile memory units 90 and 91, the channel control processor 110 or 111 conveys the data read from the magnetic disk drive 3 to the control unit control processor 120 or 121. When the control unit control processor 120 or 121 receives the data read request from the channel control processor 110 or 111, it stores the requested data read from the magnetic disk drive 3 into one of the cache unit 80 or 81 through the control unit 70 or 71 and the data bus between 70A and 71B (70A to 71B).</p><p>When the channel control processor 110 or 111 receives a report of completion of read data store into the cache unit 80 or 81 from the control unit control processor 120 or 121, it reports the completion of data to the CPU 1 and sends the read data from the cache unit 80 or 81 to the CPU 1 through the data bus between 60A and 61B (60A to 61B) and the channel unit 60 or 61 in response to the command from the CPU 1.</p><p>FIG. 2 shows an example of signal configuration of the data buses from 60A through 71B connecting the channel units 60 and 61 or the control units 70 and 71 and the cache units 80 and 81 or the nonvolatile memory units 90 and 91 in the disk controller 2. In the present embodiment, the channel units 60 and 61 or the control units 70 and 71 perform a master operation to the cache units 80 and 81 and the nonvolatile memory units 90 and 91. The cache units 80 and 81 or the nonvolatile memory units 90 and 91 perform a slave operation to the channel units 60 and 61 or the control units 70 and 71.</p><p>The channel units 60 and 61 or the control units 70 and 71 select the cache unit 80 or 81 or the nonvolatile memory unit 90 or 91 by driving a SEL (0-1) signal line. The channel unit 60 or 61 or the control unit 70 or 71 specifies a status of the data buses from 60A through 71B, by a combination of the signals shown in FIG. 4, of a DTOUT/*DTIN signal line and a CMD/*DTIN signal line in the selected condition of the cache units 80 and 81 or the nonvolatile memory units 90 and 91. The read data, write data, command and status are exchanged between the channel units 60 and 61 or the control units 70 and 71 and the cache units 80 and 81 or the nonvolatile memory units 90 or 91, in accordance with the data bus protocol shown in FIG. 3.</p><p>In the external storage subsystem of the present embodiment, the cache units 80 and 81 and the nonvolatile memory units 90 and 91 are independently provided, and the accesses to the cache units 80 and 81 and the nonvolatile memory units 90 and 91 from the channel units 60 and 61 on the side of the CPU 1 and the control units 70 and 71 of the magnetic disk device 3 are permitted independently through the data buses 60A-71B, the access lines 80a to 80d, 81a to 81d, 90a to 90d and 91a-91d. Accordingly, the data transfer rate and the data bus width in the data bus or the access line can be optimally set.</p><p>Further, even if a failure occurs in any of the cache units 80 and 81 and the nonvolatile memory units 90 and 91 or the data buses 60A-71B or further the access lines 80a-80d, 81a-81d, 90a-90d and 91a-91d, the cache function can be maintained and the tolerance to the failures and the reliability of the operation are improved.</p><p> Embodiment 2!</p><p>FIG. 5 shows a block diagram of another embodiment of the external storage subsystem of the present invention.</p><p>In the embodiment 2, each of the cache units 80 and 81 and the nonvolatile memory units 90 and 91 has a plurality of data buses 80A, 80B, 81A, 81B, 90A, 90B, 91A and 91B to each of which the channel units 60 and 61 and the control units 70 and 71 are independently connected through the access lines 60a to 60d, 61a to 61d, 70a to 70d and 71a to 71d.</p><p>The similar effects to those of the embodiment 1 are attained in the present embodiment.</p><p> Embodiment 3!</p><p>FIG. 6 shows a block diagram of a configuration of other embodiment of the external memory subsystem of the present invention.</p><p>In the embodiment 3, two common data buses 200A and 200B are provided. To each of them, the channel unit 60 is connected through access lines 60e and 60f, the channel unit 61 is connected through access lines 61e and 61f, the control unit 70 is connected through access lines 70e and 70f, the control unit 71 is connected through access lines 77e and 71f, the cache unit 80 is connected through access lines 80e and 80f, the cache unit 81 is connected through access lines 80e and 81f, the nonvolatile memory unit 90 is connected through access lines 90e and 90f, and the nonvolatile memory unit 91 is connected through access lines 91e and 91f, independently respectively.</p><p>The similar effects to those of the previous embodiments are attained in the present embodiment.</p><p> Embodiment 4!</p><p>FIG. 7 shows a block diagram of a configuration of a further embodiment of the external storage subsystem of the present invention.</p><p>In the embodiment 4, cache unit groups 800 and 801 each comprising a plurality of cache units and nonvolatile memory unit groups 900 and 901 each comprising a plurality of nonvolatile memory units are provided. The cache unit groups 800 and 801 and the nonvolatile memory unit groups 900 and 901 are connected to the channel units 60 and 61 and the control units 70 and 71 through data buses 60g to 60j, 61g to 61j, 70g to 70j and 71g to 71j.</p><p>The similar effects to those of the previous embodiments are attained in the present embodiment.</p><p>While the present invention has been described with reference to the embodiments of the present invention, those embodiments are examples of the present invention and they may be modified in various ways without departing from the gist of the invention.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Yasuo", "last_name": "Inoue", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "HITACHI, LTD."}], "ipc_classes": [{"primary": true, "label": "G06F  13/40"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  12/08        20060101A I20051008RMJP"}, {"label": "G06F   3/00        20060101A I20051110RMEP"}, {"label": "G06F  13/12        20060101ALI20051220RMJP"}, {"label": "G06F   3/06        20060101AFI20051220RMJP"}, {"label": "G06F  13/38        20060101ALI20051220RMJP"}, {"label": "G06F  13/14        20060101A I20051110RMEP"}, {"label": "G11C  29/00        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "710037"}, {"primary": false, "label": "710021"}, {"primary": false, "label": "711113"}, {"primary": false, "label": "710052"}, {"primary": false, "label": "711E12019"}], "ecla_classes": [{"label": "H04L  29/08N9S"}, {"label": "S06F3:06D"}, {"label": "G06F   3/06A4T4"}, {"label": "G06F   3/06A6L4R"}, {"label": "G06F   3/06A2P"}, {"label": "T05K999:99"}, {"label": "G06F   3/06A4T2"}, {"label": "G06F   3/06A"}, {"label": "G06F  12/08B12"}, {"label": "G11C  29/00W"}], "cpc_classes": [{"label": "H04L  67/1097"}, {"label": "G06F   3/0689"}, {"label": "H04L  67/1097"}, {"label": "G06F  12/0866"}, {"label": "G06F   3/0601"}, {"label": "G06F   3/0673"}, {"label": "G06F   3/0658"}, {"label": "G06F   3/061"}, {"label": "G06F   3/0689"}, {"label": "G06F  12/0866"}, {"label": "G06F   3/0673"}, {"label": "G06F   3/0656"}, {"label": "G06F   3/0658"}, {"label": "G06F   3/0656"}, {"label": "G11C  29/006"}, {"label": "G06F   3/0601"}, {"label": "G06F   3/061"}, {"label": "G11C  29/006"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1991-12-06", "application_date": "1997-07-29", "family_members": [{"ucid": "US-7099960-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-7330909-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-5951655-A", "titles": [{"lang": "EN", "text": "External storage subsystem having independent access paths for permitting independent access from a host and a storage device to respective cache memories"}]}, {"ucid": "US-6981066-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "JP-H05158797-A", "titles": [{"lang": "EN", "text": "EXTERNAL STORAGE SUBSYSTEM"}, {"lang": "JA", "text": "外部記憶サブシステム"}]}, {"ucid": "US-7702819-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-7010623-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20010014923-A1", "titles": [{"lang": "EN", "text": "Method for connecting caches in external storage subsystem"}]}, {"ucid": "US-20040010640-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-6981067-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-7243166-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20070011400-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20080133788-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20040010658-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-5689729-A", "titles": [{"lang": "EN", "text": "Storage subsystem having plurality of access paths permitting independent access to cache memory from host and independent access to the cache from rotating storage device"}]}, {"ucid": "US-7219166-B2", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "JP-3451099-B2", "titles": [{"lang": "JA", "text": "外部記憶サブシステム"}, {"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-5459856-A", "titles": [{"lang": "EN", "text": "System having independent access paths for permitting independent access from the host and storage device to respective cache memories"}]}, {"ucid": "US-6745261-B2", "titles": [{"lang": "EN", "text": "Method for connecting caches in external storage subsystem"}]}, {"ucid": "US-20040010639-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20040010641-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20040010642-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}, {"ucid": "US-20040010659-A1", "titles": [{"lang": "EN", "text": "External storage subsystem"}]}]}