{"patent_number": "US-5640573-A", "publication_id": 71477927, "family_id": 22700691, "publication_date": "1997-06-17", "titles": [{"lang": "EN", "text": "Power management message bus for integrated processor"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"docdb\" mxw-id=\"PA10584560\" source=\"national office\"><p>An integrated processor is provided that includes a CPU core coupled to a variety of on-chip peripheral devices such as a DMA controller, an interrupt controller, and a timer. The integrated processor further includes a power management message unit coupled to the DMA controller, interrupt controller, and timer for monitoring the internal interrupt and bus request signals of the integrated processor. The power management message unit may also monitor other selected activities of the integrated processor depending upon the system requirements. Based on the detected activities, if any, the power management message unit encodes a message on a power management message bus to thereby provide information regarding the internal events of the integrated processor to an outside power management unit. The power management message bus is channeled from the integrated processor at a set of package pins that are isolated from the standard external peripheral bus of the integrated processor. By providing encoded information regarding the internal events of the integrated processor, monitoring of such events by an external power management unit is possible while the number of external pins on the integrated processor are minimized.</p></abstract>"}, {"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA37648992\"><p>An integrated processor is provided that includes a CPU core coupled to a variety of on-chip peripheral devices such as a DMA controller, an interrupt controller, and a timer. The integrated processor further includes a power management message unit coupled to the DMA controller, interrupt controller, and timer for monitoring the internal interrupt and bus request signals of the integrated processor. The power management message unit may also monitor other selected activities of the integrated processor depending upon the system requirements. Based on the detected activities, if any, the power management message unit encodes a message on a power management message bus to thereby provide information regarding the internal events of the integrated processor to an outside power management unit. The power management message bus is channeled from the integrated processor at a set of package pins that are isolated from the standard external peripheral bus of the integrated processor. By providing encoded information regarding the internal events of the integrated processor, monitoring of such events by an external power management unit is possible while the number of external pins on the integrated processor are minimized.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"1\"><claim-text>1. An integrated processor comprising:<claim-text>a CPU core;</claim-text><claim-text>an internal bus coupled to said CPU core;</claim-text><claim-text>an on-chip peripheral device coupled to said internal bus;</claim-text><claim-text>a power management message unit coupled to said CPU core for detecting the occurrence of a predetermined activity of said integrated processor; and</claim-text><claim-text>a power management message bus coupled to said power management message unit, wherein said power management message bus is provided externally from said integrated processor via a set of external package pins, and wherein said power management message unit provides an encoded value on said power management message bus indicative of said predetermined activity, said encoded value being decodable by a power management unit external to said integrated processor for managing power to said integrated processor;</claim-text><claim-text>wherein said CPU core, said on-chip peripheral device and said power management message unit are fabricated on a common semiconductor substrate.</claim-text></claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"2\"><claim-text>2. The integrated processor as recited in claim 1 wherein said power management message unit includes an interrupt detector for detecting the assertion of an interrupt signal.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim num=\"3\"><claim-text>3. The integrated processor as recited in claim 2 wherein said power management message unit includes a bus request detector for detecting the assertion of a bus request signal from a peripheral device on said internal bus, wherein said power management message unit provides a first encoded value on said power management message bus in response to the assertion of said interrupt signal, and wherein said power management message unit provides a second encoded value on said power management message bus in response to the assertion of said bus request signal.</claim-text></claim>"}, {"num": 4, "parent": 3, "type": "dependent", "paragraph_markup": "<claim num=\"4\"><claim-text>4. The integrated processor as recited in claim 3 wherein said power management message unit is further configured to detect when an interrupt service has completed, and wherein said power management message unit provides a third encoded value on said power management message bus in response to the completion of said interrupt service.</claim-text></claim>"}, {"num": 5, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"5\"><claim-text>5. The integrated processor as recited in claim 1 wherein said predetermined activity includes the assertion of a bus request signal on said internal bus.</claim-text></claim>"}, {"num": 6, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"6\"><claim-text>6. The integrated processor as recited in claim 1 further comprising a DMA controller for controlling data transfers coupled to said CPU core.</claim-text></claim>"}, {"num": 7, "parent": 5, "type": "dependent", "paragraph_markup": "<claim num=\"7\"><claim-text>7. The integrated processor as recited in claim 5 further comprising a DMA controller coupled to said CPU core, wherein said DMA controller is capable of generating said bus request signal.</claim-text></claim>"}, {"num": 8, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"8\"><claim-text>8. The integrated processor as recited in claim 1 wherein said predetermined activity includes co-processor activity within said CPU core.</claim-text></claim>"}, {"num": 9, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"9\"><claim-text>9. The integrated processor as recited in claim 1 further comprising a bus interface unit for interfacing said internal bus to an external peripheral bus.</claim-text></claim>"}, {"num": 10, "parent": 9, "type": "dependent", "paragraph_markup": "<claim num=\"10\"><claim-text>10. The integrated processor as recited in claim 9 wherein said external peripheral bus is isolated from said power management message bus.</claim-text></claim>"}, {"num": 11, "parent": 9, "type": "dependent", "paragraph_markup": "<claim num=\"11\"><claim-text>11. The integrated processor as recited in claim 9 wherein said power management message bus is asychronous with respect to said external peripheral bus.</claim-text></claim>"}, {"num": 12, "parent": 1, "type": "dependent", "paragraph_markup": "<claim num=\"12\"><claim-text>12. The integrated processor as recited in claim 1 wherein said power management message unit asserts a validation strobe when said encoded value is provided on said power management message bus.</claim-text></claim>"}, {"num": 13, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"13\"><claim-text>13. A computer system comprising:<claim-text>an integrated processor including a CPU core and a power management message unit coupled to said CPU core, said CPU core and said power management message unit being fabricated on a single semiconductor substrate, wherein said power management message unit is configured to detect internal activity of said integrated processor and to provide an encoded value indicative of said internal activity on an external set of terminals;</claim-text><claim-text>a power management message bus coupled to said external set of terminals; and</claim-text><claim-text>a power management unit coupled to said power management message bus for decoding said encoded value and managing power within said computer system responsive to said encoded value.</claim-text></claim-text></claim>"}, {"num": 14, "parent": 13, "type": "dependent", "paragraph_markup": "<claim num=\"14\"><claim-text>14. The computer system as recited in claim 13 wherein said power management message unit includes an interrupt detector for detecting the assertion of an interrupt signal.</claim-text></claim>"}, {"num": 15, "parent": 14, "type": "dependent", "paragraph_markup": "<claim num=\"15\"><claim-text>15. The computer system as recited in claim 14 wherein said power management message unit further includes a bus request detector for detecting the assertion of a bus request signal of said integrated processor.</claim-text></claim>"}, {"num": 16, "parent": 15, "type": "dependent", "paragraph_markup": "<claim num=\"16\"><claim-text>16. The computer system as recited in claim 15 wherein said integrated processor further includes a DMA controller coupled to said CPU core, wherein said DMA controller is configured to generate said bus request signal.</claim-text></claim>"}, {"num": 17, "parent": 16, "type": "dependent", "paragraph_markup": "<claim num=\"17\"><claim-text>17. The computer system as recited in claim 16 wherein said power management message unit is further configured to detect co-processor activity within said CPU core.</claim-text></claim>"}, {"num": 18, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"18\"><claim-text>18. A method for managing power within a computer system, wherein said computer system includes an integrated processor having a CPU core and at least one on-chip peripheral device, said method comprising the steps of:<claim-text>detecting an assertion of a bus request signal on an internal bus of said integrated processor;</claim-text><claim-text>detecting an assertion of an interrupt signal on said integrated processor;</claim-text><claim-text>generating a first encoded value indicative of said bus request signal;</claim-text><claim-text>generating a second encoded value indicative of said interrupt signal;</claim-text><claim-text>providing said first encoded value on an external power management message bus coupled to said integrated processor;</claim-text><claim-text>providing said second encoded value on said external power management message bus coupled to said integrated processor;</claim-text><claim-text>receiving said first encoded value at a power management unit;</claim-text><claim-text>receiving said second encoded value at said power management unit; and</claim-text><claim-text>said power management unit generating a first control signal responsive to said first encoded value and a second control signal responsive to said second encoded value.</claim-text></claim-text></claim>"}, {"num": 19, "parent": 18, "type": "dependent", "paragraph_markup": "<claim num=\"19\"><claim-text>19. The method for managing power within a computer system as recited in claim 18 comprising generating a validation strobe simultaneously with providing said first encoded value on said external power management message bus and said second encoded value on said external power management message bus.</claim-text></claim>"}, {"num": 20, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"20\"><claim-text>20. An integrated processor comprising:<claim-text>a CPU core;</claim-text><claim-text>an internal bus coupled to said CPU core;</claim-text><claim-text>an on-chip peripheral device coupled to said internal bus;</claim-text><claim-text>a power management message unit coupled to said CPU core for detecting the occurrence of a predetermined activity of said integrated processor, said power management message unit including an interrupt detector for detecting the assertion of an interrupt signal, and a bus request detector for detecting the assertion of a bus request signal from a peripheral device on said internal bus; and</claim-text><claim-text>a power management message bus coupled to said power management message unit, wherein said power management message bus is provided externally from said integrated processor via a set of external package pins, and wherein said power management message unit provides an encoded value on said power management message bus indicative of said predetermined activity, said encoded value being decodable by a power management unit external to said integrated processor for managing power to said integrated processor;</claim-text><claim-text>wherein said predetermined activity includes said assertion of said interrupt signal, and said power management message unit provides a first encoded value on said power management message bus in response to the assertion of said interrupt signal; and</claim-text><claim-text>wherein said predetermined activity includes said assertion of said bus request signal, and said power management message unit provides a second encoded value on said power management message bus in response to the assertion of said bus request signal.</claim-text></claim-text></claim>"}, {"num": 21, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"21\"><claim-text>21. The integrated processor as recited in claim 20 wherein said power management message unit is further configured to detect when an interrupt service has completed, and wherein said power management message unit provides a third encoded value on said power management message bus in response to the completion of said interrupt service.</claim-text></claim>"}, {"num": 22, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"22\"><claim-text>22. The integrated processor as recited in claim 20 further comprising a DMA controller for controlling data transfers coupled to said CPU core.</claim-text></claim>"}, {"num": 23, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"23\"><claim-text>23. The integrated processor as recited in claim 20 further comprising a DMA controller coupled to said CPU core, wherein said DMA controller is capable of generating said bus request signal.</claim-text></claim>"}, {"num": 24, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"24\"><claim-text>24. The integrated processor as recited in claim 20 wherein said predetermined activity includes co-processor activity within said CPU core.</claim-text></claim>"}, {"num": 25, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"25\"><claim-text>25. The integrated processor as recited in claim 20 further comprising a bus interface unit for interfacing said internal bus to an external peripheral bus.</claim-text></claim>"}, {"num": 26, "parent": 25, "type": "dependent", "paragraph_markup": "<claim num=\"26\"><claim-text>26. The integrated processor as recited in claim 25 wherein said external peripheral bus is isolated from said power management message bus.</claim-text></claim>"}, {"num": 27, "parent": 20, "type": "dependent", "paragraph_markup": "<claim num=\"27\"><claim-text>27. The integrated processor as recited in claim 20 wherein said power management message unit asserts a validation strobe when said first encoded value is provided on said power management message bus and said power management message unit asserts said validation strobe when said second encoded value is provided on said power management message bus.</claim-text></claim>"}, {"num": 28, "parent": 27, "type": "dependent", "paragraph_markup": "<claim num=\"28\"><claim-text>28. The integrated processor as recited in claim 27 wherein said power management message bus is asynchronous with respect to said external peripheral bus.</claim-text></claim>"}, {"num": 29, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"29\"><claim-text>29. A computer system comprising:<claim-text>an integrated processor including a CPU core and a power management message unit coupled to said CPU core, wherein said power management message unit is configured to detect internal activity of said integrated processor and to provide an encoded value indicative of said internal activity on an external set of terminals, wherein said power management message unit includes an interrupt detector for detecting the assertion of an interrupt signal and said power management message unit includes a bus request detector for detecting the assertion of a bus request signal from a peripheral device on said internal bus;</claim-text><claim-text>a power management message bus coupled to said external set of terminals; and</claim-text><claim-text>a power management unit coupled to said power management message bus for decoding said encoded value and managing power within said computer system responsive to said encoded value;</claim-text><claim-text>wherein said power management message unit provides a first encoded value on said power management message bus in response to the assertion of said interrupt signal, and wherein said power management message unit provides a second encoded value on said power management message bus in response to the assertion of said bus request signal.</claim-text></claim-text></claim>"}, {"num": 30, "parent": 29, "type": "dependent", "paragraph_markup": "<claim num=\"30\"><claim-text>30. The computer system as recited in claim 29 wherein said integrated processor further includes a DMA controller coupled to said CPU core, wherein said DMA controller is configured to generate said bus request signal.</claim-text></claim>"}, {"num": 31, "parent": 30, "type": "dependent", "paragraph_markup": "<claim num=\"31\"><claim-text>31. The computer system as recited in claim 30 wherein said power management message unit is further configured to detect co-processor activity within said CPU core.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES317715391\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>This invention relates to integrated processors and more particularly to the power management of computer systems that employ integrated processors.</p><p>2. Description of the Relevant Art</p><p>An ongoing developmental goal of manufacturers has been to reduce the power consumption of computer systems. Reducing power consumption typically reduces heat generation of the system, thereby increasing reliability and decreasing cost. In addition, power reduction has been particularly important in maximizing the operating life of battery-powered portable computer systems.</p><p>Various techniques have been devised for reducing the power consumption of computer systems. These techniques include increasing the integration of circuitry and incorporation of improved circuitry and power management units (PMUs). One specific power reduction technique involves the capability of stopping clock signals that drive inactive circuit portions. A system employing such a technique typically includes a power management unit that detects or predicts inactive circuit portions and accordingly stops the clock signals associated with the inactive circuit portions. By turning off \"unused\" clock signals that drive inactive circuit portions, overall power consumption of the system is decreased. A similar technique involves the capability of reducing the frequency of clock signals that drive circuit portions during operating modes which are not time critical, and another technique involves the capability of removing power from inactive circuit portions.</p><p>Power managed computer systems that employ the above-described power reduction techniques typically monitor various activities at the point of use or by snooping centralized buses. For example, an activity monitor of a power management unit may be connected directly to various control lines associated with the microprocessor and peripheral devices to determine whether certain activities are occurring. Depending upon the detected activities, the power management unit may responsively power down selected circuit portions, reduce the frequencies of selected clock signals, and/or completely stop selected clock signals.</p><p>In recent years, integrated processors have been developed to replace previously discrete microprocessors and associated peripheral devices within computer systems. An integrated processor is an integrated circuit that performs the functions of both a microprocessor and various peripheral devices such as, for example, a memory controller, a DMA controller, a timer, and a bus interface unit, among other things. The introduction of integrated processors has allowed for decreases in the overall cost, size, and weight of computer systems, and has in many cases accommodated improved performance characteristics of the computer systems.</p><p>A problem encountered in the design of computer systems that incorporate integrated processors is that many points of monitoring are no longer available to an external power management unit. That is, since the CPU core and various peripheral devices are contained on a common integrated circuit chip, internal connections between the CPU core and the peripheral devices may not be accessible externally. Thus, certain system activities may be undetectable in real-time. Although external package pins could be provided on the integrated processor to provide external access directly to the selected internal points of monitoring, such dedicated pins would result in a significant increase in the overall pin count of the integrated processor and would further require that the die size of the integrated processor be increased to accommodate the additional bond wire pads. As a result, a significant cost would be added to the cost of the integrated processor.</p><h4>SUMMARY OF THE INVENTION</h4><p>The problems outlined above are in large part solved by an integrated processor including a power management message bus in accordance with the present invention. In one embodiment, an integrated processor is provided that includes a CPU core coupled to a variety of on-chip peripheral devices such as a DMA controller, an interrupt controller, and a timer. The integrated processor further includes a power management message unit coupled to the DMA controller, interrupt controller, and timer for monitoring the internal interrupt and bus request signals of the integrated processor. The power management message unit may also monitor other selected activities of the integrated processor depending upon the system power management requirements. Based on the detected activities, if any, the power management message unit encodes a message on a power management message bus to thereby provide information regarding the internal events of the integrated processor to an external power management unit. The power management message bus is channeled from the integrated processor at a set of package pins that are isolated from the standard external peripheral bus of the integrated processor. By providing encoded information regarding the internal events of the integrated processor, monitoring of such events by an external power management unit is possible while the number of external pins on the integrated processor are minimized.</p><p>Broadly speaking, the present invention contempates an integrated processor comprising a CPU core, an internal bus coupled to the CPU core, an on-chip peripheral device coupled to the internal bus, and a power management message unit coupled to the CPU core for detecting the occurrence of a predetermined activity of the integrated processor. A power management message bus is further provided coupled to the power management message unit, wherein the power management message bus is provided externally from the integrated processor via a set of external package pins, and wherein the power management message unit provides an encoded value on the power management message bus indicative of the internal activity.</p><p>The present invention further contemplates a computer system comprising an integrated processor including a CPU core and a power management message unit coupled to the CPU core, wherein the power management message unit is capable of detecting an internal activity of the integrated processor and of providing an encoded value indicative of the internal activity on an external set of terminals. The computer system further comprises a power management message bus coupled to the external set of terminals, and a power management unit coupled to the power management message bus for managing power within the computer system.</p><p>The present invention finally contemplates a method for managing power within a computer system, wherein the computer system includes an integrated processor having a CPU core and at least one on-chip peripheral device. The method comprises the steps of detecting an internal activity of the integrated processor, generating an encoded value indicative of the activity, providing the encoded value on an external power management message bus coupled to the integrated processor, and receiving the encoded value at a power management unit.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>Other objects and advantages of the invention will become apparent upon reading the following detailed description and upon reference to the accompanying drawings in which:</p><p>FIG. 1 is a block diagram of an integrated processor including a power management message bus in accordance with the present invention.</p><p>FIG. 2 is a block diagram of a power management message unit incorporated within the integrated processor of FIG. 1.</p><p>FIG. 3 is a timing diagram that illustrates a message transmit cycle executed by the power management message unit of FIG. 1.</p><p>FIG. 4 is a diagram of an algorithmic state machine embodied within the power management message unit of FIG. 1.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><p>While the invention is susceptible to various modifications and alternative forms, specific embodiments thereof are shown by way of example in the drawings and will herein be described in detail. It should be understood, however, that the drawings and detailed description thereto are not intended to limit the invention to the particular form disclosed, but on the contrary, the intention is to cover all modifications, equivalents and alternatives falling within the spirit and scope of the present invention as defined by the appended claims.</p><h4>DETAILED DESCRIPTION OF THE INVENTION</h4><p>Referring now to FIG. 1, a block diagram is shown of a computer system 200 including an integrated processor 202 coupled to a peripheral device 204 via an external bus 206. Integrated processor 202 is further coupled to a power management unit 208 via a power management message bus 210.</p><p>Integrated processor 202 includes a CPU core 220 coupled to a variety of on-chip peripheral devices such as a DMA (direct memory access) controller 222, an interrupt controller 224, and a timer 226. CPU core 220 is coupled to external bus 206 via an on-chip bus interface unit 228. A clock generator 230 and a power management (PM) message unit 232 are further incorporated within integrated processor 202. The operation of clock generator 230 and power management message unit 232 will be described in further detail below.</p><p>External bus 206 is illustrative of, for example, a PCI local bus. It is noted that other bus standards such as the ISA or EISA bus standards could be alternatively employed. Peripheral device 204 is illustrative of any externally connectable peripheral device such as a video controller, a disk drive, or a printer.</p><p>Power management unit 208 is provided for managing and minimizing the power consumed by computer system 200. The power management unit 208 receives an encoded signal PMCODE [2:0] on power management message bus 210. The encoded signal PMCODE[2:0] is indicative of certain activities that occur within integrated processor 202, as will be described below. Power management unit 208 generates a set of clock control signals at lines 250 and a set of power control signals at lines 252. The clock control signals and the power control signals are used, respectively, to control the frequencies of selected clock signals and to control the application of power to selected circuit portions. Specifically, the clock control signals are received by clock generator 230 which generates a CPU clock signal and a system clock signal. The frequencies of the CPU clock signal and the system clock signal are dependent upon the clock control signals generated by power management unit 208. The power control signals on lines 252 are provided to control the application of power to selected circuit portions that comprise computer system 200 such as peripheral device 204. It is understood that certain power control signals may be provided to integrated processor 202 to control the application of power to various internal circuit portions of integrated processor 202.</p><p>CPU core 220 is a data processing unit that implements a predetermined instruction set, such as the model 80486 microprocessor instruction set. CPU core 220 further includes a floating-point coprocessing subunit. DMA controller 222 is provided for controlling data transfers between a system memory (not shown) and various I/O peripheral devices (also not shown). Interrupt controller 224 is provided for interfacing, priortizing, and masking various interrupt signals associated with computer system 200. Timer 226 is provided for general purpose timing functions, including the generation of a timer tick interrupt signal. Finally, bus interface unit 228 is provided for orchestrating and controlling the transfer of data, address, and control signals between external bus 206 and an internal bus 260. It is noted that DMA controller 222, interrupt controller 224, timer 226, and bus interface unit 228 may be fabricated in accordance with a variety of known circuit implementations.</p><p>Referring next to FIG. 2, a block diagram is shown of the power management message unit 232. As illustrated in the figure, the power management message unit 232 includes a bus request detector 302, an NPU monitor 304, and an interrupt detector 306 coupled to a message transmit logic unit 308. The bus request detector 302 is capable of detecting a bus request signal associated with bus 260, and is capable of detecting the subsequent release of the bus 260. It is noted that the bus request signal may be generated by DMA controller 222 or by bus interface unit 228 (which asserts the bus request signal in response to an external bus master). NPU monitor 304 is coupled to CPU core 220 and is capable of detecting when the coprocessing subunit of CPU core 220 is active. Interrupt detector 306 is coupled to interrupt controller 224 and CPU core 220 and is capable of detecting the assertions of an interrupt signal INT, a non-maskable interrupt signal NMI, a system management interrupt signal SMI, and a timer tick interrupt signal. Interrupt detector 306 is further capable of detecting when a corresponding interrupt service and a corresponding timer tick service have cleared.</p><p>Depending upon the system activity as detected by bus request detector 302, NPU monitor 304, and interrupt detector 306, message transmit logic unit 308 issues an encoded signal on the power management message bus 210. The encoding of the power management message bus 210 is indicated below in Table I.</p><p></p><pre listing-type=\"tabular\" xml:space=\"preserve\"><!--Greenbook tabular data-->              TABLE I                                                     \n______________________________________                                    \n          Bit Definition                                                  \nInternal Event                                                            \n          PMCODE[2:0] Description                                         \n______________________________________                                    \nPM Bus NOP                                                                \n          000         May be used as a                                    \n                      no-operation command.                               \nNPU Active                                                                \n          001         The start of an NPU                                 \n                      instruction has been detected.                      \nBus request                                                               \n          010         Either an external bus master                       \n                      or the internal DMA                                 \n                      controller is active.                               \nNMI occurred                                                              \n          011         A non-maskable interrupt                            \n                      was generated to the CPU.                           \nSMI Active                                                                \n          100         A system management mode                            \n                      interrupt was generated                             \n                      to the CPU.                                         \nInterrupt 101         At least one interrupt service                      \nActive                routine is in progress,                             \n                      excluding timer interrupts.                         \nTimer Active                                                              \n          110         A timer interrupt is                                \n                      pending or in service.                              \nAll Clear 111         Indicates that any bus request                      \n                      or interrupt service has                            \n                      completed.                                          \n______________________________________                                    \n</pre><p>As indicated in Table I, the power management message bus 210 is driven with a PMCODE [2:0] value of 001 when the start of a co-processor instruction has been detected by NPU monitor 304. The power management message bus 210 is driven with a PMCODE [2:0] value of 010 if either an external bus master or the internal DMA controller 222 is active, as detected by bus request detector 302. A PMCODE [2:0] value of 011 is driven on the power management message bus 210 if a non-maskable interrupt is received by CPU core 220, and a PMCODE [2:0] value of 100 is driven on power management message bus 210 if a system management mode interrupt is received by CPU core 220. A PMCODE [2:0] value of 101 is driven on the power management message bus 210 if at least one interrupt service routine is in progress, excluding timing interrupts, and a PMCODE [2:0] value of 110 is driven on the power management message bus 210 if a timer interrupt is pending or is in service. Finally, a PMCODE [2:0] value of 111 is driven on the power management message bus 210 if any bus request or interrupt service previously indicated has completed.</p><p>FIG. 3 is a timing diagram that illustrates a message transmit cycle executed by message transmit logic unit 308. As illustrated, when the occurrence of a monitored activity has been detected, or when the completion of a monitored activity has been detected, the PMCODE [2:0] lines of power message bus 210 are driven with a valid encoded message in accordance with values defined in Table I. A validation strobe signal labeled PMVALID# is simultaneously asserted on power management message bus 210 to indicate that a valid message is being driven on lines PMCODE [2:0].</p><p>FIG. 4 is a diagram of an algorithmic state machine 500 embodied within message transmit logic unit 308. State machine 500 enters a idle state 502 upon system reset, and transitions to state 504 when a monitored activity is detected by either bus request detector 302, NPU monitor 304, or interrupt detector 306. The type of detected activity is determined during state 504. State machine 500 next transitions to state 506 during which a valid message in accordance with the encoded values of Table I is driven on lines PMCODE [2:0] of the power management message bus 210. The validation strobe PMVALID# is further asserted during state 506. If additional activity is detected during state 506, state machine 500 transitions back to state 504, determines the type of activity detected, and reverts back to state 506 and drives the power management message bus 210 accordingly. When all interrupts have been cleared and all bus requests have been deasserted, the state machine 500 enters state 508 during which an encoded \"All Clear\" message is broadcast on the power management message bus 210. The validation strobe PMVALID# is again asserted during state 508 when the all clear message is asserted on lines PMCODE [2:0]. Following the all clear message, state machine 500 reverts back to idle state 502.</p><p>Referring back to FIG. 1, power management unit 208 latches each message transmitted by power management message unit 232 upon the assertion of the validation strobe PMVALID#. When power management unit 208 receives a new message, it controls the clock control signals at lines 250 and the power control signals 252 in accordance with a predetermined power management algorithm. For example, when the all clear message is received by power management unit 208 from power management message unit 232, the power management unit 208 may drive the clock control signals at lines 250 such that the frequencies of the CPU clock signal and the system clock signal are reduced or such that the CPU clock signal and/or the system clock signal is stopped. Power management unit 208 may similarly drive the power control signals at lines 252 to remove power from selected peripheral devices and/or subunits of computer system 200. Depending upon subsequent system activity that may be reported on power management message bus 210, the power management unit 208 controls the clock control signals such that the frequencies of the CPU clock signal and the system clock signal are raised, and such that the power control signals are driven to reapply power to selected peripheral devices and subunits of computer system 200.</p><p>It is noted that the power management message bus for an integrated processor as described above may be employed within a system that includes the further circuitry and techniques described within the copending, commonly assigned patent applications: \"Power Management Unit Including Software Configurable State Register and Time-Out Counters for Protecting Against Misbehaved Software\", by O'Brien, et al., Ser. No., 08/190,279, filed concurrently herewith; \"Power Management System for an Integrated Processor\", by O'Brien, et al., Ser. No. 08/190,292, filed concurrently herewith; \"Periodic System Management Interrupt Source and Power Management System Employing the Same\", by Wisor, et al., Ser. No. 08/190,597, filed concurrently herewith; \"Immediate System Management Interrupt Source with Associated Reason Register\", by Wisor, et al., Ser. No. 08/190,285, filed concurrently herewith; and \"High Performance Integrated Processor Architecture\", by Gephardt, et al., Ser. No. 08/190,647, filed concurrently herewith. It is further noted that interrupt controller 224 may be implemented in accordance with the copending, commonly assigned patent application entitled \"Interrupt Controller With In-Service Indication\", by MacDonald et al., Ser. No. 08/125,336, filed Sep. 22, 1993. The above copending, commonly assigned patent applications are incorporated herein by reference in their entirety.</p><p>It is further noted that while the power management message unit 232 of FIG. 1 detects the specific activities as indicated within Table I, other internal system activities may be alternatively or additionally detected and indicated via power management message bus 210. For example, the power management message unit may be configured with a decoder to snoop the internal bus 260 to detect the execution of selected bus cycles. In addition, while the power management unit 208 of FIG. 1 controls the generation of various clock signals within computer system 200 as well as the application of power to various peripheral devices and subunits of computer system 200, the power management unit 208 may be configured to control only selected clock signals of computer system 200 or to control only the application of power to various peripheral devices.</p><p>Numerous variations and modifications will become apparent to those skilled in the art once the above disclosure is fully appreciated. It is intended that the following claims be interpreted to embrace all such variations and modifications.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Douglas D.", "last_name": "Gephardt", "name": ""}, {"first_name": "James R.", "last_name": "Macdonald", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "ADVANCED MICRO DEVICES, INC."}, {"first_name": "", "last_name": "ADVANCED MICRO DEVICES, INC.", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F   1/32"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F   1/04        20060101ALI20051220RMJP"}, {"label": "G06F   1/32        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "713340"}, {"primary": false, "label": "713310"}], "ecla_classes": [{"label": "G06F   1/32P"}], "cpc_classes": [{"label": "G06F   1/3203"}, {"label": "G06F   1/3203"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1994-02-02", "application_date": "1994-02-02", "family_members": [{"ucid": "AT-236425-T", "titles": [{"lang": "DE", "text": "INTEGRIERTER PROZESSOR DER INDIZEN ÜBER INTERNE AKTIVITÄTEN AN EINEN EXTERNEN LEISTUNGSSTEUERUNGSBUS LIEFERT"}, {"lang": "EN", "text": "INTEGRATED PROCESSOR THAT PROVIDES INDICES TO AN EXTERNAL POWER CONTROL BUS THROUGH INTERNAL ACTIVITIES"}]}, {"ucid": "DE-69530141-T2", "titles": [{"lang": "EN", "text": "Integrated processor that provides indexes of internal activities to an external power control bus"}, {"lang": "DE", "text": "Integrierter Prozessor der Indizen über interne Aktivitäten an einen externen  Leistungssteuerungsbus liefert"}]}, {"ucid": "US-5640573-A", "titles": [{"lang": "EN", "text": "Power management message bus for integrated processor"}]}, {"ucid": "DE-69530141-D1", "titles": [{"lang": "EN", "text": "Integrated processor that provides indexes of internal activities to an external power control bus"}, {"lang": "DE", "text": "Integrierter Prozessor der Indizen über interne Aktivitäten an einen externen Leistungssteuerungsbus liefert"}]}, {"ucid": "EP-0666528-A1", "titles": [{"lang": "DE", "text": "Leistungssteuerung-Nachrichtenbus für integrierten Prozessor"}, {"lang": "EN", "text": "Power management message bus for integrated processor"}, {"lang": "FR", "text": "Bus de messages de gestion d'énergie pour processeur intégré"}]}, {"ucid": "JP-H07302139-A", "titles": [{"lang": "JA", "text": "集積プロセッサ、コンピュータシステムおよびコンピュータシステム内の電力を管理する方法"}, {"lang": "EN", "text": "INTEGRATED PROCESSOR, COMPUTER SYSTEM AND METHOD FOR CONTROL OF ELECTRIC POWER AT INSEDE OF COMPUTER SYSTEM"}]}, {"ucid": "JP-3454953-B2", "titles": [{"lang": "JA", "text": "集積プロセッサ、コンピュータシステムおよびコンピュータシステム内の電力を管理する方法"}, {"lang": "EN", "text": "Integrated processor, computer system, and method for managing power in computer system"}]}, {"ucid": "EP-0666528-B1", "titles": [{"lang": "EN", "text": "Integrated processor providing indications of internal activity to an external power management bus"}, {"lang": "DE", "text": "Integrierter Prozessor der Indizen über interne Aktivitäten an einen externen  Leistungssteuerungsbus liefert"}, {"lang": "FR", "text": "Processeur intégré qui fournit des indications d'activités internes à un bus de gestion d'énergie extern"}]}]}