{"patent_number": "US-6233655-B1", "publication_id": 72680828, "family_id": 22093434, "publication_date": "2001-05-15", "titles": [{"lang": "EN", "text": "Method for Quad-word Storing into 2-way interleaved L1 cache"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"docdb\" mxw-id=\"PA11192126\" source=\"national office\"><p>A computer processor has an I-unit (instruction unit) and instruction decoder, an E-unit (execution unit), a Buffer Control Element (BCE) containing a unified two-way interleaved L1 cache and providing write control to said two-way interleaved L1 cache. The processor has Double Word wide execution dataflow. An instruction decoder receiving instruction data from a unified cache before decoding causes, for stores, I-unit logic to initiate a request ahead of execution to tell the buffer control element that stores will be made from the E-unit, and E-unit logic sends a store request to initiate a store after decoding corresponding instruction data which indicates what address in the cache the DoubleWord data is to be stored to. In the process, E-unit logic calculates, from source and destination address information address ranges information in an instruction, whether a corresponding multi-Double Word store with same byte data will result from the data patterns, and, when a multi-Double Word store could result, it enables the E-unit to request the writing of an incoming Double Word on the computer's data bus for both Double Word L1 cache interleaves using the same address for both to effectively write two consecutively addressed DoubleWords for the same cycle to achieve a Quad Word store in a cycle.</p></abstract>"}, {"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA72558490\"><p>A computer processor has an I-unit (instruction unit) and instruction decoder, an E-unit (execution unit), a Buffer Control Element (BCE) containing a unified two-way interleaved L<b>1 </b>cache and providing write control to said two-way interleaved L<b>1 </b>cache. The processor has Double Word wide execution dataflow. An instruction decoder receiving instruction data from a unified cache before decoding causes, for stores, I-unit logic to initiate a request ahead of execution to tell the buffer control element that stores will be made from the E-unit, and E-unit logic sends a store request to initiate a store after decoding corresponding instruction data which indicates what address in the cache the DoubleWord data is to be stored to. In the process, E-unit logic calculates, from source and destination address information address ranges information in an instruction, whether a corresponding multi-Double Word store with same byte data will result from the data patterns, and, when a multi-Double Word store could result, it enables the E-unit to request the writing of an incoming Double Word on the computer's data bus for both Double Word L<b>1 </b>cache interleaves using the same address for both to effectively write two consecutively addressed DoubleWords for the same cycle to achieve a Quad Word store in a cycle.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6233655-B1-CLM-00001\" num=\"1\"><claim-text>1. A method for selectively storing Quad Words into a two-way interleaved L<b>1</b> cache of a computer with a Double Word wide execution dataflow comprising the steps of:</claim-text><claim-text>receiving from an I-unit (instruction unit), of said computer capable of executing Quad Words and Double Words, store, details of an instruction sought to be executed, </claim-text><claim-text>recognizing with an E-unit (execution unit), of said computer, instructions that could result in having same storing data patterns; </claim-text><claim-text>calculating address ranges information, with said E-unit, from source and destination address information and from said calculated address ranges information in said instruction sought to be executed, determining whether a corresponding multi-Double Word store with a same byte data will result for said address ranges, and, when a multi-Double Word store could result for said address ranges, then enabling the E-unit to request the writing of an incoming Double Word on a computer's data bus for both Double Word L<b>1</b> Cache interleaves using the same destination address for both to effectively write two consecutively addressed Double Words for a same cycle to achieve a Quad Word store in said same cycle. </claim-text></claim>"}, {"num": 2, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6233655-B1-CLM-00002\" num=\"2\"><claim-text>2. A computer system comprising,</claim-text><claim-text>a processor having </claim-text><claim-text>an I-unit (instruction unit) with an instruction decoder, </claim-text><claim-text>an E-unit (execution unit), </claim-text><claim-text>a BCE (buffer control element) containing </claim-text><claim-text>a unified two-way interleaved L<b>1</b> cache and providing write control to said two-way interleaved L<b>1</b> cache, and wherein the processor has Double Word wide execution dataflow, said I-unit instruction decoder receives instruction data from said unified cache before decoding and for stores, causes the I-unit logic to initiate a request ahead of execution of an instruction to tell the buffer control element that stores will be made from the E-unit, and wherein E-unit logic sends a store request to initiate a store after decoding corresponding instruction data which indicates what address in said cache the Double Word data is to be stored to, and in processing instructions, said E-unit logic calculates address ranges information for an instruction sought to be executed from source and destination address information in said instruction sought to be executed and determines whether a corresponding multi-Double Word store with a same byte data will result from said instruction data and, when a multi-Double Word store could result, said E-unit logic enables the E-unit to request writing of an incoming Double Word on a computer's data bus for both Double Word's L<b>1</b> cache interleaves using the same destination address for both to effectively write two consecutively addressed Double Words for the same cycle to achieve a Quad Word store in said same cycle. </claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6233655-B1-CLM-00003\" num=\"3\"><claim-text>3. A computer system according to claim <b>2</b> wherein said cache is a 4-way set associative cache with a cache directory which is 2-way interleaved on a Double Word basis, allowing separate reads or writes in each interleave per cycle when the separate operations of reading and writing have different values for an address bit which indicates whether the word is an ODD or EVEN Double Word within the cache address space.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES54547432\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>FIELD OF THE INVENTION</h4><p>This invention is related to computers and computer systems and in particular to a method for selectively storing Quad Words into a two-way interleaved L<b>1</b> cache with a Double Word wide execution dataflow.</p><h4>BACKGROUND OF THE INVENTION</h4><p>In attempting to improve performance in data transfers in complex machines which can have both Quad Word (QW) and Double Word (DW) stores, in the past the apparent solution for using a QW store to cache instead of two double word stores in order to double the data stored per cycle was to increase the data-path size within the execution unit (E-unit) and also the data-path from the E-unit to the BCE (Buffer Control Element which provides a level 1 cache). However, increasing the data-path is expensive in the use of chip area and complexity and results in a much bigger and more complex CPU. We thought it would be desirable to achieve a QW store with a single DW wide data-path and determined how this could be achieved.</p><h4>SUMMARY OF THE INVENTION</h4><p>The preferred embodiment permits a Quad Word (QW) store per cycle with a single Double Wide (DW) wide data-path. The implementation provided enables bandwidth improvement without accompanying costs involved in having a wider data bus. Indeed, we now believe that our solution as illustrated by our preferred embodiment could be useful in any processor design that has a small data-bus trying to execute instructions as if there is a wider data-bus, in order to provide better performance.</p><p>These and other improvements are set forth in the following detailed description. For a better understanding of the invention with advantages and features, refer to the description and to the drawings.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 illustrates the preferred embodiment of a processor which has an I-Unit, and E-unit and a L<b>1</b> cache.</p><p>FIG. 2 shows the dataflow illustrating the steps used in the E-unit to determine when to enable the interface for Quad Word stores.</p><p>(Note: For convenience of illustration, FIGURES may be separated in parts and as a convention we place the top of the FIGURE as the first sheet, with subsequent sheets proceeding down and across when viewing the FIGURE, in the event that multiple sheets are used.)</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF THE INVENTION</h4><p>Before considering our preferred embodiments in detail, it may be worthwhile to note that our preferred embodiment is to be implemented in an IBM (International Business Machines Corporation) S/390 scale system, in which the processor chip has an Instruction Unit, Execution Unit, and level 1 cache L<b>1</b> unified with a control element BCE (Buffer Control Element).</p><p>Turning to our invention in more detail as illustrated in FIG. 1 illustrating the preferred embodiment of the planned processor (<b>10</b>) which contains an I-unit (<b>12</b>), an E-unit (<b>13</b>) and a BCE (<b>11</b>). The BCE (<b>11</b>) contains the unified 256K byte store-through L<b>1</b> cache (<b>15</b>). The cache (<b>15</b>) is 4-way set associative with a corresponding directory (<b>14</b>). The cache (<b>15</b>) is 2-way interleaved on a DW (doubleword) basis, allowing separate operations (reads or writes) in each interleave per cycle, as long as the 2 operations are for different values of address bit 28 (which indicates whether it is a ODD or EVEN DW within the 31 bit address space).</p><p>I-unit (<b>12</b>) receives the necessary instruction data (<b>21</b>) from the unified cache (<b>15</b>) before decode. After decoding an instruction that stores, the I-unit (<b>12</b>) will make a request (<b>20</b>) ahead of execution to tell the BCE (<b>11</b>) that stores will be made shortly by the E-unit (<b>13</b>). I-unit (<b>12</b>) will also make the fetches for any required operand data (<b>22</b>) needed to execute the store instruction.</p><p>When E-unit (<b>13</b>) is ready to execute the store instruction, it will send a QW or DW store request (<b>24</b>) together with the corresponding DW data (<b>23</b>). Each DW of store data (<b>23</b>) also comes with 8 byte marks (<b>25</b>) that say which bytes of the DW are actually going to be stored-to. If a QW store is requested, each interleave also receives a JAM byte mark (<b>26</b>) signal to override the 8 byte marks to all 1's, thus storing the whole DW data (<b>23</b>) into the cache address. The merging of old and new data is done at L<b>1</b> write time. Store data (<b>23</b>) from the E-unit (<b>13</b>) is usually written into the cache (<b>15</b>) 1 DW at a time, i.e. it only writes to a maximum of 1 interleave per cycle. The single DW bandwidth from the E-unit is inherent in the whole planned data-path structure throughout the processor.</p><p>Analysis had shown that performance of instructions involving multi-DW stores are being limited, due to the fact that only one DW is stored to L<b>1</b> per CP cycle. Cycle-per-instruction (CPI) for those instructions are thus comparably worse than for a processor with wider data-bus.</p><p>In many programs, a large portion of the multi-DW store instructions that impact performance are in fact storing the same data to each byte of the operand, and because the L<b>1</b> cache is 2-way interleaved, the control interface between the E-unit and L<b>1</b> cache is enhanced to selectively do a QW (quad-word) store per cycle. E-unit determines from the instruction details (<b>26</b>) used to enable the QW store capability.</p><p>FIG. 2 illustrates the dataflow illustrating the steps used in the E-unit to determine when to enable the interface between E-unit and BCE to handle Quad Word stores per cycle. More specifically, after receiving the details of an instruction (<b>31</b>) to be executed from the I-unit, the execution unit will recognize instructions that could possibly result with the same data patterns, i.e. XC and MVC, in (<b>32</b><i>a</i>) and (<b>32</b><i>b</i>).</p><p>For those two instructions, the E-unit will then calculate from the source and destination address ranges whether the corresponding multi-DW stores will definitely result with the same data patterns, i.e.</p><p>XC (when the two operand addresses overlap exactly, i.e. destination address=source address), (<b>33</b><i>a</i>);</p><p>MVC (with one byte destructive overlap on the two operand addresses, i.e. destination address=source address+1), (<b>33</b><i>b</i>).</p><p>Those two instruction sequences will result in the same data for every byte in the whole store length. For XC, every byte will be zero, (<b>34</b><i>a</i>). For MVC, every byte is the same as the first source byte, (<b>34</b><i>b</i>).</p><p>On the other hand, if the source and destination address ranges do not fall into the desired patterns, the E-unit will by default do single DW store per cycle as it will normally does, <b>36</b>.</p><p>Once the possibility of QW store is recognized, the steps of achieving QW store per cycle are enabled by using the newly enhanced interface signal which enables the e-unit to request the BCE to write the incoming DW data-bus for both L<b>1</b> cache interleaves, (<b>35</b>).</p><p>The BCE will use the same address to both L<b>1</b> cache interleaves and effectively write two consecutively (even and odd) addressed DWs at the same cycle, thus achieving a QW store per cycle.</p><p>At each cycle when the E-unit is requesting a QW store, the corresponding JAM byte marks signal will be ON for the DW that is to be completely written over. When a JAM byte mark signal is active, the 8 byte marks of the corresponding L<b>1</b> cache interleave will be forced to 1's. On the other hand, for the DW that only receives partial writes (potentially within the starting or ending DW), its corresponding JAM byte mark signal will be off, and the original byte mark from the E-unit will be used to write the appropriate bytes.</p><p>For a generic case where an instruction is storing same byte to those bytes marked with “x” below: <chemistry id=\"CHEM-US-00001\"><attachments><attachment attachment-type=\"cdx\" file=\"US06233655-20010515-C00001.CDX\" idref=\"CHEMCDX-00001\"></attachment><attachment attachment-type=\"mol\" file=\"US06233655-20010515-C00001.MOL\" idref=\"CHEMMOL-00001\"></attachment></attachments></chemistry></p><p>the E-unit will send the following signal sequences:</p><p><tables id=\"TABLE-US-00001\"><table colsep=\"0\" frame=\"none\" rowsep=\"0\"><tgroup align=\"left\" cols=\"5\" colsep=\"0\" rowsep=\"0\"><colspec align=\"left\" colname=\"OFFSET\" colwidth=\"21PT\"></colspec><colspec align=\"center\" colname=\"1\" colwidth=\"28PT\"></colspec><colspec align=\"center\" colname=\"2\" colwidth=\"63PT\"></colspec><colspec align=\"center\" colname=\"3\" colwidth=\"35PT\"></colspec><colspec align=\"center\" colname=\"4\" colwidth=\"70PT\"></colspec><thead valign=\"bottom\"><row><entry morerows=\"0\" valign=\"top\"></entry><entry align=\"center\" morerows=\"0\" nameend=\"4\" namest=\"OFFSET\" rowsep=\"1\" valign=\"top\"></entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">byte</entry><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\"></entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">Cycle #</entry><entry morerows=\"0\" valign=\"top\">marks</entry><entry morerows=\"0\" valign=\"top\">Jam Even</entry><entry morerows=\"0\" valign=\"top\">Jam Odd</entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry align=\"center\" morerows=\"0\" nameend=\"4\" namest=\"OFFSET\" rowsep=\"1\" valign=\"top\"></entry></row></thead><tbody valign=\"top\"><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">1</entry><entry morerows=\"0\" valign=\"top\">00001111</entry><entry morerows=\"0\" valign=\"top\">0</entry><entry morerows=\"0\" valign=\"top\">1</entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">2</entry><entry morerows=\"0\" valign=\"top\">11111111</entry><entry morerows=\"0\" valign=\"top\">1</entry><entry morerows=\"0\" valign=\"top\">1</entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">3</entry><entry morerows=\"0\" valign=\"top\">11111111</entry><entry morerows=\"0\" valign=\"top\">1</entry><entry morerows=\"0\" valign=\"top\">1</entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry morerows=\"0\" valign=\"top\">4</entry><entry morerows=\"0\" valign=\"top\">11111000</entry><entry morerows=\"0\" valign=\"top\">1</entry><entry morerows=\"0\" valign=\"top\">0</entry></row><row><entry morerows=\"0\" valign=\"top\"></entry><entry align=\"center\" morerows=\"0\" nameend=\"4\" namest=\"OFFSET\" rowsep=\"1\" valign=\"top\"></entry></row></tbody></tgroup></table></tables></p><p>Effectively, instead of 8 single DW stores (taking 8 cycles), 4 QW stores will be done (in 4 cycles). Therefore, this example will have a 100% speed up.</p><p>While we have described our preferred embodiments of our invention, it will be understood that those skilled in the art, both now and in the future, may make various improvements and enhancements which fall within the scope of the claims which follow.</p><p>Using the previous example, if the L<b>1</b> cache is 4-way interleaved instead, we could construct the hardware to do 4-DW stores per cycle, thus achieving a 200% speedup.</p><p>The claims should be construed to maintain the proper protection for the invention first disclosed.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Chung-Lung Kevin", "last_name": "Shum", "name": ""}, {"first_name": "Wen He", "last_name": "Li", "name": ""}, {"first_name": "Charles Franklin", "last_name": "Webb", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "INTERNATIONAL BUSINESS MACHINES CORPORATION"}, {"first_name": "", "last_name": "INTERNATIONAL BUSINESS MACHINES CORPORATION", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  12/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F   9/312       20060101A I20051008RMEP"}, {"label": "G06F  12/08        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "711127"}, {"primary": false, "label": "711E12047"}, {"primary": false, "label": "711E12056"}, {"primary": false, "label": "712E09033"}, {"primary": false, "label": "711131"}, {"primary": false, "label": "711128"}, {"primary": false, "label": "711157"}, {"primary": false, "label": "711149"}], "ecla_classes": [{"label": "G06F   9/30A2L"}, {"label": "G06F  12/08B16V"}, {"label": "G06F  12/08B6M4"}], "cpc_classes": [{"label": "G06F  12/1045"}, {"label": "G06F  12/0886"}, {"label": "G06F   9/30043"}, {"label": "G06F  12/0851"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1998-04-30", "application_date": "1998-04-30", "family_members": [{"ucid": "US-6233655-B1", "titles": [{"lang": "EN", "text": "Method for Quad-word Storing into 2-way interleaved L1 cache"}]}]}