{"patent_number": "US-6412057-B1", "publication_id": 73061867, "family_id": 22930544, "publication_date": "2002-06-25", "titles": [{"lang": "EN", "text": "Microprocessor with virtual-to-physical address translation using flags"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA50337836\"><p>A microprocessor includes an MMU which converts from a virtual address to a physical address, and an LSU which controls an execution of a load/store instruction. The LSU includes a DCACHE which temporarily stores data to read out from and to write into an external memory, an SPRAM used for a specific purpose besides caching, and an address generator which generates the virtual address to access the DCACHE and the SPRAM. The MMU generates a conversion table which performs a conversion from the virtual address to the physical address. A flag information showing whether or not the access to the SPRAM is performed is included in this conversion table. The LSU absolutely accesses the SPRAM if the flag is being set. Accordingly, it is unnecessary to allocate the SPRAM to a memory map of the main memory, and the allocation of the memory map simplifies.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00001\" num=\"1\"><claim-text>1. A microprocessor comprising:</claim-text><claim-text>a memory management unit for converting a first address to a second address; </claim-text><claim-text>a load/store instruction executing part configured to execute a load/store instruction; and </claim-text><claim-text>a first memory configured to be accessed only by the first address, not to be mapped on a memory map of a main memory accessed by the second address, and not to require consistency of data with said main memory; </claim-text><claim-text>wherein said memory management unit includes a flag information generating part configured to generate a first flag information showing whether or not to perform an access to said first memory, said memory management unit accessing said main memory whose addresses are allocated by using the second address and accessing said first memory by using an offset address at lower side of the first address based on said first flag information. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00002\" num=\"2\"><claim-text>2. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>a second memory configured to temporarily store data to be written to or be read from said main memory, and to require consistency of data with said main memory. </claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00003\" num=\"3\"><claim-text>3. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00002\">claim 2</claim-ref>, wherein said second memory is a cache memory.</claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00004\" num=\"4\"><claim-text>4. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00001\">claim 1</claim-ref>, wherein the first address is a virtual address, and the second address is a physical address.</claim-text></claim>"}, {"num": 5, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00005\" num=\"5\"><claim-text>5. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00001\">claim 1</claim-ref>,</claim-text><claim-text>wherein said memory management unit includes a table generating part configured to generate a conversion table to convert the first address to the second address by each page having a constant memory capacity; and </claim-text><claim-text>said flag information generating part stores said first flag information corresponding to the first address to said conversion table. </claim-text></claim>"}, {"num": 6, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00006\" num=\"6\"><claim-text>6. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00001\">claim 1</claim-ref>,</claim-text><claim-text>wherein said flag information generating part generates a second flag information showing whether or not to perform an access to a I/O region. </claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00007\" num=\"7\"><claim-text>7. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00006\">claim 6</claim-ref>, further comprising:</claim-text><claim-text>a cache memory configured to temporarily store data to be written to or be read from said main memory, and to require consistency of data with said main memory, </claim-text><claim-text>wherein said memory management unit accesses the I/O region regardless of a cache-hit or a cache-miss for said cache memory when accessing the I/O region based on said second flag information. </claim-text></claim>"}, {"num": 8, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00008\" num=\"8\"><claim-text>8. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00006\">claim 6</claim-ref>, further comprising:</claim-text><claim-text>a store buffer configured to temporarily store data to be stored to said first memory before the data is stored to said first memory, </claim-text><claim-text>wherein when said memory management unit accesses the I/O region based on said second flag information, said load/store instruction executing part holds the valid load/store instruction for said first memory, and if data not yet being written exists in said store buffer, the access to the I/O region is temporarily stopped. </claim-text></claim>"}, {"num": 9, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00009\" num=\"9\"><claim-text>9. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00006\">claim 6</claim-ref>,</claim-text><claim-text>wherein said memory management unit includes a table generating part configured to generate a conversion table converting the first address to the second address by each page having a constant memory capacity, and </claim-text><claim-text>said flag information generating part stores said second flag information by each page to the conversion table. </claim-text></claim>"}, {"num": 10, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00010\" num=\"10\"><claim-text>10. A microprocessor comprising:</claim-text><claim-text>a memory management unit configured to convert a first address to a second address; </claim-text><claim-text>a load/store instruction executing part configured to execute a load/store instruction; </claim-text><claim-text>a main memory accessed via a bus by designating the second address; and </claim-text><claim-text>a first memory configured to be accessed only by the first address, not to be mapped on a memory map of said main memory accessed by the second address, and not to require consistency of data with said main memory; </claim-text><claim-text>wherein said memory management unit includes a flag information generating part configured to generate a first flag information showing whether or not to perform an access to said first memory, said memory management unit accessing said main memory whose addresses are allocated by using the second address and accessing said first memory by using an offset address at lower side of the first address based on said first flag information. </claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00011\" num=\"11\"><claim-text>11. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00010\">claim 10</claim-ref>, further comprising:</claim-text><claim-text>a second memory configured to temporarily store data to be written to or be read from said main memory, and to require consistency of data with said main memory. </claim-text></claim>"}, {"num": 12, "parent": 11, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00012\" num=\"12\"><claim-text>12. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00011\">claim 11</claim-ref>,</claim-text><claim-text>wherein said second memory is a cache memory. </claim-text></claim>"}, {"num": 13, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00013\" num=\"13\"><claim-text>13. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00010\">claim 10</claim-ref>,</claim-text><claim-text>wherein the first address is a virtual address, and </claim-text><claim-text>the second address is a physical address. </claim-text></claim>"}, {"num": 14, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00014\" num=\"14\"><claim-text>14. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00010\">claim 10</claim-ref>,</claim-text><claim-text>wherein said memory management unit includes a table generating part configured to generate a conversion table to convert the first address to the second address by each page having a constant memory capacity; and </claim-text><claim-text>said flag information generating part stores said first flag information corresponding to the first address to said conversion table. </claim-text></claim>"}, {"num": 15, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00015\" num=\"15\"><claim-text>15. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00010\">claim 10</claim-ref>,</claim-text><claim-text>wherein said flag information generating part generates a second flag information showing whether or not to perform an access to a I/O region. </claim-text></claim>"}, {"num": 16, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00016\" num=\"16\"><claim-text>16. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00015\">claim 15</claim-ref>, further comprising:</claim-text><claim-text>a cache memory configured to temporarily store data to be written to or be read from said main memory, and to require consistency of data with said main memory, </claim-text><claim-text>wherein said memory management unit accesses the I/O region regardless of a cache-hit or a cache-miss for said cache memory when accessing the I/O region based on said second flag information. </claim-text></claim>"}, {"num": 17, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00017\" num=\"17\"><claim-text>17. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00015\">claim 15</claim-ref>, further comprising:</claim-text><claim-text>a store buffer configured to temporarily store data to be stored to said first memory before the data is stored to said first memory, </claim-text><claim-text>wherein when said memory management unit accesses the I/O region based on said second flag information, said load/store instruction executing part holds the valid load/store instruction for said first memory, and if data not yet being written exists in said store buffer, the access to the I/O region is temporarily stopped. </claim-text></claim>"}, {"num": 18, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6412057-B1-CLM-00018\" num=\"18\"><claim-text>18. The microprocessor according to <claim-ref idref=\"US-6412057-B1-CLM-00015\">claim 15</claim-ref>,</claim-text><claim-text>wherein said memory management unit includes a table generating part configured to generate a conversion table converting the first address to the second address by each page having a constant memory capacity, and said flag information generating part stores said second flag information by each page to the conversion table.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES53586854\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>TECHNICAL FIELD</h4><p>The present invention relates to the internal configuration of a microprocessor which is able to read and write data more quickly than external memories.</p><h4>BACKGROUND</h4><p>A memory and I/O devices accessible to a processor are known as external devices. Because the memory is connected to almost all the processors, the memory is generally allocated directly to a memory map of the processors. On the other hand, because the I/O devices need a small address range, the I/O devices are typically managed by either of the following two methods.</p><p>(1) The I/O region is allocated to a specific memory space that the processor accesses with specific I/O instructions. For example, x86 processors of Intel Corp. have the I/O region other than an ordinary memory region, and the access to the I/O region is explicitly performed by in/out instruction.</p><p>(2) The I/O devices are allocated on a memory map of an ordinary main memory. For example, the processors based on a MIPS architecture access the I/O region by using the same instructions as those used for ordinary memory operations.</p><p>Recent processors have generally adopted the method (2) of the above-mentioned two methods. Because the method (2) can use the same instructions as those for ordinary access to the memory, the instruction set is simplified and programming is thus easier. However, when the processor accesses the I/O devices, it is necessary to use an accessing method which is different from that for the ordinary memory. Specifically, when the processor accesses the I/O devices, (i) the cache memory should not be used, (ii) the order of reading out from and writing into the I/O region should be assured.</p><p>Though many processors assure the order of reading out from and writing into the same address, in the case when a plurality of registers of one I/O device are allocated to a plurality of addresses, the order of reading out from and writing into the I/O region may not be assured.</p><p>As a result, a processor which performs “out-of-order” process interchanging, to interchange the order of executing instructions needs to be specifically addressed.</p><p>Furthermore, as a result of recent high-integration technique of the semiconductor and DRAM mixed technique, it is possible to accommodate a high-speed memory besides the cache memory inside the processor and to use this memory for a purpose which is different from the main memory or the cache memory.</p><p>However, if such high-speed memory is mapped to a portion of the memory space of the main memory, because the external memory and the I/O devices cannot be allocated to that mapped portion, the allocation of the memory map is restricted.</p><p>Furthermore, because the processor can access data on such kinds of the memory at high speed, if the data on such kind of the memory is registered with the cache memory, it may needlessly displace data caching causing the external memory to refill. Additionally, it requires an extra datapath to refill data from such kind of memory to the cache memory.</p><p>On the other hand, if the highs-speed memory contents are not cached, the kind of memory to be accessed, (that is, the high-speed memory or the cache memory) has to be automatically determined before such access.</p><h4>SUMMARY</h4><p>An object of the present invention is to provide a microprocessor comprising a RAM which is available for a purpose besides a cache memory, and which is able to access the RAM easily and at high speed.</p><p>In order to achieve the foregoing object, a microprocessor comprising:</p><p>a memory management unit for converting a virtual address to a physical address;</p><p>a load/store instruction executing block for executing a load/store instruction;</p><p>a RAM (Random Access Memory), from and to which said load/store instruction executing block is able to read and write data,</p><p>wherein said memory management unit includes a flag information generating block for generating a first flag information showing whether or not an access to said RAM is performed.</p><p>Because the processor according to the present invention determines by a first flag information whether or not the access to the RAM is performed, it is possible to access the RAM at high speed. That is, when accessing the memories, because it is unnecessary to refer to the result of “cache-hit” or “cache-miss”, it is possible to access the RAM without any additional delay to determine the destination of the memory access.</p><p>Furthermore, if such kind of the flag information is provided, because it is possible to access the above mentioned RAM by using the same instructions as those for the ordinary access to the memories, it is possible to simplify an instruction set and a programming model can be simplified.</p><p>Similarly, whether or not the access to an I/O region is performed is determined by a second flag information, it is therefore unnecessary to allocate a specific memory region for the I/O devices.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a block diagram showing an internal configuration of a microprocessor according to an embodiment of the present invention;</p><p>FIG. 2 is a diagram showing a portion of the internal configuration of the LSU shown in FIG. 1;</p><p>FIG. 3 is a diagram showing the connection inside the MMU;</p><p>FIG. 4 is a diagram of a typical conversion table in the JTLB;</p><p>FIG. 5 is a circuit diagram showing an example of the system assuring the end of the store instruction prior to the load/store instruction executed for the address mapped as the I/O region.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DTAILED DESCRIPTION</h4><p>A microprocessor according to an embodiment of the present invention is now described in detail with reference to the attached drawings. FIG. 1 is a block diagram showing an internal configuration of the microprocessor. The microprocessor of FIG. 1 has a BIU (Bus Interface Unit) <b>1</b> connected to an external bus B<b>1</b>, an IFU (Instruction Fetch Unit) <b>2</b> which fetches instructions executed by a processor, an MMU (Memory Management Unit) <b>3</b> which converts virtual addresses to physical addresses, an LSU (Load Store Unit) <b>4</b> which executes instructions relating to load/store, a plurality of executing units <b>5</b><i>a, </i><b>5</b><i>b </i>and <b>5</b><i>c </i>which execute instructions other than load/store, FPU (Floating Point Units) <b>6</b><i>a, </i><b>6</b><i>b </i>and <b>6</b><i>c </i>which execute floating radix point calculation, a Control Logic <b>7</b> which controls each block in the processor.</p><p>The IFU <b>2</b> includes a PC-pipe <b>21</b> which generates a PC (Program Counter) by referring to the BTAC which stores the branch address of an instruction such as a branch instruction, an ICACHE (Instruction Cache memory) <b>22</b> which temporarily stores the instructions, and an Instruction Issue &amp; Staging block <b>23</b> which recognizes the type of the instructions and selects an executing unit to execute the recognized instructions.</p><p>MMU <b>3</b> has three TLBs (Translation Lookaside Buffers) which convert the virtual addresses to physical addresses. Address converting information needed by the processor, such as a physical page number and memory protection information, is written to the TLBs. Based on this information, the MMU <b>3</b> executes the conversion to the physical address.</p><p>Three types of the TLBs in the MMU <b>3</b> are a JTLB (Joint Translation Lookaside Buffer) <b>31</b>, an ITLB (Instruction Translation Lookaside Buffer) <b>32</b>, and a DTLB (Data Translation Lookaside Buffer) <b>33</b>.</p><p>The ITLB <b>32</b> and the DTLB <b>33</b> are called a micro TLB as a generic name. The ITLB <b>32</b> is a specific TLB connected directly to a datapath of the virtual address of the instructions. The DTLB <b>33</b> is a specific TLB connected directly to datapath of the virtual address of data. These TLBs have few entries, and execute address conversion at high speed. A portion of a conversion table generated by the JTLB <b>31</b> is transferred to the ITLB <b>32</b> or the DTLB <b>33</b> as necessary.</p><p>The JTLB <b>31</b> is controlled by the software, while the coherency between micro TLBs and the JTLB is maintained by the hardware. The processor issues an exception when there is no conversion table in the JTLB <b>31</b>. An exception handler searches the corresponding page from a page table maintained by an OS (Operating System) and writes the information of the conversion table <b>100</b> into the JTLB <b>31</b>.</p><p>The LSU <b>4</b> comprises a DCACHE (Data Cache Memory) <b>41</b> which temporarily stores data read out from and written into the external memory, an SPRAM (Scratch Pad RAM) <b>42</b> used for a specific purpose other than caching, and an address generator (Virtual Address Computation) <b>43</b> which generates the virtual address necessary to access the DCACHE <b>41</b> and the SPRAM <b>42</b>.</p><p>The Control Logic <b>7</b> controls each block in the processor. Inside the Control Logic <b>7</b>, a Control Register <b>71</b> is provided.</p><p>Next, the operation of the microprocessor of FIG. 1 will be explained. First of all, the IFU <b>2</b> fetches the instructions based on the PC generated by the PC-pipe <b>21</b>. Here, the PC is a virtual address.</p><p>The ITLB <b>32</b> converts the PC from the virtual address to the physical address. The physical address is employed to search for an ITAG in the ICACHE <b>22</b>. The physical address is used to detect whether or not the instruction designated by the PC exists in the ICACHE <b>22</b>. When the instruction designated by the PC does not exist in the ICACHE <b>22</b>, that is, when a cache-miss occurs, the access to the external memory (not shown) by the physical address is performed.</p><p>When a cache-miss occurs, information informing of the occurrence of the cache-miss and physical address information of the external memory location access are delivered to a Control Logic in the BIU <b>1</b>. The BIU <b>1</b> accesses the external memory based on this information. When the access to the memory finishes, data and a signal informing of acquisition of the cache line are supplied to the IFU <b>2</b>. The IFU <b>2</b> writes the data obtained by the access to the memory into the ICACHE <b>22</b>. At the same time, among the instructions included in the refilled cache line, the instruction designated by the PC and in certain cases, several instructions following the instruction designated by the PC are supplied to the Instruction issue &amp; Staging block <b>23</b>.</p><p>On the other hand, if the instruction designated by the PC exists in the ICACHE <b>22</b>, the corresponding instructions in the ICACHE <b>22</b> and in certain cases, several instructions following the instruction designated by the PC are supplied to the Instruction Issue &amp; Staging block <b>23</b>.</p><p>The Instruction Issue &amp; Staging block <b>23</b> recognizes the type of the instructions and determines the executing unit to execute the instructions, for example, the LSU <b>4</b> or another executing unit. On this occasion, the Instruction issue &amp; staging block <b>23</b> determines any one of the executing units dynamically in accordance with a vacancy status of each executing unit.</p><p>For example, when the recognized instruction is a load/store instruction, because only the LSU <b>4</b> is able to execute the instruction, the Instruction Issue &amp; Staging block <b>23</b> sends the instruction only to the LSU <b>4</b>.</p><p>Next, the load/store operations to the SPRAM <b>42</b> will be explained. FIG. 2 is a diagram showing a portion of the internal configuration of the LSU <b>4</b> shown in FIG. <b>1</b>. In FIG. 2, the SPRAM <b>42</b> is separately shown in two parts: the control part (Control <b>8</b>) and the datapath.</p><p>The Control <b>8</b> of FIG. 2 generates a control signal which is supplied to the Datapath in accordance with the flow of instructions. The Datapath releases data in accordance with the control signal from the Control <b>8</b>.</p><p>In FIG. 2, each line connecting the Control <b>8</b> and the Datapath represents a control signal. Usually, the control signal is supplied to the Datapath from the Control <b>8</b>. There is also a control signal supplied from the Datapath to the Control <b>8</b> which is not shown in FIG. <b>2</b>. For example, when pipeline processes are stopped in accordance with the cache-miss of the ICACHE <b>22</b>, a miss signal from the TAG of the ICACHE <b>22</b>, which is a part of the Datapath, is supplied to the Control <b>8</b> in order to stop the pipeline processes.</p><p>In FIG. 2, the block designated by the reference numeral <b>10</b><i>a, </i><b>10</b><i>b, </i>. . . , <b>10</b><i>j </i>stands for register structure which separate each of stages executing the pipeline processes. These blocks <b>10</b><i>a, </i><b>10</b><i>b, </i>. . . , <b>10</b><i>j </i>include circuits with flip-flops and latches, and execute the reading and the writing processes in sync with a clock. Hereinafter, the blocks <b>10</b><i>a, </i><b>10</b><i>b, </i>. . . , <b>10</b><i>j </i>are called pipeline registers.</p><p>The IFU <b>2</b> stores the fetched instructions in the pipeline register <b>10</b> based on control of an IFU Control <b>81</b>. The instructions are sent from the pipeline register <b>10</b><i>a </i>to a Instruction Decoder <b>82</b>. The Instruction Decoder <b>82</b> generates a transitive control signal for discrimination and processing of the instructions.</p><p>When the Instruction Decoder <b>82</b> recognizes that the fetched instructions are the load/store instructions, a control signal group is sent to the relative Control Logic block. In other words, as shown in FIG. 2, the control signal group is sent to a Pipeline Control <b>83</b>, a GPR (General Purpose Register) Control <b>84</b>, and an LSU Control <b>85</b>.</p><p>In the Pipeline Control <b>83</b> and the LSU Control <b>85</b>, the instructions and the control signals flow in sync with stages of data flow, and the pipeline registers <b>10</b><i>a, </i><b>10</b><i>b, </i>. . . , <b>10</b><i>j </i>are provided for both the Control <b>8</b> and the Datapath.</p><p>The Pipeline Control <b>83</b> controls the flow of the pipeline in accordance with the internal condition of the inside of the pipeline register <b>10</b><i>a, </i><b>10</b><i>b, </i>. . . , <b>10</b><i>j. </i>For example, when a resource hazard occurs on the calculator, processes which stop the pipeline are executed.</p><p>The LSU Control <b>85</b> generates the control signal to execute the load/store instruction. That is, data sent from a register file <b>1</b> to the pipeline register <b>10</b><i>b </i>by control of the GPR Control <b>84</b> is sent to an address generator <b>43</b> in order to generate the addresses. The Address Generator <b>43</b> is controlled by the Adder Control <b>86</b>. The addresses generated by the Address Generator <b>43</b> are sent to the pipeline register <b>10</b><i>d </i>of the next stage.</p><p>An SPR (SPRAM) Control <b>87</b> accesses the SPRAM based on signals from the Pipeline Control <b>83</b> and the LSU Control <b>85</b>. At this time, the address of the pipeline register <b>10</b>d is used. When this address corresponds to a load instruction, a read enable signal is asserted, and a write enable signal is deasserted into invalidity. Accordingly, data in the SPRAM <b>42</b> is read out and stored in the pipeline register <b>10</b><i>e. </i>The stored data is written to the register file <b>11</b> at next stage.</p><p>When the address in the pipeline register <b>10</b><i>d </i>corresponds to the store instruction, the read enable signal is deasserted, and the write enable signal is asserted. Accordingly, data staged from the register file <b>11</b> is written into the SPRAM <b>42</b>.</p><p>On the other hand, a DMA (Direct Memory Access) controller <b>9</b> provided external to the processor is, as shown in FIG. 2, connected to a BIU Control <b>88</b> in the processor via an external bus. When the DMA controller <b>9</b> sends the control signal to the BIU Control <b>88</b> and then the DMA process is started, the BIU Control <b>88</b> sends a signal to the SPR Control <b>87</b> in order to execute the reading or writing operation for the SPRAM <b>42</b>. That is, the SPR Control <b>87</b> is also connected indirectly to the DMA controller <b>9</b> via the BIU Control <b>88</b>.</p><p>When access to the SPRAM is requested by both the LSU <b>4</b> and the BIU (the source of the access requirement from the BIU <b>12</b> is the DMA controller <b>9</b>), the SPR Control <b>87</b> arbitrates requirements from both in order to determine the enable signal group, and changes a selector of the inputted address and data.</p><p>For example, in order to programmably control the priority of access to the SPRAM <b>42</b> by the LSU <b>4</b> and the BIU <b>12</b>, as shown by the dotted line in FIG. 2, a control register <b>71</b> may be connected to the SPR Control, and the value of the control register <b>71</b> may be programmably changed in accordance with the priority.</p><p>The SPRAM <b>42</b> shown in FIG. <b>1</b> and FIG. 2 is valuable as a temporary memo pad region on the occasion processing a plenty of data such as image data are being processed.</p><p>FIG. 3 is a diagram showing the connection inside the MMU <b>3</b>. As mentioned above, three TLBs are provided inside the MMU <b>3</b>. Among these TLBs, the JTLB <b>31</b> is a true TLB. The JTLB <b>31</b> has, for example, 48 entries, and by mapping the virtual address by each page, generates a conversion table to convert to the physical address.</p><p>The conversion table <b>100</b> generated by the JTLB <b>31</b> is copied to the ITLB <b>32</b> and the DTLB <b>33</b>. It takes much time to perform the conversion process, because the JTLB <b>31</b> has many entries. Accordingly, only the portion which is necessary to generate in the conversion table <b>100</b> is copied to the ITLB <b>32</b> or the DTLB <b>33</b> in order to perform the conversion process at high speed.</p><p>FIG. 4 is a diagram of a typical conversion table <b>100</b> in the JTLB <b>31</b>. In the conversion table <b>100</b>, the page number of the virtual address, the corresponding physical address, and a flag information correspond to each other.</p><p>The flag information includes a C flag showing whether or not the cache is allowable, a D flag showing whether writing to the memory is allowable, a V flag showing whether the conversion entry is valid, and a S flag (a first flag information) showing whether or not the access to SPRAM is performed.</p><p>If the S flag is set, the LSU <b>4</b> absolutely accesses the SPRAM <b>42</b>. Specifically, by using an offset address at lower side of the virtual address, the access to the SPRAM <b>42</b> is performed. Therefore, it is unnecessary to allocate the SPRAM <b>42</b> on the memory map of the main memory; accordingly, the allocation of the memory is simplified.</p><p>When the S flag is set, the result of the cache-hit and the cache-miss is ignored, and the access to the SPRAM is performed. Therefore, because it is possible to access the SPRAM <b>42</b> without confirming if the caching hits or misses, it is possible to read out from and write into the SPRAM <b>42</b> at high speed.</p><p>In the above mentioned embodiment, an example having four types of flags has been explained, and the types and the number of the flags are not limited. For example, the flag for the access to the I/O region may be provided. Hereinafter, this flag is tentatively called an I/O flag (a second flag information).</p><p>When access to the I/O region is performed, it is desirable to inhibit the use of the cache memory and to assure the order of reading out from and writing into the memory.</p><p>FIG. 5 is a circuit diagram showing an example of the system assuring the end of the store instruction prior to the load/store instruction being executed for the address mapped as the I/O region. The store buffer <b>80</b> of FIG. 5 is used to temporarily store all of the writing data.</p><p>When the C flag is set and the I/O flag is not set, the high level signal (Cached signal) permitting the use of the ICACHE <b>22</b> or the DCACHE <b>41</b> is supplied to an LSU Control <b>85</b>.</p><p>Furthermore, when the I/O flag is set, data not written yet exists in the store buffer <b>80</b>, and the valid load/store instruction exists in the LSU <b>4</b>, a high-level signal (Stall-Request signal) to stall the load/store instruction for the access of the I/O region is supplied to a pipeline control logic <b>83</b>.</p><p>By providing a circuit such as FIG. 5, even if the order of executing the load/store instruction in a system is not assured, by adding a minimal circuit, it is possible to assure the end of the precedent store instruction prior to the access to the I/O region.</p><p>Thus, by providing the I/O flag, it becomes unnecessary to allocate the I/O region to the memory map of the main memory. Furthermore, if the I/O flag is set, because it is possible to forcibly invalidate the cache and to assure the order of the writing to the memory, it is possible to access the I/O region easily and quickly.</p><p>Though an example of the SPRAM which is able to perform the DMA transfer has been explained, the DMA transfer is not always inevitable for the above mentioned SPRAM. For example, the SPRAM not performing the DMA transfer is used as a temporary depository of data generated continuously by the processor.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Masashi", "last_name": "Sasahara", "name": ""}, {"first_name": "Rakesh", "last_name": "Agarwal", "name": ""}, {"first_name": "Kamran", "last_name": "Malik", "name": ""}, {"first_name": "Michael", "last_name": "Raam", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "KABUSHIKI KAISHA TOSHIBA"}, {"first_name": "", "last_name": "KABUSHIKI KAISHA TOSHIBA", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  12/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  12/10        20060101A I20051008RMJP"}, {"label": "G06F  12/08        20060101AFI20051220RMJP"}, {"label": "G06F  15/78        20060101ALI20051220RMJP"}, {"label": "G06F  13/28        20060101ALI20051220RMJP"}], "national_classes": [{"primary": true, "label": "711202"}, {"primary": false, "label": "711E12063"}, {"primary": false, "label": "711E12058"}], "ecla_classes": [{"label": "G06F  12/10"}, {"label": "G06F  12/10L4P"}], "cpc_classes": [{"label": "G06F  12/1054"}, {"label": "G06F  12/10"}, {"label": "G06F  12/10"}, {"label": "G06F  12/1054"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1999-02-08", "application_date": "1999-02-08", "family_members": [{"ucid": "JP-2000231549-A", "titles": [{"lang": "JA", "text": "マイクロプロセッサ"}, {"lang": "EN", "text": "MICROPROCESSOR"}]}, {"ucid": "US-6412057-B1", "titles": [{"lang": "EN", "text": "Microprocessor with virtual-to-physical address translation using flags"}]}, {"ucid": "JP-4162825-B2", "titles": [{"lang": "JA", "text": "マイクロプロセッサ"}, {"lang": "EN", "text": "Microprocessor"}]}]}