{"patent_number": "US-6205518-B1", "publication_id": 72604311, "family_id": 22441340, "publication_date": "2001-03-20", "titles": [{"lang": "EN", "text": "Apparatus and method for reducing power consumption in a data processor executing an application code"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA72527376\"><p>Apparatus and methods are described for reducing power consumption in a processor. The processor includes a source of microcode instructions, a microcode instruction decode circuit, control register latches and a clock gate control circuit that is coupled to the source of microcode instructions. The clock gate control circuit searches and picks groups of clock gate control signals for the latches that are the same value (state) as control signals form a previous cycle. The clock gate control circuit includes a table, a table lookup circuit, a storage circuit, a compare circuit and a latch prevent circuit</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6205518-B1-CLM-00001\" num=\"1\"><claim-text>1. A processor comprising:</claim-text><claim-text>a microcode decode unit for receiving and decoding cycles of microinstructions consisting of a plurality of binary bits, and generating decode data consisting of a plurality of binary bits in response thereto; </claim-text><claim-text>a plurality of latches coupled to the decode unit for receiving the decode data wherein said latches are set in accordance with the binary bits of the decode data; </claim-text><claim-text>a clock gate control unit receiving said microinstructions simultaneously with the decode unit and coupled to the latches for controllably clocking selected ones of the latches, the control unit including: </claim-text><claim-text>a table identifying a group of said plurality of binary bits of each of said received microinstructions that have a portion of their control bits set identically to corresponding portions of others of said group of binary bits of said received microinstructions; </claim-text><claim-text>table lookup means for determining whether the binary bits of a received microinstruction is a member of said group of microinstructions that have a portion of their control bits identically set, including means for setting a membership bit of said group to “true” if the membership bit of the received microinstruction is a member of said group; </claim-text><claim-text>storage means for storing a membership bit corresponding to a previously received microinstruction; </claim-text><claim-text>compare means for comparing a membership bit corresponding to the received microinstruction with the membership bit corresponding to a previously received microinstruction; and </claim-text><claim-text>means for preventing clocking corresponding ones of the plurality of latches in response to a pair of “true” membership bits matching in the compare means. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6205518-B1-CLM-00002\" num=\"2\"><claim-text>2. A processor according to claim <b>1</b> wherein the table lookup means decodes the received microinstruction entry point to an entry point dedicated to the microinstruction, and a bit is set for every group of registers that can be clocked gate for the current cycle settings,</claim-text><claim-text>and wherein the compare means compares the previous cycle latch values to the current value. </claim-text></claim>"}, {"num": 3, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6205518-B1-CLM-00003\" num=\"3\"><claim-text>3. A method for controlling clock gate signals in a microcode instruction signal processor comprising the steps of:</claim-text><claim-text>step 1) receiving and decoding cycles of microinstructions consisting of a plurality of binary bits, and generating decode data in response thereto; </claim-text><claim-text>step 2) simultaneously receiving the decode data and the microinstructions for controllably clocking latches in response thereto; </claim-text><claim-text>step 3) identifying a group of said plurality of binary bits of each of said received microinstructions that have a portion of their control bits set identically to corresponding portions of others of the group of microinstructions; </claim-text><claim-text>step 4) determining in a table lookup device whether the binary bits of a received microinstruction is a member of the group of microinstructions that have a portion of their control bits identically set, including the step of for setting a membership bit to “true” if the binary membership bits of the received microinstruction is a member of the group; </claim-text><claim-text>step 5) storing a membership bit corresponding to a previously received microinstruction; </claim-text><claim-text>step 6) comparing a membership bit corresponding to the received microinstruction with the membership bit corresponding to a previously received microinstruction; and </claim-text><claim-text>step 7) preventing the clocking of corresponding ones of the plurality of the latches in response to the matching of a pair of “true” membership bits. </claim-text></claim>"}, {"num": 4, "parent": 3, "type": "dependent", "paragraph_markup": "<claim id=\"US-6205518-B1-CLM-00004\" num=\"4\"><claim-text>4. A method according to claim <b>3</b> wherein step <b>7</b> includes the step of creating a master table lookup unit.</claim-text></claim>"}, {"num": 5, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6205518-B1-CLM-00005\" num=\"5\"><claim-text>5. A method for controlling clock gate signals in a microcode instruction signal processor comprising the steps of:</claim-text><claim-text>step 1) searching the microcode for a microcode instruction of a given operating cycle wherein the microcode instruction consists of a plurality of binary bits greater than N; </claim-text><claim-text>step 2) selecting N bits of the microcode instruction; </claim-text><claim-text>step 3) searching a table lookup device containing a stored microcode instruction from a previous operating cycle to look for a match on the N selected bits with the plurality of bits of the microcode instruction of the previous cycle; </claim-text><claim-text>step 4) designating and storing temporary control bits for all matches found in step <b>3</b>; </claim-text><claim-text>step 5) comparing the matches with a percentage value in a compare device to determine if the percentage of the matches is above a selected predetermined level.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES54513362\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>The present invention relates to apparatus and methods for reducing power consumption in a processor, and more particularly to circuits for reducing power consumption while a processor is executing an application code.</p><p>2. Background Art</p><p>Power management for processors is a significant consideration, particularly for portable computers where a battery provides the power. Techniques for conserving battery charge by low power operation generally involves power minimizing AC power consumption and standby power consumption. The primary method of driving the AC power has been through the use of low power circuits and technology permitting lower values of VDD. U.S. Pat. No. 4,615,005 issued Sep. 30, 1986 to Maejima et al. entitled DATA PROCESSING APPARATUS WITH CLOCK SIGNAL CONTROL BY MICROINSTRUCTION FOR REDUCED POWER CONSUMPTION AND METHOD THEREFOR discloses a method of controlling the supply of a clock signal to a logic circuit composed of CMOS gates for further reducing the power consumption by using a clock signal supply inhibit instruction.</p><p>U.S. Pat. No. 5,220,672 issued Jun. 15, 1993 to Nakao et al. entitled LOW POWER CONSUMING DIGITAL CIRCUIT DEVICE discloses a method for decreasing the power consumption of a digital circuit by interrupting the switching created by clock pulses and maintaining the system in a quiescent state.</p><p>U.S. Pat. No. 5,428,790 issued Jun. 27, 1995 to Harper et al. entitled COMPUTER POWER MANAGEMENT SYSTEM discloses a system for low power management for a portable computer that powers down various sections of the computer when they are not used.</p><p>U.S. Pat. No. 5,557,557 issued Sep. 17, 1996 to Frantz et al. entitled PROCESSOR POWER PROFILER discloses a method for determining the energy consumption of a processor when executing a program.</p><p>U.S. Pat. No. 5,560,024 issued Sep. 24, 1996 to Harper et al. entitled COMPUTER POWER MANAGEMENT SYSTEM discloses a system for low power management for a portable computer that powers down various sections of the computer when they are not used.</p><p>U.S. Pat. No. 5,598,566 issued Jan. 28, 1997 to Pascucci et al. entitled NETWORKED FACILITIES MANAGEMENT SYSTEM HAVING A NODE CONFIGURED WITH DISTRIBUTED LOAD MANAGEMENT SOFTWARE TO MANIPULATE LOADS CONTROLLED BY OTHER NODES discloses a networked system applicable for facilities management that limits energy consumption using stored restoration characteristics of loads controlled by nodes.</p><p>U.S. Pat. No. 5,623,677 issued Apr. 22, 1996 to Townsley et al. entitled APPARATUS AND METHOD FOR REDUCING POWER CONSUMPTION A COMPUTER SYSTEM discloses a method and apparatus for reducing power consumption in a computer system where a program is used to determine when the processor is in an inactive state to cause clocking signals and the power supply to be disabled.</p><h4>SUMMARY OF THE INVENTION</h4><p>An object of the present invention is to provide a power reduction means for a processor including a microcode decoder unit for receiving and decoding microinstructions and generating decode data in response to the microinstructions.</p><p>Another object of the present invention is to provide a power reduction means for a processor including a microcode decode unit for generating decode data and a plurality of latches for receiving the decode data.</p><p>Still another object of the present invention is to provide a processor further including a clock gate control unit for receiving microinstructions simultaneously with a decode unit and coupled to a plurality of latches for controllably clocking the latches.</p><p>A still further object of the present invention is to provide a power reduction means for a processor to reduce power while the processor is executing application code.</p><p>Other features, advantages and benefits of the present invention will become apparent in the following description taken in conjunction with the following drawings. It is to be understood that the foregoing general description and the following detailed description are exemplary and explanatory but are not to be restrictive of the invention. The accompanying drawings which are incorporated in and constitute a part of this invention and, together with the description, serve to explain the principles of the invention in general terms. Like numerals refer to like parts throughout the disclosure.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a schematic block diagram of an embodiment of a processor as known in the prior art including a source of microcode instructions, a microcode instruction decode means, and a latch means.</p><p>FIG. 2 is a schematic block diagram of an embodiment of a processor according to the present invention including a source of microcode instructions, a microcode instruction decode means, a latch means, and further including a clock gate control unit.</p><p>FIG. 3 is a schematic illustration of a flow chart of the method employed in the present invention.</p><p>FIG. 4 is an example of the operation of the present invention for a typical opcode.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE INVENTION</h4><p>Referring to FIG. 1, an embodiment of a microcode decode processor as known in the prior art is shown including a source of microinstructions <b>10</b> that provides input instructions occurring in cycles, each instruction including bits of microcode. A microcode decode unit <b>12</b> is coupled to the source of microinstructions and decodes the instruction for each input cycle. Decode means <b>12</b> decodes the microinstructions and provides data to the system control registers. The output signals from decode means <b>12</b> sets all the latches of the system control registers for each cycle of microinstructions from source of microinstructions <b>10</b>.</p><p>Latch means <b>14</b> is coupled to decode means <b>12</b> and contains a plurality of latches that are clocked and set for each cycle in accordance with the decoded instruction.</p><p>The decode processor is a pseudo microcode processor, that is, for every cycle the microcode generates a set value for the latches. These values will then propagate through the system. In the prior art, the latches are set for the bits of each cycle of decoded instructions irrespective of the settings of the previous instruction. Because the values for the latch settings are random and can not be predicted, instructions in a cycle will be provided for particular settings of many latches, which latches may have been set in the same settings in the previous cycle. Thus the settings of the particular latches are not necessary and cause a reduction of battery power, especially in processor designs requiring many control latches.</p><p>Referring to FIG. 2, an embodiment of a processor according to the present invention is shown including the source of microinstructions <b>10</b>, the microcode decode means <b>12</b> and the latch means <b>14</b> as described for FIG. 1, as well as a clock gate control means <b>16</b> that is coupled to source of microinstructions <b>10</b>.</p><p>The function of clock gate control means <b>16</b> is to search and pick groups of clock gate control signals for latches that are the same value (state) as control signals from a previous cycle. Clock gate control means <b>16</b> includes a table <b>16</b>−<b>2</b>, a table lookup means <b>16</b>−<b>4</b>, a storage means <b>16</b>−<b>6</b>, a compare means <b>16</b>−<b>8</b> and a latch prevent means <b>16</b>−<b>10</b>.</p><p>Clock gate control means <b>16</b> receives the microinstructions from source <b>10</b> simultaneously with decode means <b>12</b> and has its output coupled to latch means <b>14</b> for controllably clocking the latches such that setting instructions are not sent to latches that have been placed in the same setting during the previous cycle of microinstructions.</p><p>Clock gate control means <b>16</b> includes a storage device containing a table <b>16</b>−<b>2</b> for storing and identifying a group of microinstructions that have a portion of their control bits set identically to corresponding portions of others of the group of microinstructions.</p><p>A table lookup means <b>16</b>−<b>4</b> is connected to table <b>16</b>−<b>2</b> for determining whether a microinstruction received from source of microinstructions <b>10</b> is a member of the group of microinstructions that have a portion of their control bits identically set to corresponding portions of others of the group of microinstructions. Table lookup means <b>16</b>−<b>4</b> includes means for setting a membership bit to “true” if the received micro instruction is a member of the group.</p><p>Clock control gate means <b>16</b> further includes a storage means <b>16</b>-<b>6</b> for storing a membership bit corresponding to a previously received microinstruction from a previous cycle, a compare means <b>16</b>−<b>8</b> for comparing a membership bit corresponding to the received microinstruction with the membership bit corresponding to a previously received microinstruction, and a latch prevent means <b>16</b>−<b>10</b> connected to the latches in latch means <b>14</b> for providing a signal for preventing the clocking of those latches related to pairs of “true” membership bits that matched in the compare means <b>16</b>−<b>8</b>.</p><p>Referring to FIG. 3, a flow chart is shown that describes the method of clock gate signal control according to the present invention.</p><p>In the first step of block <b>20</b>, a search is performed of the microcode for each instruction. In the second step of block <b>22</b> a number “N” such as 16 signals are picked or selected and in the third step of block <b>24</b> all the microcodes are searched in the table lookup means to see if they are at the same value as the N signals selected in step <b>22</b>. In the fourth step of block <b>26</b> temporary control bits are marked or designated for all the microcode matches.</p><p>In the fifth step of block <b>28</b> the microcode matches are saved in the storage means and then in the sixth step of block <b>30</b> a compare is performed in the compare means and the percentage of the matches are found to determined if the percentage of the matches is above an accepted level. Finally, in the seventh step of block <b>32</b> the lookup table is created with all of the microinstructions and their corresponding group settings.</p><p>Referring to FIG. 4, an example is illustrated describing the present invention wherein an add<b>1</b> opcode is dispatched as a microinstruction . The table lookup means decodes the opcode entry point to an entry point dedicated to the add instruction. A bit is set for every group of registers that can be clocked gate via this mechanism. For the add<b>1</b> opcode, the corresponding current <b>1</b>-N current cycle settings are set by the table lookup means. The previous cycle latched versions are then compared to the current value. If the signals match, then the group of latches are the same value from the previous cycle and the group of latches can be clocked gate.</p><p>What has been described is an improved processor wherein, for each cycle of microinstructions input a comparison is performed in a clock gate control unit to determine whether a portion of the control bits of the input instructions have states that match with a portion the control bits of previously received microinstructions. When such matches are determined, the latches of the system control registers are prevented from clocking because they are already in the desired state. Thus there is a considerable power saving gained by not clocking the latches in the registers.</p><p>While the invention has been described in connection with a preferred embodiment, it is not intended to limit the scope of the invention to the particular form set forth, but on the contrary, it is intended to cover such alternatives, modifications and equivalence as may be included within the spirit and scope of the invention as defined in the appended claims.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "William P.", "last_name": "Moore", "name": ""}, {"first_name": "Sebastian T.", "last_name": "Ventrone", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "INTERNATIONAL BUSINESS MACHINES CORPORATION"}, {"first_name": "", "last_name": "INTERNATIONAL BUSINESS MACHINES CORPORATION", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  13/16"}, {"primary": false, "label": "G06F   1/04"}, {"primary": false, "label": "G06F   9/30"}, {"primary": false, "label": "G06F  13/14"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F   1/32        20060101A I20051008RMEP"}, {"label": "G06F   9/22        20060101A I20051008RMEP"}, {"label": "G06F   9/30        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "711118"}, {"primary": false, "label": "712E09005"}, {"primary": false, "label": "710260"}, {"primary": false, "label": "713500"}, {"primary": false, "label": "712213"}, {"primary": false, "label": "712E09028"}], "ecla_classes": [{"label": "G06F   9/30T3"}, {"label": "G06F   1/32P5M"}, {"label": "Y02B60:12J4"}, {"label": "G06F   9/22D"}, {"label": "G06F   1/32P"}, {"label": "G06F   9/30T"}], "cpc_classes": [{"label": "G06F   1/3203"}, {"label": "G06F   9/30145"}, {"label": "G06F   9/223"}, {"label": "G06F   9/30145"}, {"label": "G06F   9/30156"}, {"label": "G06F   9/30156"}, {"label": "G06F   1/3203"}, {"label": "Y02D  10/00"}, {"label": "G06F   9/223"}, {"label": "G06F   1/3243"}, {"label": "G06F   1/3243"}, {"label": "Y02D  10/00"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1998-08-05", "application_date": "1998-08-05", "family_members": [{"ucid": "US-6205518-B1", "titles": [{"lang": "EN", "text": "Apparatus and method for reducing power consumption in a data processor executing an application code"}]}]}