{"patent_number": "US-6389527-B1", "publication_id": 73014120, "family_id": 22930538, "publication_date": "2002-05-14", "titles": [{"lang": "EN", "text": "Microprocessor allowing simultaneous instruction execution and DMA transfer"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA50315656\"><p>The present invention comprises a LSU which executes instructions relating to load/store. The LSU includes a DCACHE which temporarily stores data read from and written to the external memory, an SPRAM used to specific purposes other than cache, and an address generator generating virtual addresses for access to the DCACHE and the SPRAM. Because the SPRAM can load and store data by a pipeline of the LSU and exchanges data with an external memory through a DMA transfer, the present invention is especially available to high-speedily process a large amount of data such as the image data. Because the LSU can access the SPRAM with the same latency as that of the DCACHE, after data being stored in the external memory is transferred to the SPRAM, the processor can access the SPRAM in order to perform data process, and it is possible to process a large amount of data with shorter time than time necessary to directly access an external memory.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00001\" num=\"1\"><claim-text>1. A microprocessor comprising:</claim-text><claim-text>a load/store instruction executing block for executing a load/store instruction; </claim-text><claim-text>a RAM (Random Access Memory), from and to which said load/store instruction executing block is able to read and write data, said RAM exchanging data with an external memory through a DMA (Direct Memory Access) transfer, said RAM including at least a first and second data storing areas; and </claim-text><claim-text>a RAM control block for controlling said RAM so that the DMA read/write transfer of data between said second data storing area and said external memory is executed subtantially at the same time as access to said first data storing area by said load/store instruction executing block, and the DMA transfer of data between said first data storing area and said external memory is executed substantially at the same time as access to said second data storing area by said load/store instruction executing block. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00002\" num=\"2\"><claim-text>2. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, wherein when an access to said RAM by said load/store instruction executing block conflicts with the DMA transfer from/to said RAM, said RAM control block gives a priority to the DMA transfer.</claim-text></claim>"}, {"num": 3, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00003\" num=\"3\"><claim-text>3. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>a control register which is capable of controlling a priority of the access to said RAM by said load/store instruction executing block over the access to said RAM through the DMA transfer. </claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00004\" num=\"4\"><claim-text>4. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>an external pin which is capable of controlling a priority of the access to said RAM by said load/store instruction executing block over the access to said RAM through the DMA transfer. </claim-text></claim>"}, {"num": 5, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00005\" num=\"5\"><claim-text>5. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>a store buffer for temporarily storing data relating to the access to said RAM by said load/store instruction executing block before the access is performed. </claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00006\" num=\"6\"><claim-text>6. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00005\">claim 5</claim-ref>, further comprising:</claim-text><claim-text>the RAM control block giving a priority to the access to said RAM through the DMA transfer when the access to said RAM by said load/store instruction executing block conflicts with the access through the DMA transfer, and temporarily storing to said store buffer data relating to the access to said RAM by said load/store instruction executing block. </claim-text></claim>"}, {"num": 7, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00007\" num=\"7\"><claim-text>7. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, wherein specific instructions for an access to said RAM are provided.</claim-text></claim>"}, {"num": 8, "parent": 7, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00008\" num=\"8\"><claim-text>8. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00007\">claim 7</claim-ref>, wherein at least an instruction to directly read from or write into said RAM or an instruction to perform a block DMA transfer between said RAM and said external memory is included in said specific instructions.</claim-text></claim>"}, {"num": 9, "parent": 7, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00009\" num=\"9\"><claim-text>9. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00007\">claim 7</claim-ref>, wherein when said specific instructions are given, said load/store instruction executing block executes said specific instructions, ignoring designation of a memory management unit.</claim-text></claim>"}, {"num": 10, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00010\" num=\"10\"><claim-text>10. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>a cache memory for temporarily storing data read out from said external memory, </claim-text><claim-text>wherein said load/store instruction executing block accesses said RAM and said cache memory with substantially equal latency. </claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00011\" num=\"11\"><claim-text>11. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00010\">claim 10</claim-ref>, further comprising:</claim-text><claim-text>a store buffer for temporarily storing data relating to the access to said RAM or said cache memory by said load/store instruction executing block before the access is performed, </claim-text><claim-text>wherein said data stored in said store buffer are transferred through a selection to either said RAM or said cache memory. </claim-text></claim>"}, {"num": 12, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00012\" num=\"12\"><claim-text>12. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00010\">claim 10</claim-ref>, further comprising:</claim-text><claim-text>a first store buffer for temporarily storing data relating to the access to said RAM by said load/store instruction executing block before the access is performed; and </claim-text><claim-text>a second store buffer for temporarily storing data relating to the access to said cache memory by said load/store instruction executing block before the access is performed. </claim-text></claim>"}, {"num": 13, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00013\" num=\"13\"><claim-text>13. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, further comprising:</claim-text><claim-text>an address register for storing an address corresponding to the data stored in said RAM; and </claim-text><claim-text>a comparator for comparing the address stored in said address register with a target address of a snoop, wherein said RAM operates in accordance with the comparative result of said comparator. </claim-text></claim>"}, {"num": 14, "parent": 13, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00014\" num=\"14\"><claim-text>14. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00013\">claim 13</claim-ref>, wherein the address stored in said address register coincides with the target address of the snoop, data of said RAM corresponding to the coincident address is transferred to an agent which has required the snoop.</claim-text></claim>"}, {"num": 15, "parent": 14, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00015\" num=\"15\"><claim-text>15. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00014\">claim 14</claim-ref>, wherein said address register includes flag information indicating whether or not said load/store instruction executing block is accessing said RAM, and if said flag information indicates that said load/store instruction executing block is accessing said RAM, further access of said agent which has required said snoop is temporarily inhibited.</claim-text></claim>"}, {"num": 16, "parent": 13, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00016\" num=\"16\"><claim-text>16. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00013\">claim 13</claim-ref>, wherein an instruction for setting the addresses to said address register is provided.</claim-text></claim>"}, {"num": 17, "parent": 13, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00017\" num=\"17\"><claim-text>17. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00013\">claim 13</claim-ref>, wherein addresses of the data transferred by the DMA transfer are set in said address register.</claim-text></claim>"}, {"num": 18, "parent": 14, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00018\" num=\"18\"><claim-text>18. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00014\">claim 14</claim-ref>, wherein said address register includes flag information indicating whether or not said RAM accepts the snoop, and if said flag information indicates that said RAM does not accept said snoop, further access of said agent which has required said snoop is temporarily inhibited.</claim-text></claim>"}, {"num": 19, "parent": 18, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00019\" num=\"19\"><claim-text>19. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00018\">claim 18</claim-ref>, wherein an instruction for setting said flag is provided.</claim-text></claim>"}, {"num": 20, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6389527-B1-CLM-00020\" num=\"20\"><claim-text>20. The microprocessor according to <claim-ref idref=\"US-6389527-B1-CLM-00001\">claim 1</claim-ref>, wherein said RAM is a cache memory for temporarily storing image data.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES53562390\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>TECHNICAL FIELD</h4><p>The present invention relates to the internal configuration of a microprocessor, that can read and write data more quickly than external memories.</p><h4>BACKGROUND</h4><p>Because of advances in processor speed, the speed difference between processor and a main memory has increased. In order to minimize the effect of the speed difference, a high-speed cache memory with small memory capacity may be arranged between the processor and the main memory, If data required by the processor exists in the cache memory, data read out from the cache memory is delivered to the processors. Therefore, the main memory is accessed less frequently, and the processor can perform processes at higher speeds.</p><p>However, when the capacity of the cache memory is large, it takes a long time to determine whether particular data exists in the cache memory and to read or write data from the large memory array; accordingly, performance of the memory access deteriorates. Therefore, it is inefficient to enlarge the memory capacity so much. Furthermore, in order to process a large amount of data using the cache memory, it is necessary to frequently refill the cache memory; accordingly, performance penalty of cache miss is not negligible.</p><p>Furthermore, when accessing frequency for the same address in the cache memory is high, the cache hit rate is improved; as a result, it is possible to execute the processes at high speed. On the other hand, when the accessing frequency for the same memory address is low, the cache miss rate becomes high; as a result, performance of the memory access deteriorates.</p><p>For example, to display a moving image in three dimensions, it is necessary to transmit the image data between the memory and the processor at high speed. Accordingly, it is desirable to store the image data in the memory accessible with almost the same speed as that of the cache memory. However, because the amount of the image data is high and the accessing frequency for the same memory address is low, it is not desirable to store the image data in the cache memory.</p><h4>SUMMARY</h4><p>An object of the present invention is to provide a microprocessor being able to read and write data with almost the same latency as that of the cache memory and including a RAM available for purpose which is different from the cache memory.</p><p>In order to achieve the foregoing object, a microprocessor comprising:</p><p>a load/store instruction executing block for executing a load/store instruction; and</p><p>a RAM (Random Access Memory), from and to which said load/store instruction executing block is able to read and write data, said RAM exchanging data with an external memory through a DMA (Direct Memory Access) transfer</p><p>Because a RAM according to the present invention is able to read and write data from and to a load/store unit and to exchange data with an external memory through a DMA, the RAM is available as a temporary work area to process a large amount of data, such as image data.</p><p>Furthermore, when a processor having an instruction set is emulated, the RAM according to the present invention is available as the temporary work area which reads the emulated instruction set, converts to a native instruction set, and fabricates the native instruction set. The code in the native instruction set which is generated in the RAM may be edited in the RAM for the purpose of performance improvement, for example, reorder instructions to solve read after write hazard on general purpose registers.</p><p>Furthermore, if a store buffer is provided, even if an access to the RAM by the load/store instruction unit conflicts with an access to the RAM by a DMA transfer, a pipeline stall does not occur.</p><p>Furthermore, if the RAM has a snoop function, it is possible to take out data being stored in the memory as necessary, and the program design is simplified.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a block diagram showing an internal configuration of a microprocessor of a first embodiment according to the present invention;</p><p>FIG. 2 is a diagram showing a portion of the internal configuration of the LSU <b>4</b> shown in FIG. 1;</p><p>FIGS. 3A, <b>3</b>B and <b>3</b>C are a mimetic diagram showing an example using the SPRAM to the converting process of the imaging data and the instructions;</p><p>FIG. 4 is a circuit diagram of the periphery of the SPRAM;</p><p>FIG. 5 is a circuit diagram of the periphery of the SPRAM in the processor having the SPRAM and the DCACHE;</p><p>FIG. 6 is a timing chart showing the process in the situation where the access by each executing unit in the processor conflicts with the DMA;</p><p>FIG. 7 is a diagram showing that the stall is avoided by providing a SSB;</p><p>FIG. 8 is a diagram showing an example wherein both the SPRAM and the DCACHE include a common store buffer;</p><p>FIG. 9 is a diagram showing an example providing the specific SSB for the SPRAM and the specific store buffer for the DCACHE;</p><p>FIG. 10 is a timing chart where the access by the executing unit conflicts with the DMA transfer;</p><p>FIG. 11 is a timing chart showing write timing of the SPRAM;</p><p>FIG. 12 is a timing chart showing read timing of the SPRAM;</p><p>FIG. 13 is a peripheral circuit of the SPRAM <b>42</b> having the snoop function.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><p>A microprocessor according to the present invention is described in detail with reference to the attached drawings as follows.</p><p>FIG. 1 is a block diagram showing the internal configuration of the microprocessor according to the present invention. The microprocessor of FIG. 1 has a Bus Interface Unit <b>1</b> connected to an external bus B<b>1</b>, an IFU (Instruction Fetch Unit) <b>2</b> which fetches instructions executed by a processor, an MMU (Memory Management Unit) <b>3</b> which converts virtual addresses to physical addresses, an LSU (Load Store Unit) <b>4</b> which executes instructions relating to load/store, a plurality of executing units <b>5</b><i>a</i>, <b>5</b><i>b </i>and <b>5</b><i>c </i>which execute instructions other than load/store, FPU (Floating Point Units) <b>6</b><i>a</i>, <b>6</b><i>b </i>and <b>6</b><i>c </i>which execute floating radix point calculation, and a Control Logic <b>7</b> which controls each block in the processor.</p><p>The IFU <b>2</b> includes a PC-pipe <b>21</b> which generates a PC (Program Counter) by referring to the BTAC which stores the branch address of the instruction such as a branch instruction, an ICACHE (Instruction Cache memory) <b>22</b> which temporarily stores the instructions, and an Instruction issue &amp; Staging block <b>23</b> which recognizes the type of the instructions and selects an executing unit to execute the recognized instructions.</p><p>MMU <b>3</b> has three TLBs (Translation Lookaside Buffers) which convert the virtual addresses to physical addresses. Address converting information needed by the processor, such as a physical page number and memory protection information, is written to the TLBs. Based on this information, the MMU <b>3</b> executes the conversion to the physical address.</p><p>Three types of the TLBs in the MMU <b>3</b> are a JTLB (Joint Translation Lookaside Buffer) <b>31</b>, an ITLB (Instruction Translation Lookaside Buffer) <b>32</b>, and a DTLB (Data Translation Lookaside Buffer) <b>33</b>.</p><p>Among these three TLBs, the JTLB <b>31</b> is a true TLB. For example, the JTLB <b>31</b> has: 48 entries, and maps the virtual addresses at each page, regardless of the instruction or data.</p><p>On the other hand, the ITLB <b>32</b> and the DTLB <b>33</b> are each called a micro TLB as a generic name. The ITLB <b>32</b> is a specific TLB connected directly to a datapath of the virtual address of the instructions. The DTLB <b>33</b> is a specific TLB connected directly to datapath of the virtual address of data. These TLBs have few entries, and execute address conversion at high speed. A portion of a conversion table generated by the JTLB <b>31</b> is transferred to the ITLB <b>32</b> or the DTLB <b>33</b> as necessary.</p><p>The JTLB <b>31</b> is controlled by the software, while the coherency between the micro TLBs and the JTLB is maintained by the hardware. The processor issues an exception when there is no conversion table in the JTLB <b>31</b>. An exception handler searches the corresponding page from a page table of an OS and writes the information of the conversion table <b>100</b> into the JTLB <b>31</b>.</p><p>The LSU <b>4</b> has a DCACHE (Data Cache Memory) <b>41</b> which temporarily stores data read out from and written into the external memory, an SPRAM (Scratch Pad RAM) <b>42</b> used for a specific purpose other than caching, and an address generator (Virtual Address Computation) <b>43</b> which generates the virtual address necessary to access the DCACHE <b>41</b> and the SPRAM <b>42</b>.</p><p>The Control Logic <b>7</b> controls each block in the processor. Inside the Control Logic <b>7</b>, a Control Register <b>71</b> is provided.</p><p>Next, the operation of the microprocessor of FIG. 1 is explained. First of all, the IFU <b>2</b> fetches the instructions based on the PC generated by the PC-pipe <b>2</b>. Here, the PC is a virtual address.</p><p>The ITLB <b>32</b> converts the PC from the virtual address to the physical address. The physical address is employed to search for an ITAG in the ICACHE <b>22</b>. The physical address is used to detect whether the instruction designated by the PC exists in the ICACHE <b>22</b>. When the instruction designated by the PC does not exist in the ICACHE <b>22</b>, that is, when a cache-miss occurs, the access to the external memory (not shown) by the physical address is performed.</p><p>When a cache-miss occurs, information informing of the occurrence of the cache-miss and physical address this information are delivered to a Control Logic in the BIU <b>1</b>. The BIU <b>1</b> accesses the external memory based on these information. When the access to the memory finishes, data and a signal informing of acquisition of the cache line are supplied to the IFU <b>2</b>. The IFU <b>2</b> writes the data obtained by the access to the memory into the ICACHE <b>22</b>. At the same time, among the instructions included in the refilled cache line, the instruction designated by the PC and in certain cases, several instructions following the instruction designated by the PC are supplied to the Instruction issue &amp; Staging block <b>23</b>.</p><p>On the other hand, if the instructions designated by the PC exists in the ICACHE <b>22</b>, the corresponding instructions in the ICACHE <b>22</b> and in certain cases, several instructions following the instructions designated by the PC are supplied to the Instruction issue &amp; Staging block <b>23</b>.</p><p>The Instruction issue &amp; Staging block <b>23</b> recognizes the type of the instructions and determines the executing unit to execute the instructions, for example, the LSU <b>4</b> or another executing unit. The Instruction issue &amp; staging block <b>23</b> determines any one of the executing units dynamically in accordance with vacant status of each executing unit.</p><p>For example, when the recognized instruction is a load/store instruction, because only the LSU <b>4</b> is able to execute the instruction, when the Instruction issue &amp; Staging block <b>23</b> sends the instruction to the LSU <b>4</b> at the time when being ready to send an instruction.</p><p>Next, the load/store operations to the SPRAM <b>42</b> will be explained. FIG. <b>2</b> is a diagram showing a portion of the inside configuration of the LSU <b>4</b> shown in FIG. <b>1</b>. In FIG. 2, the SPRAM <b>42</b> is separately shown in two parts, the control part (Control <b>8</b>) and the datapath.</p><p>The Control <b>8</b> of FIG. 2 generates a control signal which is supplied to the Datapath in accordance with the flow of instructions. The Datapath releases data in accordance with the control signal from the Control <b>8</b>.</p><p>In FIG. 2, each line connecting the Control <b>8</b> and the Datapath represents a control signal. Usually, the control signal is supplied to the Datapath from the Control <b>8</b>. There is also a control signal supplied from the Datapath to the Control <b>8</b> which is not shown in FIG. <b>2</b>. For example, when pipeline processes are stopped in accordance with the cache-miss of the ICACHE <b>22</b>, a miss signal from the TAG of the ICACHE <b>22</b>, which is a part of the Datapath, is supplied to the Control <b>8</b> in order to stop the pipeline processes.</p><p>In FIG. 2, the block designated by the reference numeral <b>10</b><i>a</i>, <b>10</b><i>b</i>, . . . , <b>10</b><i>j </i>stands for a register structure which separate each of stages executing the pipeline processes. These blocks <b>10</b><i>a</i>, <b>10</b><i>b</i>, . . . , <b>10</b><i>j </i>include circuits including flip-flops and latches, and execute the reading and the writing processes in sync with a clock. Hereinafter, such blocks <b>10</b><i>a</i>, <b>10</b><i>b</i>, . . . , <b>10</b><i>j </i>will be called pipeline registers as a generic name.</p><p>The IFU <b>2</b> stores the fetched instructions in the pipeline register <b>10</b> based on control by an IFU Control <b>81</b>. The instructions are sent from the pipeline register <b>10</b><i>a </i>to a Instruction Decoder <b>82</b>. The Instruction Decoder <b>82</b> generates a transitive control signal which is necessary for discrimination and processing of the instructions. The Instruction Decoder <b>82</b> generates a more abstract signal than the control signal of a calculator.</p><p>When the Instruction Decoder <b>82</b> recognizes that the fetched instructions are the load/store instructions, a control signal group is sent to the relative Control Logic block. In other words, as shown in FIG. 2, the control signal group is sent to a Pipeline Control <b>83</b>, a GPR (General Purpose Register) Control <b>84</b>, and an LSU Control <b>85</b>, as shown in FIG. <b>2</b>.</p><p>In the Pipeline Control <b>83</b> and the LSU Control <b>85</b>, the instructions and the control signals flow in sync with stages of data flow. Because of this, the pipeline registers <b>10</b><i>a</i>, <b>10</b><i>b</i>, . . . , <b>10</b><i>j </i>are provided for both the Control <b>8</b> and the Datapath.</p><p>The Pipeline Control <b>83</b> controls the flow of the pipeline in accordance with the condition of the pipeline register <b>10</b><i>a</i>, <b>10</b><i>b</i>, . . . , <b>10</b><i>j</i>. For example, when a resource hazard occurs on the calculator, processes which stop the pipeline are executed.</p><p>The LSU Control <b>85</b> generates the control signal which is necessary to execute the load/store instruction. That is, data sent from a register file <b>1</b> to the pipeline register <b>10</b><i>b </i>by control of the GPR Control <b>84</b> is sent to an address generator <b>43</b> in order to generate the addresses. The Address Generator <b>43</b> is controlled by the Adder Control <b>86</b>. The addresses generated by the address Generator <b>43</b> are sent to the pipeline register <b>10</b><i>d </i>of next stage.</p><p>SPR (SPRAM) Control <b>87</b> accesses the SPRAM based on signals from the Pipeline Control <b>83</b> and the LSU Control <b>85</b>. At this point, the address of the pipeline register <b>10</b><i>d </i>is used. When this address corresponds to a load instruction, a read enable signal is asserted, and a write enable signal is deasserted. Accordingly, data in the SPRAM <b>42</b> is read out and stored in the pipeline register <b>10</b><i>e</i>. The stored data is written to the register file <b>11</b> at next stage.</p><p>When the address in the pipeline register <b>10</b><i>d </i>corresponds to the store instruction, the read enable signal is deasserted, and the write enable signal is asserted effect. Accordingly, data staged from the register file <b>11</b> is written into the SPRAM <b>42</b>.</p><p>On the other hand, a DMA (Direct Memory Access) controller <b>9</b> provided externally to the processor is, as shown in FIG. 2, connected to a BIU Control <b>88</b> in the processor via an external bus. When the DMA controller <b>9</b> sends the control signal to the BIU Control <b>88</b> and then the DMA process is started, the BIU Control <b>88</b> sends the signal to the SPR Control <b>87</b> in order to execute the reading or writing operation for the SPRAM <b>42</b>. That is, the SPR Control <b>87</b> is also connected indirectly to the DMA controller <b>9</b> via the BIU Control <b>88</b>.</p><p>When access requirements for the SPRAM is issued from both the LSU <b>4</b> and the BIU <b>12</b>(the source of the access requirement from the BIU <b>12</b> is the DMA controller <b>9</b>), the SPR Control <b>87</b> arbitrates requirements from both in order to determine the enable signal group, and changes a selector of the inputted address and data.</p><p>For example, in order to programmably control a priority of the access requirement for the SPRAM <b>42</b> by the LSU <b>4</b> and the BIU <b>12</b>, as shown by the dotted line in FIG. 2, a control register <b>71</b> may be connected to the SPR Control, and the value of the control register <b>71</b> may be programmably changed in accordance with the priority.</p><p>For example, in order to programmably control a priority of the access requirement for the SPRAM <b>42</b> by the LSU <b>4</b> and the BIU <b>12</b>, as shown by dashed line in FIG. 2, a control register may be connected to the SPR Control <b>71</b>, and the value of the control register may be programmably changed in accordance with the priority. Otherwise, as shown by dashed line in FIG. 2, the priority may be changed in accordance with the signal inputted to the external pin P of the processor.</p><p>Next, the method using the SPRAM <b>42</b> is explained. FIG. 3 is a diagram showing an example using the SPRAM <b>42</b> for a process to convert imaging data and the instructions. Thereafter, the operation of the SPRAM <b>42</b> will be explained using FIG. <b>3</b>.</p><p>(1) First of all, as shown in FIG. 3A, the image data in the external memory is stored in half of the SPRAM <b>42</b> by a DMA transfer.</p><p>(2) Next, as shown in FIG. 3B, data stored in the SPRAM <b>42</b> is transferred to the general register by the load instruction. After data is processed by the executing units such as Integer Units <b>5</b><i>a</i>, <b>5</b><i>b </i>and so on, the processed data is stored in the SPRAM <b>42</b>. At the same time, the image data of the external memory is stored in the other half area in the SPRAM <b>42</b> by the DMA transfer.</p><p>(3) Next, as shown in FIG. 3C, the processed data is stored in the external memory by the DMA transfer. At the same time, data stored in the other half of the SPRAM <b>42</b> is processed by the LSU <b>4</b>, and the image data in the external memory is stored in the half area in the SPRAM <b>42</b>.</p><p>Thus, because the SPRAM <b>42</b> of FIG. 1 can load/store by the pipeline of the LSU <b>4</b>, and transfer data by the DMA, the SPRAM <b>42</b> is particularly suited to the high-speed processing of a large amount of data such as image data and instructions at high speed. That is, the SPRAM <b>42</b> is particularly suited for use as a temporary memo pad area (work area) to process a large amount of data such as the image data, the instructions and so on.</p><p>Because the LSU <b>4</b> can access the SPRAM <b>42</b> with the same latency (the number of a system clock necessary to the memory access) as that of the DCACHE <b>41</b>, once data stored in the external memory is transferred to the SPRAM <b>42</b>, the processor can later access the SPRAM <b>42</b> in order to execute data process; accordingly, it is possible to process a large amount of data in shorter time than would be required when accessing an external memory.</p><p>Because the SPRAM <b>42</b> of this preferred embodiment uses the DMA in order to transmit data to the external memory, even if the processor is executing the other processes, it is possible to transmit data to the external memory.</p><p>Because the SPRAM <b>42</b> of this preferred embodiment is accommodated in the chip including the executing units such as the LSU <b>4</b>, a core portion of the microprocessor, drawbacks such as signal delay and noise hardly occurs. Furthermore, the packaging area and the power consumption are decreased.</p><p>Though an example providing the SPRAM <b>42</b> and the DCACHE <b>41</b> in the LSU <b>4</b> has been explained in FIG. 1, the DCACHE <b>41</b> may be omitted. FIG. 4 is a circuit diagram of the periphery of the SPRAM <b>42</b> when the DCACHE <b>41</b> is not included. As shown in FIG. 4, the SPRAM <b>42</b> is connected to address/data bus via the BIU <b>12</b> which arbitrates the bus, and the external memory storing the image data, the instructions and so on are connected to this bus.</p><p>On the other hand, FIG. 5 is a circuit diagram of the periphery of the SPRAM <b>42</b> in a processor having both of the SPRAM <b>42</b> and the DCACHE. The SPRAM <b>42</b>, the DCACHE <b>41</b>, and the TAG <b>44</b> for the DCACHE <b>41</b> are connected to the BIU <b>12</b>. The DCACHE <b>41</b> is used to store a portion of data read out from the external memory. The TAG <b>44</b> is used to store attribute information (for example, addresses).</p><p>As shown in FIG. 5, if the SPRAM <b>42</b> and the DCACHE <b>41</b> are both provided, it is possible to use the DCACHE <b>41</b> for normal memory access and to use the SPRAM <b>42</b> when it is necessary to process a large amount of data such as image data. That is, it is possible to improve the throughput of all the system by switching between the SPRAM <b>42</b> and the DCACHE <b>41</b> depending on the process.</p><p>FIG. 6 is a timing chart showing the process when the access by each executing unit in the processor conflicts with the DMA transfer. If the SPRAM <b>42</b> with one port to which a plurality of devices cannot access at the same time, if the access by each executing unit in the processor conflicts with the DMA, the access priority is, for example, determined by the control register <b>71</b> of FIG. <b>1</b>. More specifically, programmers switch the bit value of the control register <b>71</b> in accordance with the priority.</p><p>FIG. 6 is a timing chart showing an example where the frequency of the bus clock is the half frequency of the system clock of the processor. In this case, the DMA transfers are executed in sync with a bus clock, and during intervals between the DMA transfers, the access by each executing unit is performed. By performing the access in such a way, none of the executing units stalls.</p><p>Thus, because the access of the SPRAM <b>42</b> by the executing unit (for example, the pipeline of the LSU <b>4</b>) is executed during intervals between DMA transfers, when the pipeline of the LSU <b>4</b> is going to access the SPRAM <b>42</b> at the same timing as that of the DMA, the pipeline may stall.</p><p>In this case, the stall is avoided by providing a SSB (SPRAM Store Buffer) <b>45</b>, as shown in FIG. <b>7</b>. The instructions the pipeline executes are stored temporarily in this SSB <b>45</b>. FIG. 7 indicates how the SSB <b>45</b> without the DCACHE <b>41</b> is connected, and FIG. 8 is an example of an SPRAM <b>42</b> and a DCACHE <b>41</b> having a common store buffer <b>46</b>. FIG. 9 is a diagram showing an example of an SPRAM with a specific SSB <b>45</b> and a specific store buffer <b>47</b> for the DCACHE <b>41</b>.</p><p>As shown in FIG. 7-9, by providing the SSB <b>45</b> or the store buffer <b>46</b> and <b>47</b>, it is possible to avoid the stall of the executing unit such as the LSU<b>4</b>. That is, when the access to the SPRAM <b>42</b> by the executing unit conflicts with a DMA transfer, data of the executing unit is stored in the SSB <b>45</b> or the store buffers <b>46</b> and <b>47</b> until the DMA transfer finishes, and during the period, the pipeline can execute another processes.</p><p>As shown in FIG. 8, when the SPRAM <b>42</b> and the DCACHE <b>41</b> share the store buffer <b>46</b>, a select circuit which selects the SPRAM <b>42</b> or the DCACHE <b>41</b> is necessary. Therefore, the configuration of the store buffer <b>46</b> is more complicated than that shown in FIG. <b>9</b>.</p><p>FIG. 10 is a timing chart showing the situation where the access by the executing unit conflicts with the DMA transfer, and shows an example where the priority of the DMA is higher than that of the executing unit.</p><p>For example, at time point T<b>1</b>, when the DMA conflicts with the access of the executing unit Pipe A, the DMA is executed preemptively, and data D<b>1</b> from the executing unit Pipe A is temporarily stored in the SSB <b>45</b>. Then, at time point T<b>2</b>, the process of the executing unit Pipe A stored in the SSB <b>45</b> is executed. At the same time, the data D<b>2</b> of the executing unit Pipe B which is to be transferred is stored in the SSB <b>45</b>.</p><p>At the time point T<b>3</b>, the DMA is executed preemptively. At this time point, because data D<b>2</b> of the executing unit Pipe B is being stored in the SSB <b>45</b>, the executing unit Pipe C which is going to be accessed is stalled.</p><p>After that, at time point T<b>4</b>, the process of the executing unit Pipe B stored in the SSB <b>45</b> is executed. At the same time, data D<b>3</b> of the executing unit Pipe C which has been stalling is stored in the SSB <b>45</b>.</p><p>FIG. 11 is a timing chart showing write timing of the SPRAM <b>42</b>. As shown in FIG. 11, a DMA write is executed at every two clocks of a system clock CLK. Data of two clocks length of the system clock CLK is supplied to the CPU bus.</p><p>FIG. 12 is a timing chart showing read timing of the SPRAM <b>42</b>. As shown in FIG. 12, a DMA read is executed at every two clocks of the system clock. Data of one clock length of the system clock CLK is outputted from the SPRAM <b>42</b>, and data of two clocks length of the system clock CLK is outputted to the CPU bus.</p><p>Though ordinary load/store instruction may be used to access the SPRAM <b>42</b>, specific instructions to access the SPRAM <b>42</b> may be provided. As examples of such specific instructions, an SPRAM index load data instruction, an SPRAM index store instruction, an SPRAM index store immediate data instruction, a block transfer instruction to the SPRAM <b>42</b>, a block transfer instruction from the SPRAM <b>42</b> and so on may be provided. When these instructions are issued, if these instructions are given priority to the control by the MMU <b>3</b>, it is possible to access the SPRAM <b>42</b> at high speed. By providing the specific instructions for the SPRAM <b>42</b>, the programmers can use the SPRAM <b>42</b> easily, and programming design simplifies.</p><p>An example that the SPRAM <b>42</b> does not have snoop function has been explained. The SPRAM <b>42</b> may have the snoop function in accordance with a further embodiment. Here, the “snoop” is to detect whether or not the SPRAM <b>42</b> or the DCACHE <b>41</b> holds latest data being stored to the external memory. The reason why the snoop is necessary is that the corresponding data does not exist in the external memory and there may be a case where the SPRAM <b>42</b> or the DCACHE <b>41</b> holds.</p><p>FIG. 13 is a peripheral circuit of the SPRAM <b>42</b> having the snoop function. As shown in FIG. 13, an address register <b>48</b> and an address comparator <b>49</b> are provided for the processor. The address register <b>48</b> functions as the TAG of the SPRAM <b>42</b>. The address of data being stored in the SPRAM <b>42</b> and so on are stored in the address register. When the SPRAM <b>42</b> is divided into n pieces of entries, the address registers in accordance with the number of entries are provided. The address registers are connected to the CPU bus and the content of the address registers can be read out via the CPU bus.</p><p>Though not shown in FIG. 13, means to write to the address register <b>48</b> may be provided. For example, this may occur with specific instructions to the LSU <b>4</b>. More specifically, the programmers give a certain address in order to write to the address register <b>48</b>. Otherwise, when data is written to the SPRAM <b>42</b> by the DMA, a source address of the DMA may be automatically set to the address register <b>48</b>.</p><p>An address comparator <b>49</b> of FIG. 13 is connected to the address/data bus via the BIU <b>12</b>. The address comparator <b>49</b> compares the address set to the address register <b>48</b> with the address sent from an agent requiring the snoop. If both of the addresses coincide with each other, the address comparator <b>49</b> determines a snoop hit. What operation is executed at the time of a snoop hit varies depending on the system configuration.</p><p>For example, when the snoop hits, the BIU <b>1</b> acquires bus authority, and reads out data of hit entry in the SPRAM <b>42</b> to the CPU bus. Otherwise, when the snoop hits, no process may be executed.</p><p>As the operation in case of the snoop hit in the system including the processor, for example, the following (1) and (2) may occur.</p><p>(1) The agent issuing the snoop receives data from the SPRAM <b>42</b>.</p><p>(2) The agent issuing the snoop waits until the SPRAM <b>42</b> is going to send data.</p><p>In case of (2), one bit of a flag is added to the address register <b>48</b>. The flag is set when an executing unit in the processor is using the SPRAM <b>42</b>. The flag is connected to the BIU <b>12</b> and is set/reset by the instruction from the executing unit. While the flag is being set, if the snoop hits to the SPRAM <b>42</b>, the agent which has issued the snoop goes to waiting status.</p><p>When there is a program sequence processing data on the SPRAM, even at the point executing the instructions except the load/store instruction in the program sequence, if data process on the SPRAM has not finished yet, it is not supposed to permit the snoop. In this case, it is desirable that the flag inhibiting the snoop is not the flag showing that the SPRAM is accessed by the load/store instruction, but the flag inhibiting the snoop regardless of the types of the instructions. Furthermore, it is desirable to be able to set the flag by software.</p><p>Thus, if the snoop function is added to the SPRAM <b>42</b>, it is possible to detect data the SPRAM <b>42</b> is now retaining from outside. Furthermore, for the occasion that has arisen, it is possible to read out data being stored to the SPRAM <b>42</b>. Accordingly, the program design is simplified.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Michael", "last_name": "Raam", "name": ""}, {"first_name": "Toru", "last_name": "Utsumi", "name": ""}, {"first_name": "Takeki", "last_name": "Osanai", "name": ""}, {"first_name": "Kamran", "last_name": "Malik", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "KABUSHIKI KAISHA TOSHIBA"}, {"first_name": "", "last_name": "KABUSHIKI KAISHA TOSHIBA", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  15/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  13/28        20060101ALI20051220RMJP"}, {"label": "G06F   9/38        20060101A I20051008RMEP"}, {"label": "G06F  12/08        20060101A I20051008RMEP"}, {"label": "G06F  12/10        20060101ALI20051220RMJP"}, {"label": "G06F  15/78        20060101ALI20051220RMJP"}, {"label": "G06F   9/312       20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "712038"}, {"primary": false, "label": "711145"}, {"primary": false, "label": "711122"}, {"primary": false, "label": "711E12021"}, {"primary": false, "label": "711139"}, {"primary": false, "label": "711138"}, {"primary": false, "label": "712032"}, {"primary": false, "label": "712E09033"}, {"primary": false, "label": "711146"}, {"primary": false, "label": "711136"}, {"primary": false, "label": "711131"}, {"primary": false, "label": "712E09046"}, {"primary": false, "label": "711141"}], "ecla_classes": [{"label": "G06F   9/30A2L"}, {"label": "G06F  12/08B18"}, {"label": "G06F   9/38D"}], "cpc_classes": [{"label": "G06F   9/30043"}, {"label": "G06F  12/0888"}, {"label": "G06F   9/3824"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1999-02-08", "application_date": "1999-02-08", "family_members": [{"ucid": "JP-2000231550-A", "titles": [{"lang": "JA", "text": "マイクロプロセッサ"}, {"lang": "EN", "text": "MICROPROCESSOR"}]}, {"ucid": "US-6389527-B1", "titles": [{"lang": "EN", "text": "Microprocessor allowing simultaneous instruction execution and DMA transfer"}]}, {"ucid": "JP-4160228-B2", "titles": [{"lang": "JA", "text": "マイクロプロセッサ"}, {"lang": "EN", "text": "Microprocessor"}]}]}