{"patent_number": "US-6658561-B1", "publication_id": 73627470, "family_id": 8242442, "publication_date": "2003-12-02", "titles": [{"lang": "EN", "text": "Hardware device for executing programmable instructions based upon micro-instructions"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA50585722\"><p>The present invention is directed to a hardware device for parallel processing a determined instruction of a set of programmable instructions having a same format with an operand field defining the execution steps of the instruction corresponding to the execution of micro-instructions, comprising decision blocks (<b>12—20</b>) being each associated with a specific instruction of the set of programmable instructions, only one decision block being selected by the determined instruction in order to define which are the specific micro-instructions to be processed for executing the determined instruction, activation blocks (<b>22-30</b>) respectively associated with the decision blocks for running one or several specific micro-instructions, only the activation block associated with said selected decision block being activated to run the specific micro-instructions, and a micro-instruction selection block (<b>46</b>) connected to each activation block for selecting the specific micro-instructions to be executed.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00001\" num=\"1\"><claim-text>1. A hardware device for parallel processing a determined instruction of a set of programmable instructions having a same format with an operand field defining the execution steps of the instruction, each of said execution steps corresponding to a micro-instruction select among a plurality of micro-instructions; said device comprising:</claim-text><claim-text>decision blocks being each associated with a specific instruction of said set of programmable instructions, only one decision block being selected by said determined instruction in order to define which are the micro-instructions to be processed for executing said determined instruction; </claim-text><claim-text>activation blocks respectively associated with said decision blocks for running one or several specific micro-instructions, only the activation block associated with said selected decision block being activated to run said specific micro-instructions; and </claim-text><claim-text>a micro-instruction selection block connected to each one of said activation blocks for selecting said specific micro-instructions among said plurality of micro-instructions in answer to the contents of said operand field of said determined instruction. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00002\" num=\"2\"><claim-text>2. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00001\">claim 1</claim-ref>, further comprising a register block for storing a selection code selecting said specific micro-instructions and an execution code defining which ones of said specific micro-instructions and in which order they have to be run.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00003\" num=\"3\"><claim-text>3. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00002\">claim 2</claim-ref>, wherein each one of said activation blocks includes a control logic responsive to said execution code in said register block, said activation block associated with said selected decision block being activated providing, in response to said execution code and to said decision block, first control signals (M<b>1</b>, M<b>2</b>, M<b>3</b>) for selecting which micro-instructions among said specific micro-instructions are to be run and second control signals (<b>3</b>L<b>2</b>, <b>3</b>L<b>1</b>, <b>2</b>L<b>1</b>, <b>2</b>L<b>3</b>, <b>1</b>L<b>3</b>, <b>1</b>L<b>2</b>) determining each micro-instruction to be run and which previous micro-instruction has to be completed before.</claim-text></claim>"}, {"num": 4, "parent": 3, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00004\" num=\"4\"><claim-text>4. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00003\">claim 3</claim-ref>, wherein said activation block further comprises a combinatory logic including an AND circuit associated with each one of said specific micro-instructions and logic circuits, the output of said AND circuit being set to 1 for activating the associated micro-instruction when said decision block associated with said activation block is activated, said control signal for selecting the micro-instruction is active and said previous micro-instruction has been completed.</claim-text></claim>"}, {"num": 5, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00005\" num=\"5\"><claim-text>5. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00002\">claim 2</claim-ref>, wherein said micro-instruction selection block comprises a plurality of micro-instruction selectors respectively associated to each one of said activation blocks, each micro-instruction selector connecting the associated activation block to said specific micro-instructions in response to said selection code.</claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00006\" num=\"6\"><claim-text>6. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00005\">claim 5</claim-ref>, wherein each said micro-instruction selector includes connecting means for connecting said associated activation block to each micro-instruction, only the connections to said specific micro-instructions being activated in response to said selection code.</claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00007\" num=\"7\"><claim-text>7. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00006\">claim 6</claim-ref>, wherein said connecting means in said micro-instruction selector includes means for activating each micro-instruction which has been selected in response to said selection code and means for connecting said selected micro instruction to said associated activation block when said selected micro-instruction has been completed.</claim-text></claim>"}, {"num": 8, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00008\" num=\"8\"><claim-text>8. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00002\">claim 2</claim-ref>, wherein said set of programmable instructions is a first set of instructions among a plurality of instructions comprising also a second set of non programmable instructions, said set of programmable instructions being defined by a sub-field of said operand field.</claim-text></claim>"}, {"num": 9, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00009\" num=\"9\"><claim-text>9. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00008\">claim 8</claim-ref>, wherein said sub-field of said operand field includes a first part defining groups of instructions respectively associated with groups of specific micro-instructions among said plurality of micro-instructions, each group of instructions being respectively associated with one selection code stored in said register block, and a second part defining said determined instruction among said group of instructions, said determined instruction being respectively associated with one execution code in said register block to define which micro-instructions among the group of specific micro-instructions selected by said selection code are to be activated and which order.</claim-text></claim>"}, {"num": 10, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00010\" num=\"10\"><claim-text>10. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00001\">claim 1</claim-ref>, wherein each of said decision blocks comprises a mask register having the same length of said determined instruction and containing a mask for masking the bits of the fields other than the operand field and a value register containing a value having the same length of said determined instruction and composed of a defined part corresponding and being identical to said operand field, and combinatory logic means for logically combining said determined instruction with the contents of said mask register and the contents of said value register so that the output of said decision block is 1 only when said determined instruction is said specific instruction associated with said decision block.</claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6658561-B1-CLM-00011\" num=\"11\"><claim-text>11. The device according to <claim-ref idref=\"US-6658561-B1-CLM-00010\">claim 10</claim-ref>, wherein some programmable instructions can be defined by a replacement of the unused or less used instructions, said replacement being achieved by modifying the contents of said mask register and said value register in said decision block in response to a specific code in said register block.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES54025440\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Technical Field</p><p>The present invention relates generally to the execution of instructions based upon the processing of one or several micro-instructions in a data processing system, and relates in particular to a hardware device for executing programmable instructions by using a set of determined micro-instructions.</p><p>2. Prior Act</p><p>At the beginning of computers, these ones had small amounts of memory. Therefore, in order to maximize the performance of the computers in the 1960's, a complex instruction set (well known as CISC) was used to reduce the amount of memory needed. The net effect was an increased efficiency since as a program took less of computer memory, it could retrieve more information for processing.</p><p>At that time, memory sub-systems were far slower than the CPU. If one complex instruction encapsulated several simple instructions, the time spent retrieving the instruction from memory was reduced. This was very important insofar as computers were very sequential; the instruction had to be completed before the computer retrieved another instruction from memory processing.</p><p>Another key to CISC was microcode. Microcode essentially acted as a translation layer between the instructions and the electronics of the computer. Microcode was a blessing for computer-architects because it made it easier to add new types of machine instructions without having to design new electronic circuits. They could design an architecture family, that is a range of computers sharing the same instruction set.</p><p>The net result of microprogramming, apart from the above, was it reduced traffic between the CPU and the memory. It lessened the volume of instructions in the data path making way for more data to move across the path.</p><p>But the disadvantage of the CISC data processing systems was that both programmers and compilers used complex instructions only by a quite small percentage. Ever one of these complex instructions only however needs a much greater number of transistors in the chip than the simple instruction, thereby increasing the size of the silicon chip.</p><p>In the end of 1970's, advances in semiconductor technology began to reduce the difference in speed between main memory and processor chips. As memory speed increased and high-level languages displaced assembly language, the major advantages of CISC began to disappear, and computer designers started to study ways computer performance could be optimized beyond just making faster hardware.</p><p>One of their key realizations was that a sequence of simple instructions produces the same results as a sequence of complex instructions, but can be implemented with a simpler (and faster) hardware design. Reduced</p><p>Instruction Set Computing (RISC) was the result. In a RISC machine, the instruction set contains only simple, basic instructions, from which more complex instructions can be composed. Each instruction has the same length, so that it may be fetched in a single operation. Most instructions complete in one machine cycle, which allows the processor to handle several instructions at the same time. This pipelining is a key technique used to speed up RISC machines.</p><p>As a result, the RISC compilers have to generate software routines to perform complex instructions that would have been done in hardware by CISC computers. Since RISC does not have a full set of instructions as in CISC, this requires longer codes to be written and a less optimized sequencing of instructions compared to the optimized CISC instructions. In other words, RISC is not always adapted to all programs, especially when a reduced number of complex instructions is the most frequently used sequence of instructions.</p><h4>SUMMARY OF THE INVENTION</h4><p>Accordingly, the main object of the invention is to provide a hardware device for processing a set of instructions that better matches the need of each program, allowing the use of simple instructions where necessary and more complex instructions fitting the most frequently used sequence of basic instructions.</p><p>Another object of the invention is to provide a hardware device for processing programmable instructions able to run selected sequences of micro-instructions among a limited set of micro-instructions.</p><p>The invention relates therefore to a hardware device for parallel processing a determined instruction of a set of programmable instructions having a same format with an operand field defining the execution steps of the instruction, each of the execution steps corresponding to a micro-instruction selected among a plurality of micro-instructions. This device comprises decision blocks being each associated with a specific instruction of the set of programmable instructions, only one decision block being selected by the determined instructions in order to define which are the micro-instructions to be processed for executing the determined instruction, activation blocks respectively associated with the decision macroblocks for running one or several specific micro-instructions, only the activation block associated with the selected decision block being activated to run the specific micro-instructions, and a micro-instruction selection block connected to each activation block for selecting the specific micro-instructions among the plurality of micro-instructions in response to the contents of the operand field of the determined instruction.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWING</h4><p>Preferred embodiments of the present invention will now be described, by way of example only, with reference to the accompanying drawings in which:</p><p>FIG. 1 is a block-diagram representing a preferred embodiment of the device according to the invention.</p><p>FIG. 2 is a block-diagram representing a preferred embodiment of a decision block of the device according to the invention.</p><p>FIG. 3 is a block diagram representing principally a preferred embodiment of an activation block of the device according to the invention.</p><p>FIG. 4 is a block-diagram representing principally a preferred embodiment of the micro-instruction selection block of the device according to the invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS OF THE INVENTION</h4><p>The main idea of the present invention is to select, among a set of instructions, a group of appropriate instructions to be used as programmable instructions for the programs assembling the most frequently used instructions and sequences of instructions. Such a selection can be made on a specific range of instructions reserved for this purpose and/or may be a replacement of the unused or less used by more appropriate instructions. Each of the programmable instructions is a sequence of micro-instructions taken in a reduced set of micro-instructions.</p><p>It is assumed that each construction considered in the present invention includes an operand field (opcode) of 8 bits. This means that the set of instructions comprises 256 instructions. Among these instructions, it is preferable that only a part of them be programmable whereas other ones are not. Thus, as an example, it can be assumed that the instructions having an operand field the value of which is between 00000000 and 11011111 are predefined whereas the instructions having an operand field the value of which is between 11100000 and 11111111 are programmable.</p><p>In the hardware device according to the invention illustrated in FIG. 1, an instruction register <b>10</b> is used to load the instruction to be executed. Each instruction among a group of n instructions is decoded by one decision block <b>12</b>, <b>14</b>, <b>16</b>, <b>18</b> or <b>20</b> among n decision blocks respectively associated with the n instructions. The output of each decision block <b>12</b>-<b>20</b> is supplied to one corresponding activation block in a plurality of n activation blocks <b>22</b>, <b>24</b>, <b>26</b>, <b>28</b>, <b>30</b>. The outputs of activation blocks <b>22</b>-<b>30</b> are all at 0 except the output of the activation block corresponding to the decision block associated with the instruction loaded in register <b>10</b> which is at 1.</p><p>Then, the activation block receiving <b>1</b> from its corresponding decision block activates one or several of micro-instructions <b>32</b>, <b>34</b>, <b>36</b>, <b>38</b>, <b>40</b>, <b>42</b>, <b>44</b> which have to be run in the execution of the decoded instruction. As an example, the number of micro-instructions is 7 in FIG. <b>1</b>. In a general way, the number of micro-instructions is reduced for example 64 or less insofar as such a reduced number defines a very important number of combinations determined by the operand field to the instruction.</p><p>As seen hereafter, a micro-instruction selection block <b>46</b> is used to select the specific micro-instructions which have to be run in answer to the contents of the operand field. Also, a register block <b>48</b> is used to store the control bits defined by the operand field of the instruction and enabling both the selected activation block and the micro-instruction selection block <b>46</b> to be controlled according to the programmable instruction as described hereafter.</p><p>Each decision block <b>12</b>, <b>14</b>, <b>16</b>, <b>18</b>, or <b>20</b> is a hardware device which is configured according to the associated instruction as described now in reference to FIG. <b>2</b>. Such a configuration is made by using a mask register <b>50</b> and a value register <b>52</b>. Mask register <b>50</b> which has the same length as instruction register <b>10</b>, contains bits used to mask the bits which are irrelevant for the execution of the invention. These bits are all data bits which are not operand bits in the instruction, but can also be bits of the operand field which are useless for this instruction. Thus, the instructions for a 8 bits compare and 16 bits compare are similar but 8 bits of the operation code are useless for a 8 bits compare and can be masked. In such a case, the mask enables the number of decision blocks to be reduced since several instructions are presented by a single mask. Note that in the preferred embodiment, the bits which are used as a mask are set to 1 and the other bits corresponding to relevant bits of the operand field are set to 0. Each bit of the mask register is logically combined in an OR circuit <b>54</b> (only one circuit is referenced in FIG. 2) with the corresponding bit of the instruction loaded in instruction register <b>10</b>. This means that only useful bits of the operand field of the instruction keep their right value whereas the other bits corresponding to the masking bits of mask register <b>50</b> are all set to 1. Value register <b>52</b> which has the same length as instruction register <b>10</b>, contains bits identical to the useful bits of the operand field in the instruction and useless bits of the operand field or bits of other data fields are set to 1. Each bit of value register <b>52</b> is logically combined in a XOR circuit <b>56</b> (only one circuit is referenced in FIG. 2) with the corresponding bit delivered by the OR circuit associated with the corresponding bit of the instruction. Then, all the bits delivered by the XOR circuit are logically combined in a NOR circuit <b>58</b>. This means that the output line <b>60</b> of the NOR circuit is set to 1 only if all the outputs of the XOR circuits are 0, that is when the sequence of bits at the outputs of the OR circuits is identical to the sequence of bits loaded in value register <b>52</b>. In other words, the output line <b>60</b> of the decision block is <b>1</b> only if this block is configured according to the instruction loaded in instruction register <b>10</b>.</p><p>Though the determination of the involved instruction is preferable implemented by using decision block as described in reference to FIG. 2, it is possible to use any other decode mechanism. Thus, a basic decoding of the opcode of the instruction would be sufficient to identify and select the micro-instructions to be run.</p><p>As an example if a range is defined for the set of programmable instruction, a first decode will identify this range. It corresponds to a Chip Select (CS) lead well know in computer and logic design. In addition a separate decode of the significant bits within this range is made to select each instruction. This can be done using classical <b>3</b> to <b>8</b> or <b>4</b> to <b>16</b> decoders. A equivalent design using logical AND, OR and inversor gates may be used. Then, each decision block is an AND between each output of this decoder and the CS lead decoding the range. There will be, if there is a programmable instruction opcode, only one decision block which will identify and select this opcode as there will be only one decoder output valid. If the opcode being decoded is not within the programmable range, CS will not rise and no selector block will be activated.</p><p>Always with the example already mentioned above, it is assumed that 5 bits of the OPCODE are programmable, resulting in a subset of 32 programable instructions. This subset can be divided into 8 groups of instructions defined by 3 bits and each group can include 4 instructions defined by 2 bits. In such an example, a group determines the micro-instructions which can be activated by the instructions of the group, and an instruction determines which of these micro-instructions are executed and in which order (in parallel or in sequence).</p><p>Assuming that the micro-instructions which can be used in a group are taken from a global set of 64 micro-instructions, the preferred method is to pre-define associations of micro-instructions. With a selection code of 8 bits, it is possible to define 256 of such associations of micro-instructions. Note that the number of these associations can be more important thereby increasing the number of bits of the selection code.</p><p>Assuming that an association of 3 micro-instructions be assigned to a group, it is necessary to define an execution code determining for each instruction of the group the micro-instructions among these 3 micro-instructions to be used and in which order. In such a case, the following capabilities of execution are as follows:</p><p>1: Micro-instructions <b>1</b>, <b>2</b> and <b>3</b> executed in parallel</p><p>2: Micro-instructions <b>1</b>, <b>2</b> executed in parallel, not executed</p><p>3: Micro-instructions <b>1</b>, <b>3</b> executed in parallel, <b>2</b> not executed</p><p>4: Micro-instructions <b>2</b>, <b>3</b> executed in parallel, <b>1</b> not executed</p><p>5: Micro-instructions <b>1</b> executed, <b>2</b> and <b>3</b> not executed</p><p>6: Micro-instructions <b>2</b> executed, <b>1</b> and <b>3</b> not executed</p><p>7: Micro-instructions <b>3</b> executed, <b>1</b> and <b>2</b> not executed</p><p>8: Micro-instructions <b>1</b>, <b>2</b> and <b>3</b> executed in sequence</p><p>9: Micro-instructions <b>2</b>, <b>1</b> and <b>3</b> executed in sequence</p><p>10: Micro-instructions <b>2</b>, <b>3</b> and <b>1</b> executed in sequence</p><p>11: Micro-instructions <b>3</b>, <b>2</b> and <b>1</b> executed in sequence</p><p>12: Micro-instructions <b>3</b>, <b>1</b> and <b>2</b> executed in sequence</p><p>13: Micro-instructions <b>1</b>, <b>3</b> and <b>2</b> executed in sequence</p><p>14: Micro-instructions <b>1</b>, <b>2</b> executed in sequence, <b>3</b> not executed</p><p>15: Micro-instructions <b>1</b>, <b>3</b> executed in sequence, <b>2</b> not executed</p><p>16: Micro-instructions <b>2</b>, <b>3</b> executed in sequence, <b>1</b> not executed</p><p>17: Micro-instructions <b>2</b>, <b>1</b> executed in sequence, <b>3</b> not executed</p><p>18: Micro-instructions <b>3</b>, <b>1</b> executed in sequence, <b>2</b> not executed</p><p>19: Micro-instructions <b>3</b>, <b>2</b> executed in sequence, <b>1</b> not executed</p><p>20: Micro-instructions <b>1</b>, <b>2</b> executed in parallel, <b>3</b> after</p><p>21: Micro-instructions <b>1</b>, <b>3</b> executed in parallel, <b>2</b> after</p><p>22: Micro-instructions <b>2</b>, <b>3</b> executed in parallel, <b>1</b> after</p><p>23: Micro-instructions <b>3</b> first then <b>1</b>, <b>2</b> executed in parallel</p><p>24: Micro-instructions <b>2</b> first then <b>1</b>, <b>3</b> executed in parallel</p><p>25: Micro-instructions <b>1</b> first then <b>2</b>, <b>3</b> executed in parallel</p><p>Accordingly, an execution code of 5 bits for each instruction of the group is sufficient. Of course, when more micro-instructions are used in a group, the execution code can require more than 5 bits.</p><p>A preferred embodiment of an activation block <b>22</b>-<b>30</b> (e.g. activation block <b>22</b>) activating 3 micro-instructions among the set micro-instructions is now described in reference to FIG. <b>3</b>.</p><p>It must be noted that in the present example, each group requires 8 bits (selection code) and 4×5 bits (execution code), that is 28 bits. Therefore, since there are 8 groups defined by 3 bits of the operand field of the instruction, the register block must have a minimum capacity of 28×8=224 bits. But it is clear that the capacity of the register block must be adapted to the number of micro-instructions being used, the number of associations of micro-instructions, the number of programmable instructions and the number of groups of programmable instructions.</p><p>It must be noted that, further to define the programmable instructions by a sub-field in the opcode of the instruction, some programmable instructions can be defined by a replacement of the unused or less used instructions. Such a replacement by programmable instructions is achieved by modifying the contents of mask register <b>50</b> and value register <b>52</b> in the decision block (see FIG. 2) in response to a specific code in register block <b>48</b>.</p><p>Returning to FIG. 3, the execution code (of 5 bits) from register block <b>48</b> is used by a control logic <b>62</b> in the activation block to set the outputs M<b>1</b>, M<b>2</b>, M<b>3</b> and <b>1</b>L<b>2</b>, <b>1</b>L<b>3</b>, <b>2</b>L<b>3</b>, <b>2</b>L<b>1</b>, <b>3</b>L<b>1</b>, <b>3</b>L<b>2</b>. M<b>1</b>, M<b>2</b>, M<b>3</b> outputs define which micro-instructions are to be activated, M<b>1</b> corresponding to micro-instruction <b>1</b> (<b>32</b>), M<b>2</b> corresponding to micro-instruction <b>2</b> (<b>34</b>) and M<b>3</b> corresponding to micro-instruction <b>3</b> (<b>36</b>). The bottom outputs mLn determine in which order these micro-instructions are activated. For information, mLn with m and n being <b>1</b>, <b>2</b> or <b>3</b>, indicates that micro-instruction m will be executed only after micro-instruction n has been completed.</p><p>In order to simplify the figure, micro-instruction selection block <b>46</b> which will be described hereafter, is only represented by dotted lines. Likewise, the connection lines between activation block <b>22</b> and the micro-instructions are represented by dotted lines without the details of the connections.</p><p>Though in the example, only three micro-instructions are executed, it is possible that the number of micro-instructions to be executed be different. In a general way, if the number of instructions is I, the outputs of control logic <b>62</b> are M<b>1</b>, M<b>2</b>, M<b>1</b>, and the number of bottom outputs mLn is equal to 1×(I−1). Note that each one of the M output is a mask for the corresponding micro-instruction: <b>1</b> selects the micro-instruction and <b>0</b> disables it.</p><p>Based upon the above implementation of control logic <b>62</b>, it is clear to understand how to implement a combination of logic circuits AND and OR represented in FIG. <b>3</b>. But, it is also clear that such circuits could be replaced by the skilled man by a different hardware logic to achieve the same result.</p><p>It must be noted that, each micro-instruction block <b>32</b>, <b>34</b> or <b>36</b> has an input line which is used to activate the micro-instruction when set to 1 and an output line set to 1 only when the execution of the micro-instruction has been completed.</p><p>Assuming that only micro-instructions <b>1</b> and <b>2</b> are to be run, with micro-instruction <b>2</b> being executed after the completion of micro-instruction <b>1</b>, the binary values of the control logic outputs are set as follows:</p><p>M<b>1</b>→1</p><p>M<b>2</b>→1</p><p>M<b>3</b>→0</p><p><b>1</b>L<b>2</b>→1</p><p><b>1</b>L<b>3</b>→1</p><p><b>2</b>L<b>3</b>→1</p><p><b>2</b>L<b>1</b>→0</p><p><b>3</b>L<b>1</b>→1</p><p><b>3</b>L<b>2</b>→1</p><p>Referring again to FIG. 3, both <b>1</b>L<b>3</b> and <b>1</b>L<b>2</b> being set to 1, AND circuit <b>64</b> has its two inputs (OR circuits) set to 1 and AND <b>64</b> provides an output <b>1</b> to AND circuit <b>66</b>. Since activation block <b>22</b> of FIG. 3 is selected, the input from decision block <b>12</b> (see FIG. 2) is set to <b>1</b>. The third input Ml of AND circuit <b>66</b> being also <b>1</b>, AND circuit <b>66</b> provides a bit <b>1</b> on its output line <b>68</b> which activates micro-instruction <b>1</b>.</p><p>Conversely, AND circuit <b>70</b> has its first input set to 1 (by <b>2</b>L<b>3</b>). But its second input is 0 since among its two inputs, <b>2</b>L<b>1</b> is set to 0 and micro-instruction <b>1</b> provides a bit <b>0</b> on its output line <b>72</b> as long as micro-instruction <b>1</b> has not been completed. As soon as micro-instruction <b>1</b> has been completed, it provides a bit <b>1</b> on output line <b>72</b> and AND circuit <b>70</b> has its two inputs which are set to 1. Therefore, AND circuit <b>70</b> sets its output to 1. The three inputs of AND circuit <b>74</b> being set to 1 since M<b>2</b> output is 1, it provides a bit <b>1</b> on its output line <b>76</b> which activates micro-instruction <b>2</b>.</p><p>As far as micro-instruction <b>3</b> is concerned, it will never be activated. As a matter of fact, AND circuit <b>78</b> has its input M<b>3</b> which is set to 0 by control logic <b>62</b>. Therefore, the output line <b>80</b> (activation line of micro-instruction <b>3</b>) of AND circuit <b>78</b> is always <b>0</b>.</p><p>Micro-instruction selection block <b>46</b> (see FIG. 1) connected to each one of the activation blocks for selecting the specific micro-instruction to be used by the instruction among the plurality of micro-instructions is now described in reference to FIG. <b>4</b>.</p><p>As mentioned above, register block <b>48</b> is used to store the control bits defined by the operand field of the instruction, and in particular, a selection code associated with each group of instructions for defining which are the micro-instruction to be used in the instruction. Assuming that there are 256 associations of micro-instructions, each selection code includes 8 bits. If, as defined above, there are 8 groups of instructions (defined by 3 bits in the opcode), 8 selections codes <b>82</b> or <b>84</b> are necessary to control micro-instruction selection block <b>46</b>.</p><p>Micro-instruction selection block <b>46</b> is composed essentially of n selectors <b>86</b>, <b>88</b>, <b>90</b> respectively associated with each one of the activation blocks. As illustrated in FIG. 4, selector <b>86</b> is associated with activation block <b>22</b>, selector <b>88</b> is associated with activation block <b>24</b> and selector <b>90</b> is associated with activation block <b>30</b>.</p><p>Each micro-instruction selector <b>86</b>, <b>88</b> or <b>90</b> includes as many logical combinatory circuits as the number of outputs multiplied by the number of inputs. For each couple input/output, this circuit uses the selection code and connections from the associated activation blocks as inputs and has a single output to the appropriate micro-instruction via OR circuit <b>92</b>. The combinatory circuit sets its output to 1 each time the input from the selection code is activated, that is for all selection codes which have defined to map this input to this output. For all other values of the selection code, the output is set to 0. For example, with a selection code of 8 bits defining 256 possible cases, only 10 cases could have defined micro-instruction <b>4</b> (<b>38</b>) to be associated with output <b>1</b> of activation block <b>2</b> (<b>24</b>)</p><p>Assuming that there are 8 groups of 4 instructions, this means that n=32 and there are 32 activation blocks respectively associated with 32 selectors. Besides, a selector code controls 4 selectors, such as selector code <b>82</b> which controls selector <b>86</b> (<b>1</b>), selector <b>88</b> (<b>2</b>).</p><p>In the example illustrated in FIG. 4, 3 micro-instructions among 7 micro-instructions are activated, thereby requiring three bidirectional connection lines between an activation block and it associated selector in micro-instruction selection block <b>46</b>. The output line of each selector is not connected directly to the selected micro-instruction via an OR circuit since each selector can activate each micro-instruction depending upon the selection code in register block <b>48</b>. Accordingly, all the outputs of selectors <b>1</b> to n are combined in an OR circuit such as OR circuit <b>92</b> for each micro-instruction. In the other direction, that is from each micro-instruction block to the selector, there is no need to aggregate the connection lines since the line from the micro-instruction block will be set to 1 and recognized directly by the selector defined by the selector code and not by the other selectors since only one selector is active. Therefore, the output of each micro-instruction is connected directly to all the selectors and reciprocally, each selector is connected to each micro-instruction block by two connection lines, an output line (by the intermediary of an OR circuit) and an input line (directly).</p><p>While the invention has been particularly shown and described with respect to preferred embodiments thereof, it will be understood by those skilled in the art that the foregoing and other changes in form and details may be made therein without departing form the spirit and scope of the invention.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Alain", "last_name": "Benayoun", "name": ""}, {"first_name": "Jean-Francois", "last_name": "Le Pennec", "name": ""}, {"first_name": "Claude", "last_name": "Pin", "name": ""}, {"first_name": "Patrick", "last_name": "Michel", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "INTERNATIONAL BUSINESS MACHINES CORPORATION"}, {"first_name": "", "last_name": "GOOGLE LLC", "name": ""}, {"first_name": "", "last_name": "GOOGLE INC.", "name": ""}, {"first_name": "", "last_name": "INTERNATIONAL BUSINESS MACHINES CORPORATION", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F   9/28"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F   9/22        20060101A I20051008RMEP"}, {"label": "G06F   9/38        20060101AFI20051220RMJP"}, {"label": "G06F   9/318       20060101A I20051008RMEP"}, {"label": "G06F   9/30        20060101A I20051008RMEP"}, {"label": "G06F   9/00        20060101ALI20060101BMKR"}], "national_classes": [{"primary": true, "label": "712245"}, {"primary": false, "label": "712E09037"}, {"primary": false, "label": "712E09035"}, {"primary": false, "label": "712E09005"}, {"primary": false, "label": "712300"}, {"primary": false, "label": "712E09028"}], "ecla_classes": [{"label": "G06F   9/30U"}, {"label": "G06F   9/30X2"}, {"label": "G06F   9/30U2"}, {"label": "G06F   9/30T"}, {"label": "G06F   9/22D"}], "cpc_classes": [{"label": "G06F   9/223"}, {"label": "G06F   9/30174"}, {"label": "G06F   9/30185"}, {"label": "G06F   9/30145"}, {"label": "G06F   9/30145"}, {"label": "G06F   9/30185"}, {"label": "G06F   9/30174"}, {"label": "G06F   9/00"}, {"label": "G06F   9/223"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1999-05-31", "application_date": "2000-04-20", "family_members": [{"ucid": "FR-2794259-A1", "titles": [{"lang": "EN", "text": "Parallel instruction processing device for programmable instructions set has micro-instructions selection block that controls each activation blocks for selecting specific micro-instruction from corresponding set"}, {"lang": "FR", "text": "DISPOSITIF MATERIEL DESTINE A L'EXECUTION D'INSTRUCTIONS PROGRAMMABLES BASEES SUR DES MICRO-INSTRUCTIONS"}]}, {"ucid": "FR-2794259-B1", "titles": [{"lang": "EN", "text": "MATERIAL DEVICE FOR THE EXECUTION OF PROGRAMMABLE INSTRUCTIONS BASED ON MICRO INSTRUCTIONS"}, {"lang": "FR", "text": "DISPOSITIF MATERIEL DESTINE A L'EXECUTION D'INSTRUCTIONS PROGRAMMABLES BASEES SUR DES MICRO-INSTRUCTIONS"}]}, {"ucid": "KR-100374401-B1", "titles": [{"lang": "EN", "text": "HARDWARE DEVICE FOR EXECUTING PROGRAMMABLE INSTRUCTIONS BASED UPON MICRO-INSTRUCTIONS"}, {"lang": "KO", "text": "마이크로 명령을 기초로 프로그램 가능한 명령을 실행하는하드웨어 장치"}]}, {"ucid": "JP-2000353089-A", "titles": [{"lang": "JA", "text": "マイクロ命令をもとにプログラマブル命令を実行するハードウェア装置"}, {"lang": "EN", "text": "HARDWARE DEVICE FOR EXECUTING PROGRAMMABLE INSTRUCTION ON THE BASIS OF MICROINSTRUCTION"}]}, {"ucid": "TW-482980-B", "titles": [{"lang": "EN", "text": "Hardware device for executing base programmable instructions based upon micro-instructions"}]}, {"ucid": "KR-20010007093-A", "titles": [{"lang": "KO", "text": "마이크로 명령을 기초로 프로그램 가능한 명령을 실행하는하드웨어 장치"}, {"lang": "EN", "text": "HARDWARE DEVICE FOR EXECUTING PROGRAMMABLE INSTRUCTIONS BASED UPON MICRO-INSTRUCTIONS"}]}, {"ucid": "JP-3578267-B2", "titles": [{"lang": "JA", "text": "マイクロ命令をもとにプログラマブル命令を実行するハードウェア装置"}, {"lang": "EN", "text": "A hardware device that executes a programmable instruction based on a micro instruction"}]}, {"ucid": "US-6658561-B1", "titles": [{"lang": "EN", "text": "Hardware device for executing programmable instructions based upon micro-instructions"}]}]}