{"patent_number": "US-6226722-B1", "publication_id": 72652463, "family_id": 22928068, "publication_date": "2001-05-01", "titles": [{"lang": "EN", "text": "Integrated level two cache and controller with multiple ports, L1 bypass and concurrent accessing"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA72548500\"><p>A memory system wherein data retrieval is simultaneously initiated in both and L2 cache and main memory, which allows memory latency associated with arbitration, memory DRAM address translation, and the like to be minimized in the event that the data sought by the processor is not in the L2 cache (miss). The invention allows for any memory access to be interrupted in the storage control unit prior to any memory signals being activated. The L2 and memory access controls are in a single component, i.e. the storage control unit (SCU). Both the L2 and the memory have a unique port into the CPU which allows data to be directly transferred. This eliminates the overhead associated with storing the data in an intermediate device, such as a cache or memory controller.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00001\" num=\"1\"><claim-text>1. A computer system including a processing unit, L2 cache and memory, comprising:</claim-text><claim-text>a storage control unit including an integrated cache controller and memory controller for controlling operations of said L2 cache and said memory, respectively; </claim-text><claim-text>means for simultaneously initiating a first operation to retrieve information from said L2 cache and a second operation to retrieve information from said memory; </claim-text><claim-text>means for determining if information required by said processing unit is stored in said L2 cache; and </claim-text><claim-text>means for aborting said second operation by providing a stop memory operation signal directly from said cache controller to said memory controller concurrent with a determination that said information is in said L2 cache; </claim-text><claim-text>wherein said second operation is aborted before any request signals are output to said memory and said memory continues operations independent of said second operation. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00002\" num=\"2\"><claim-text>2. A system according to claim <b>1</b>, further comprising means for transferring said information from either said L2 cache or said memory to at least one execution unit contained in said processing unit.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00003\" num=\"3\"><claim-text>3. A system according to claim <b>2</b> wherein said means for transferring comprises:</claim-text><claim-text>first means for receiving said information from said L2 cache; and </claim-text><claim-text>second means for receiving said information from said memory. </claim-text></claim>"}, {"num": 4, "parent": 3, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00004\" num=\"4\"><claim-text>4. A system according to claim <b>3</b> wherein said first means for receiving comprises:</claim-text><claim-text>a cache bus for transmitting said information directly from said L2 cache to said processing unit; </claim-text><claim-text>means for storing said information from the L2 cache in said processing unit; and </claim-text><claim-text>means for accessing said information from the L2 cache by said at least one execution unit. </claim-text></claim>"}, {"num": 5, "parent": 4, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00005\" num=\"5\"><claim-text>5. A system according to claim <b>4</b> wherein said second means for receiving comprises:</claim-text><claim-text>a memory bus for transmitting said information directly from said memory to said process sing unit; </claim-text><claim-text>means for storing said information from the memory in said processing unit; and </claim-text><claim-text>means for accessing said information from the memory by said at least one execution unit. </claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00006\" num=\"6\"><claim-text>6. A system according to claim <b>5</b> wherein said information comprises data information and instruction information.</claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00007\" num=\"7\"><claim-text>7. A system according to claim <b>6</b> wherein said first and said second means for receiving further comprise:</claim-text><claim-text>means for storing said data information in a data cache unit internal to said processing unit; and </claim-text><claim-text>means for storing said instruction information in an instruction cache unit internal to said processing unit. </claim-text></claim>"}, {"num": 8, "parent": 7, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00008\" num=\"8\"><claim-text>8. A system according to claim <b>7</b> wherein said first and second means for receiving further comprise:</claim-text><claim-text>means for concurrently storing said data information in said internal data cache when said data information is directly provided to said at least one execution unit; and </claim-text><claim-text>means for concurrently storing said instruction information in said internal instruction cache when said instruction information is directly provided to said at least one execution unit. </claim-text></claim>"}, {"num": 9, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00009\" num=\"9\"><claim-text>9. A system according to claim <b>2</b> wherein said means for transferring comprises means for bypassing an internal cache included in said processing unit.</claim-text></claim>"}, {"num": 10, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00010\" num=\"10\"><claim-text>10. A memory system according to claim <b>1</b> wherein said means for aborting comprises means for preventing any memory operation signals from being transmitted to said memory when said information is in said L2 cache any memory access operations being transmitted from said.</claim-text></claim>"}, {"num": 11, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00011\" num=\"11\"><claim-text>11. A method of transferring information between a processing unit of a computer system and an L2 cache and memory, comprising the steps of:</claim-text><claim-text>controlling said L2 cache and said memory by a cache controller and memory controller, respectively, which are integrated on a storage control unit; </claim-text><claim-text>simultaneously initiating a first operation to retrieve information from said L2 cache and a second operation to retrieve information from said memory; </claim-text><claim-text>determining if information required by said processing unit is stored in said L2 cache; and </claim-text><claim-text>aborting said second operation by providing a stop memory operation signal directly from said cache controller to said memory controller concurrent with a determination that said information is in said L2 cache; </claim-text><claim-text>wherein said second operation is aborted before any access signals are output to said memory wherein said memory continues operations independent of said request. </claim-text></claim>"}, {"num": 12, "parent": 11, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00012\" num=\"12\"><claim-text>12. A method according to claim <b>11</b> further comprising the step of transferring said information from either said L2 cache or said memory to at least one execution unit contained in said processing unit.</claim-text></claim>"}, {"num": 13, "parent": 12, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00013\" num=\"13\"><claim-text>13. A method according to claim <b>12</b> wherein said step of transferring comprises the steps of:</claim-text><claim-text>receiving said information from said L2 cache; and </claim-text><claim-text>receiving said information from said memory. </claim-text></claim>"}, {"num": 14, "parent": 13, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00014\" num=\"14\"><claim-text>14. A method according to claim <b>13</b> wherein said step of receiving information from said L2 cache comprises the steps of:</claim-text><claim-text>transmitting said information directly from said L2 cache to said processing unit; </claim-text><claim-text>storing said information from the L2 cache in said processing unit; and </claim-text><claim-text>accessing said information from the L2 cache by said at least one execution unit. </claim-text></claim>"}, {"num": 15, "parent": 14, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00015\" num=\"15\"><claim-text>15. A method according to claim <b>14</b> wherein said step of receiving information from said memory comprises the steps of:</claim-text><claim-text>transmitting said information directly from said memory to said processing unit; </claim-text><claim-text>storing said information from the memory in said processing unit; and </claim-text><claim-text>accessing said information from the memory by said at least one execution unit. </claim-text></claim>"}, {"num": 16, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00016\" num=\"16\"><claim-text>16. A method according to claim <b>15</b> wherein said information comprises data information and instruction information.</claim-text></claim>"}, {"num": 17, "parent": 16, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00017\" num=\"17\"><claim-text>17. A method according to claim <b>16</b> wherein said step of receiving information from said L2 cache and the step of receiving information from said memory further comprise the steps of:</claim-text><claim-text>storing said data information in a data cache unit internal to said processing unit; and </claim-text><claim-text>storing said instruction information in an instruction cache unit internal to said processing unit. </claim-text></claim>"}, {"num": 18, "parent": 17, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00018\" num=\"18\"><claim-text>18. A method according to claim <b>17</b> wherein said step of receiving information from said L2 cache and the step of receiving information from said memory further comprise the steps of:</claim-text><claim-text>concurrently storing said data information in said internal data cache when said data information is directly provided to said at least one execution unit; and </claim-text><claim-text>concurrently storing said instruction information in said internal instruction cache when said instruction information is directly provided to said at least one execution unit. </claim-text></claim>"}, {"num": 19, "parent": 12, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00019\" num=\"19\"><claim-text>19. A method according to claim <b>12</b> wherein said step of transferring comprises the step of bypassing an internal cache included in said processing unit.</claim-text></claim>"}, {"num": 20, "parent": 11, "type": "dependent", "paragraph_markup": "<claim id=\"US-6226722-B1-CLM-00020\" num=\"20\"><claim-text>20. A method according to claim <b>11</b> wherein said step of aborting comprises the step of preventing any memory operation signals from being transmitted to said memory when said information is in said L2 cache.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES54536611\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>The present invention generally relates to a data processing system wherein the processor initiates parallel access to a level 2 (L2) cache and main memory. More specifically, parallel access is initiated and if the instructions or data are found in the L2 cache, the memory access is aborted before the memory is accessed. Additionally, a novel non-hierarchical memory scheme is disclosed for processor load operations wherein two unique data ports are provided to the processor.</p><p>2. Description of Related Art</p><p>Many modern computer architectures use a hierarchy of storage elements for fast access to data and instructions. Typically a level 1 (L1) cache is integrated into the central processing unit (CPU) and provides a small (8 kilobytes to 256 kilobytes) fast access storage which can run simultaneously with the CPU. A level 2 cache provides a larger cache with more storage and is located between the L1 cache and the level 3 (L3) main memory (external to the CPU). The L2 cache normally runs at the same speed as the CPU clock and is made up of static random access memory (SRAM). The main memory is several cycles behind the CPU clock speed, due to the slower dynamic random access memory (DRAM) which is used, address translation, arbitration and the like.</p><p>Conventional three level memory hierarchy systems have a cache control unit for the L2 cache and a separate storage control unit for main memory. Cache misses occur when the data or instructions that the CPU needs are not in the cache. Normally, L1 cache misses are sent to the L2 cache control unit, which then checks the L2 cache for a hit (desired data or instruction is in the L2 cache). If a L2 miss occurs the request is then sent to the storage control unit to fetch the data from main memory. These events occur sequentially and may cause a substantial amount of idle time for the CPU. That is, a time penalty occurs due to the amount of time needed for the data request to go to the L2 cache, and if a miss occurs to then check the main memory for the data.</p><p>In order to minimize the amount of CPU idle time, U.S. Pat. No. 4,663,440 shows a hierarchical memory system wherein a low level memory includes a dual port access to the memory chip(s). A high level memory is also included which interacts serially with one port of the low level memory. This enables serial access of the low level memory by the high level memory to occur in parallel with access of the low level memory by a computer system. However, this system does not disclose concurrent access of different levels of memory when a data miss occurs. European Patent Application 0 468 786 A2 describes a memory system with a separate cache controller and memory controller. A microprocessor initiates a search for data in both the cache and main memory simultaneously. If the data is not found in the cache, then the data can be retrieved from main memory without the penalty of cache lookup latency. However, if the data is found in the cache, then the data need not be retrieved from memory and the access to the memory controller is cancelled. The memory controller then terminates the previously initiated search in main memory by asserting a “hit” line, or deasserting a “miss” line. Either of these actions by the memory controller would communicate the need to terminate the main memory access cycle because the data was found in the cache. Thus, it can be seen that this existing system begins accessing the main memory by arbitrating for the bus, translating memory addresses, searching memory locations which all use memory cycles, i.e. the memory is incapable of being used during the period when these activities are occurring. Therefore, each time the microprocessor searches the cache and memory simultaneously, the memory is accessed and becomes incapable of being used in any other process, such as a direct memory access transfer (DMA) from a peripheral controller, or the like, even when the data is found in the cache. This causes the problem of tying up the memory even when the data is found in the cache.</p><p>U.S. Pat. No. 3,896,419 shows a typical processor with an L1 cache and memory. This system checks the cache for the data while a memory retrieval operation is being processed. If the data is found in the cache, the retrieval from memory is blocked. However, a port cycle for retrieving data from the memory must be cancelled when data is found in the cache. Thus, memory operations are impacted even when the data is found in the cache.</p><p>IBM Technical Disclosure Bulletin, vol. 26, No. 10B, March 1984, pages 5488-5490 discusses at page 5489 a conventional hierarchical memory system wherein an L2 hit indicates data present in the cache and the desired data is then provided to the L1 cache and the output register</p><p>A typical prior art hierarchical memory system is shown in FIG. 1 wherein a CPU <b>100</b> includes a L1 cache <b>102</b> and is connected to a stand-alone L2 cache controller <b>106</b>, via data bus <b>104</b>. L2 cache controller provides address and control information to L2 cache <b>108</b> and data is received from the L2 cache along bus <b>107</b>. Data bus <b>110</b> interconnects L2 cache controller <b>106</b> with memory controller <b>112</b> which provides address and control information to memory <b>114</b>. The memory address and control information and data received from memory <b>114</b> are transferred to memory controller <b>112</b> along bus <b>113</b>. From viewing the memory system architecture of Figure, it can be seen that for a L2 cache hit, the data must be provided from L2 cache <b>108</b> to L2 cache controller <b>106</b> and then to CPU <b>100</b>, i.e. two chip crossings. Thus, this conventional system requires additional clock cycles to move the data from the L2 cache through cache controller <b>106</b> and onto data bus <b>104</b>. Similarly, when a cache miss occurs and the data must be retrieved from memory <b>114</b>, the data must be moved through memory controller <b>112</b> and onto data bus <b>110</b>, and the data must then be moved through the L2 cache controller before being placed on data bus <b>104</b> for use by CPU <b>100</b> (i.e. three chip crossings).</p><p>Therefore, those skilled in the art will understand how a memory system wherein access to the L2 cache and main memory are simultaneously initiated, but which does not cause the main memory to be accessed when the data is found in the L2 cache, is highly desirable. Further, it can be seen that a memory system wherein unique ports are provided that allow a L2 cache to provide data directly to a processing unit, instead of passing it through a cache controller to a L1 cache, will increase the speed and efficiency of the system. Additionally, a unique port that allows a main memory to be directly connected to a L1 cache in the CPU, rather through a memory controller and cache controller, will also increase system efficiency.</p><h4>SUMMARY OF THE INVENTION</h4><p>In contrast to the prior art, the present invention provides a non-hierarchical memory system wherein data retrieval is simultaneously initiated in both the L2 cache and main memory. This allows memory latency associated with arbitration, memory DRAM address translation, and the like to be minimized in the event that the data sought by the processor is not in the L2 (miss). The present invention allows for any memory access to be interrupted in the storage control unit prior to activating any memory control signals.</p><p>Therefore, access to the L2 and memory can be initiated simultaneously, but if the data is found in the L2 cache (hit), then the storage control unit can abort the memory access before there is any performance impact. In this manner, the memory does not even know that an access was in progress and can continue doing other work, e.g. DMA transfers and the like. Even if no other memory operations are occurring, there is still a significant performance savings realized because no DRAM access has been started. Those skilled in the art will understand that a DRAM requires a pre-charge time between back to back accesses. Thus, memory operations following the false (L2 Hit) memory operation will not have to be held off due to the pre-charge time of the DRAM.</p><p>Also, the present invention provides a unique non-hierarchical memory scheme, wherein the L2 cache provides data or instructions directly to the CPU. In conventional three level memory systems the L2 passes the data/instruction desired by the processor to the L1 cache, which then provides it to the CPU. That is, prior art systems require for data from the main memory to be provided to the CPU via the L2 cache. In other words there is no unique port to the CPU that allows data to be directly provided to the processor. However, in the system of the present invention the L2 cache passes data or instructions directly to the processing unit which has requested the information. At the same time the instructions/data are placed in the L1 cache for subsequent use by the processing units. In this manner, a significant amount of cycles are saved by bypassing the L1 cache.</p><p>Broadly, the present invention places the L2 and memory access controls in a single component, e.g. the storage control unit (SCU). In this manner the L2 cache control can communicate the occurrence of a L2 hit to the memory control unit within an extremely short period of time, which allows the memory controller to abort the memory access operation before there is any impact on the main memory itself. That is, the memory access is aborted prior to activating any memory signals. Thus, any following memory operations will not be held off due to a false DRAM pre-charge time, as discussed earlier.</p><p>Additionally, the L2 cache of the present invention is connected in parallel to the L1 and the various processing units such that data/instructions (“information”) can be provided directly to the processor requesting the information without the added cycles associated with storing the information from the L2 cache in the L1 cache and then retrieving the information from the L1 cache by the processor. A first unique port is provided from the main memory to the L1 cache in the CPU. A second unique port provides direct access between the L2 cache and a register that transfer information between the fixed point unit and floating point unit in the CPU. A level two (L2) cache hit will return data to the CPU in less cycles since there is no additional chip crossings. For example, in the prior art system of FIG. 1, it can be seen that data from L2 <b>108</b> must be stored in L2 cache controller <b>106</b>, prior to be provided to CPU <b>100</b>. A significant amount of processing time is required to retrieve data from L2 <b>108</b>, store it in controller <b>106</b> and then provide the data along bus <b>104</b> to CPU <b>100</b>. Cycles are also saved by the present invention, as compared to prior art hierarchical memory systems, when a L2 cache miss occurs. In this case, the data must be retrieved from the main memory. It can be seen in the conventional system of FIG. 1 that data from memory <b>114</b> must be passed to memory controller <b>112</b>, L2 controller <b>106</b> and then to CPU <b>100</b>. In contrast, the present invention provides a unique port which allows the data to be provided directly to the CPU from main memory, when a L2 cache miss occurs.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><p>These and other objects, features and advantages will become apparent to those skilled in the art upon considering the subsequent description taken in conjunction with the attached drawings.</p><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a diagram showing the interconnection of devices in a prior art hierarchical memory system;</p><p>FIG. 2 is a block diagram of a processor system incorporating the present invention, wherein the L1, L2 and main memory are shown;</p><p>FIG. 3 is block diagram of the storage control unit (SCU) component of the processor of the present invention showing the parallel L2 and main memory access feature;</p><p>FIG. 4 is a block diagram showing the interconnection of the L1 and L2 caches of the present invention, and the buses which transfer data between the these caches and the various processing units;</p><p>FIG. 5 is a timing diagram showing the CPU cycles needed to access data or instructions in the main memory when a L2 cache miss occurs in a conventional system;</p><p>FIG. 6 is a timing diagram showing the CPU cycles needed to access data or instructions in the main memory when a L2 cache miss occurs in the system of the present invention;</p><p>FIG. 7 is a timing diagram showing the CPU cycles needed to access data or instructions in the main memory when a cache hit occurs in a conventional system; and</p><p>FIG. 8 is a timing diagram illustrating the CPU cycles needed to retrieve data or instructions from an L2 cache in the memory system of the present invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><p>Referring to FIG. 2, a block diagram of the overall structure of the present invention is shown wherein reference numeral <b>1</b> represents a multichip module superscalar processor chip set (CPU), such as is used in a RISC System/6000 workstation manufactured by IBM Corporation (RISC System/6000 is a trademark of IBM). Instruction cache unit <b>3</b> includes a branch processing unit <b>4</b> (FIG. 4) and a level one instruction cache <b>11</b>. The branch instruction unit (BIU) and branch processing unit (BPU) process the incoming instructions and dispatch these instructions to the floating point unit (FPU) <b>5</b> and fixed point unit (FXU) <b>7</b>. The BPU provides all of the branching, interrupt, and condition code functions within the system. Those skilled in the art will understand that FPU <b>5</b> executes floating-point instructions while FXU <b>7</b> executes fixed point arithmetic operations (see IBM RISC System/6000 Technology, published by IBM, 1990, pages 16-42, for a more detailed description of the RISC System/6000 processing unit).</p><p>Storage control unit (SCU) <b>9</b> controls access between the CPU and the level 2 cache <b>15</b> and main memory <b>17</b>. SCU <b>9</b> includes a level 2 cache directory <b>10</b> which is used to compare the address of the data or instructions (“information” as used herein will refer to both data and instructions) in the L2 cache with the address of the desired information to determine if a L2 cache hit or miss has occurred. It can be seen from FIG. 2 that SCU <b>9</b> does not receive data from either the L2 cache <b>15</b> or memory <b>17</b>. SCU <b>9</b> only provides address and control information to the L2 and memory. The unique ports from: (1) L2 <b>15</b> to DCU <b>13</b> and ICU <b>3</b>; and (2) memory <b>17</b> to DCU <b>13</b> allow data to be provided directly to the CPU without the overhead associated with intermediately storing the data in SCU <b>9</b>.</p><p>Level one data cache unit (DCU) <b>13</b> is connected to FPU <b>5</b> and FXU <b>7</b> and stores recently accessed data which is likely to be needed again by the FPU or FXU. DCU <b>13</b> includes registers, latches and the like (not shown), along with the data cache (D-cache) <b>14</b> which only stores data. It can be seen that the architecture of a preferred system implementing the present invention has separated the L1 cache into a data storage component <b>14</b> and an instruction component (I-cache) <b>11</b>. In this way, the data and instructions stored in the L1 cache system are physically closer to the respective processing units which use data and instructions. That is, I-cache <b>11</b> is in close physical proximity to BPU <b>4</b> (contained in ICU <b>3</b>) such that instructions stored in I-cache <b>11</b> can be easily and quickly provided to, or received from BPU <b>4</b>. Similarly, D-cache <b>14</b> is located close to FPU <b>5</b> and FXU <b>7</b> which allows these execution units ready access to the data stored in D-cache <b>14</b>. L2 cache <b>15</b> is a plurality of static random access memory (SRAMs) devices which are connected to both the storage control unit <b>9</b> and reload bus <b>2</b>. Requests for information stored in L2 cache <b>15</b> are received from SCU <b>9</b>, and if found in the L2, is provided to the requesting processing unit and the L1 cache along reload bus <b>2</b>.</p><p>The third level of memory is main memory <b>17</b> which is a set of dynamic random access memory devices (DRAMs) which are connected to SCU <b>9</b>, and DCU <b>13</b>. Main memory <b>17</b> is the slowest memory device in the system of the present invention, in that it requires the greatest number of clock cycles to retrieve information therefrom. Memory <b>17</b> is connected directly to DCU <b>13</b> which allows information from memory to be provided directly to FPU <b>5</b> and FXU <b>7</b>. The information is received in DCU <b>13</b> by a register, or the like, and then supplied to the execution units. Of course, the information from memory <b>17</b> could also be provided to D-cache <b>14</b>. If instructions are being received from memory <b>17</b>, the instruction information is provided from DCU <b>13</b> onto reload bus <b>2</b> and then to ICU <b>3</b>. In this manner data and instruction information can be provided directly from memory <b>17</b> to processing unit <b>1</b>.</p><p>Also shown in FIG. 2, is PBUS <b>6</b> which transmits the requests for data or instructions to SCU <b>9</b>. System input/output bus (SIO) interconnects DCU <b>13</b> (and the various processing units) with the input/output (I/O) control chips (XIO) <b>21</b> and <b>23</b>. These XIO chips <b>21</b>, <b>23</b> coordinate the transfer of data between an external bus, such as the Microchannel (MCA) bus (Microchannel is a trademark of the IBM Corporation) and the internal CPU bus used to interconnect the various processing units. A read only storage (ROS) chip <b>19</b> is shown, also connected to SIO bus <b>12</b>, which provides some of the basic routines and codes used to boot the CPU, such as power on self test (POST) and the like.</p><p>It can be seen from FIGS. 2 and 4 that ICU <b>3</b> not only sends requests for information to SCU <b>9</b>, via PBUS <b>6</b>, but also forwards instructions to FPU <b>5</b> and FXU <b>7</b> for execution. Both the FPU <b>5</b> and FXU <b>7</b> are connected to DCU <b>13</b> by two quad word buses for transferring information between the L1 cache <b>14</b> and the processing units. FXU <b>7</b> is also connected to PBUS <b>6</b> such that the fixed point unit can also request information from L1 cache <b>14</b>. Cache <b>15</b> receives address and control information off of bus <b>16</b> (interconnecting it with SCU <b>9</b>) and is also connected by reload bus <b>2</b> directly to FPU <b>5</b> and FXU <b>7</b> through register <b>51</b> in L1 DCU <b>13</b> (see FIG. <b>4</b>). Additionally, reload bus <b>2</b> directly connects L2 cache <b>15</b> to BPU <b>4</b> in ICU <b>3</b> through register <b>50</b>, as shown in FIG. <b>4</b>. Main memory <b>17</b> receives address and control information off of bus <b>18</b> interconnecting it with SCU <b>9</b> and is also directly connected to DCU <b>13</b> by bus <b>20</b>. FIG. 2 also illustrates one of the novel features of the configuration of the present invention in that the L2 cache <b>15</b> and memory <b>17</b> have a unique port into the processing units and L1 cache, respectively. Thus, information from memory <b>17</b> is not required to first pass through the L2 cache <b>15</b> before being forwarded to the L1 cache. Additionally, the L2 cache has been connected directly to the processing units via reload bus <b>2</b> and registers in ICU <b>3</b> and L1 DCU <b>13</b> (see FIG. <b>4</b>). This allows information from L2 cache <b>15</b> to be moved into the requesting execution unit faster than conventional systems, due to the absence of additional chip crossings. Thus, it can be seen that the present invention is a non-hierarchical memory system wherein the L2 cache is directly connected to the processing units, thus bypassing the L1 cache <b>14</b>. Further, main memory <b>17</b> is directly connected to L1 DCU <b>13</b>, which bypasses L2 cache <b>15</b>. When compared with the prior art system of FIG. 1, the main memory also bypasses a memory controller and cache controller such that only a single chip crossing is needed to provide the requested information to the CPU.</p><p>Furthermore, the unique ports of the present invention allows separation of the memory bus <b>20</b> and reload bus <b>2</b> such that any bus loading is minimized. This allows these buses to input information directly to the CPU, as opposed to a controller, or the like. Thus, buses <b>2</b> and <b>20</b> are capable of being operated at a much faster rate, than conventional systems which tie the entire memory system (e.g. L2 cache and main memory) directly to a single bus that is connected to the CPU.</p><p>FIG. 4 shows, in greater detail the non-hierarchical aspect of the present invention. More specifically, ICU <b>3</b> is shown with L1 I-cache <b>11</b> and BPU <b>4</b>, along with register <b>50</b>. It can be seen that I-cache <b>11</b> is interconnected to branch processor <b>4</b> such that instructions are provided from the cache to BPU <b>4</b>. Register <b>50</b> is directly connected to reload bus <b>2</b> and, thus, to L2, cache <b>15</b>. The ICU is also connected to FPU <b>5</b> and FXU <b>7</b> such that the BIU can dispatch instructions to the floating point and fixed point units. DCU <b>13</b>, including D-cache <b>14</b> is shown interconnected to FPU <b>5</b> and FXU <b>7</b> in order for data required for the execution of instructions by these processing units can be quickly obtained. DCU <b>13</b> also includes a register <b>51</b> which is interconnected to reload bus <b>2</b> and L2 cache <b>15</b>. It can be seen that a preferred embodiment of the present invention partitions the L1 cache into I-cache <b>11</b> and D-cache <b>14</b> for instructions and data, respectively. These separate partitions are then physically placed close to the processing units which are most likely to require the information stored therein. That is, BPU <b>4</b> requires instructions, thus, I-cache <b>11</b> is placed near BPU <b>4</b>. Similarly, FPU <b>5</b> and FXU <b>7</b> require data, and D-cache <b>14</b> is located close to these processing units.</p><p>As stated above, conventional hierarchical memory systems provide information from each level of memory to the next memory level sequentially until the information finally reaches the requesting processing unit. However, the present invention allows information found in a level two cache to be directly provided to the requesting processor. For example, if a L2 cache hit occurs on an instruction stored therein, the instruction is provided from L2 <b>15</b> directly to register <b>50</b>, via reload bus <b>2</b>. The instruction is moved into BPU <b>4</b> and I-cache <b>11</b> simultaneously during the next cycle. Thus, it can be seen that the L<b>1</b> cache is totally bypassed when a cache hit occurs on an instruction stored in the L2 cache. If the L2 cache hit was for data information, it would be provided to register <b>51</b> and then accessed by either FPU <b>5</b> or FXU <b>7</b>, without being previously stored in L1 D-cache <b>14</b>. Of course, the instruction and data information will be simultaneously stored in I-cache <b>11</b> and D-cache <b>14</b>, respectively, so that the information can be more quickly retrieved the next time it is needed, i.e. information retrieval is faster from the L1 cache than the L2 cache, since the L1 cache is closer to the execution units.</p><p>Further, the non-hierarchical nature of the present invention extends to main memory <b>17</b>. Conventionally, when L1 and L2 cache misses occur and the information is found to be in main memory, that information is then passed to a memory controller, L2 cache controller and finally to the L1 cache for retrieval by the requesting processing unit. In contrast, the present invention provides a unique port which connects the main memory <b>17</b> with L1 DCU <b>13</b> in the CPU, via bus <b>20</b>. This direct interconnection of memory <b>17</b> with the CPU is implemented by placing both the memory controller and L2 cache controller in SCU <b>9</b>, which only issues address and control signals. As noted above, conventional systems have a separate cache and memory controller that receive the requested data and require additional chip crossings before the data can be provided to the CPU. These additional chip crossings require a significant amount of overhead in the form of machine cycles due to the generation of address and control signals, as well as, intermediately storing the requested data.</p><p>More particularly, it can be seen from FIG. 4 that memory <b>17</b> is directly connected to register <b>51</b> in DCU <b>13</b>. This allows data information and instruction information to be provided directly from memory <b>17</b> to register <b>51</b>. Data information will be accessed by the execution units <b>5</b> and <b>7</b> directly from register <b>51</b>. However, instruction information will be placed on reload bus <b>2</b> for transfer to register <b>50</b>. The instruction information is then accessed by BPU <b>4</b> from register <b>50</b>. The instruction information and data information is also provided to I-cache <b>11</b> and D-cache <b>14</b> from registers <b>50</b> and <b>51</b>, respectively, for later use by the execution units.</p><p>Data requested by either FPU <b>5</b> or FXU <b>7</b> can also be directly provided from L2 cache <b>15</b>, via reload bus <b>2</b>. That is, when data is requested and a hit occurs in L2 cache <b>15</b> the data is placed into register <b>51</b> and then subsequently moved into the requesting processing unit (FPU <b>5</b> or FXU <b>7</b>) and L1 D-cache <b>14</b> during the next cycle. Although register <b>51</b> is physically located in L1 cache chip <b>13</b>, no L1 latency is associated with storing data from the L2 cache <b>15</b> therein, i.e. there is no address translation or the like. Thus, the data from L2 cache <b>15</b> and memory <b>17</b> bypasses L1 cache <b>14</b>. In a preferred embodiment, register <b>51</b> was placed on the same chip as L1 cache <b>14</b> merely for convenience, since there was space available on that device. It would have been impractical to redesign the FPU <b>5</b> or FXU <b>7</b> to include an additional register. Similarly, providing a separate chip having just a register therein is also undesirable. Those skilled in the art will understand that moving requested instructions and data into L1 I-cache <b>11</b> and L1 D-cache <b>14</b>, respectively will save time, since the information is likely to be needed again.</p><p>FIG. 3 is a block diagram of the components which make up SCU <b>9</b>. PBUS <b>6</b> is shown which transmits requests for information from ICU <b>3</b> to SCU <b>9</b>. It can be seen that the information requests are placed in both the L2 request queue <b>53</b> and memory request queue <b>52</b>. Thus, since SCU <b>9</b> contains the controller for both the memory <b>17</b> and L2 cache <b>15</b>, the information request from PBUS <b>6</b> can be processed in parallel. When the request for information exits queue <b>53</b>, it is input to both L2 cache directory <b>10</b> and comparator <b>57</b>. The information requested is compared with the locations in L2 cache <b>15</b>, i.e. directory <b>10</b> outputs address tags to comparator <b>57</b>, which then determines if the information in the cache is that which is requested by ICU <b>3</b>. If not, a cache miss occurs and memory operations are allowed to complete, i.e. the main memory is searched for the desired information. If the information in the L2 cache is found, by comparator <b>57</b> to match the desired information from queue <b>53</b>, then a cache hit occurs and a hit signal is sent to L2 cache controller <b>55</b> which in turn sends a stop memory operation signal to memory controller <b>59</b>.</p><p>The information request from memory request queue <b>52</b> is sent to both memory controller <b>59</b> and memory DRAM address translator <b>61</b> at the same time the request is sent from L2 request queue <b>53</b> to L2 cache directory <b>10</b>. This allows the memory access operations to begin at the same time the L2 cache is being searched for the requested data. This provides an advantage since the latency associated with retrieving information from memory <b>17</b> is minimized.</p><p>It should be noted that memory controller <b>59</b> and L2 cache controller <b>55</b> are on the same integrated circuit (IC) device. This allows the stop memory operation signal to be provided directly from L2 cache controller <b>55</b> to memory controller <b>59</b> in a single cycle. Those skilled in the art will appreciate the enormous savings in cycle time that occurs when a signal is transferred between components on a single IC. There is a large amount of overhead associated with signals transmitted across chip boundaries. For example, both chips must arbitrate for ownership of the bus and then implement a transfer protocol. Thus, by eliminating the chip boundary a large number of clock cycles are saved, which provide increased performance. That is, when a L2 cache hit occurs, the stop memory operation signal is received by memory controller <b>59</b> before the memory access operations are complete and any control signals are output to memory <b>17</b> on bus <b>18</b>. Therefore, when a L2 cache hit occurs, the next memory operation will not be delayed since no memory operation signals are activated. For example, an MCA adapter connected to bus <b>21</b> or <b>23</b> is allowed to continue writing data to main memory <b>17</b> during a DMA transfer with no interruptions due to an arbitration occurring for ownership of the memory. Additionally, there is no DRAM perturbation, i.e. the following memory operations are not held off due to pre-charging of the DRAM.</p><p>To summarize, not only is the latency associated with memory access minimized by initiating the L2 cache and memory access simultaneously, but the memory availability time is also maximized since the memory is allowed to continue processing when a cache hit occurs. Only when comparator <b>57</b> determines that a cache miss exists is the main memory even aware that information is being requested.</p><p>FIG. 5 is a timing diagram showing the cycles used when an L2 cache miss occurs in a conventional system, such as shown in FIG. <b>1</b>. In cycle 1, a reload request is placed on data bus <b>104</b> and during cycle 2 the conventional cache controller <b>106</b> determines that a L2 cache miss has occurred. Subsequently, a memory controller request signal goes active during cycle 4 (cycles 3 and 4 were required to communicate the L2 cache miss signal from cache controller <b>106</b> to memory controller <b>112</b>, since a chip crossing occurred), and memory arbitration and DRAM address translation occur during cycle 5 in memory controller <b>112</b>. In cycles 6 and 7 the Row/Column address is generated, and the row address strobe (RAS) and column address strobe (CAS) signals are activated at cycles 6 and 7, respectively. When these signals are active, the row and column address information is on the bus. Information from the memory is output in cycle 12 to memory controller <b>112</b> (on memory data bus <b>113</b>) and is placed on data bus <b>110</b> (data bus <b>2</b> of FIGS. 1 and 5) during cycle <b>14</b>. Another chip crossing is then encountered before the retrieved data can be placed on data bus <b>104</b> (data bus <b>1</b> of FIGS. 1 and 5) in cycle 16 and moved into L1 cache <b>102</b> in CPU <b>100</b>. It should be noted that two clock cycles were used as the time penalty for moving data between chips, however, other conventional systems may require more than two cycles per chip crossing. Thus, it can be seen that conventional hierarchical memory systems require at least 16 cycles in order for information to be received from main memory when a L2 cache miss has occurred.</p><p>Referring to FIG. 6, another timing diagram is shown which illustrates the sequence of control between L2 cache <b>15</b> and the main memory <b>17</b> of the present invention when a cache miss occurs. During cycle 1, one of the processing units places a reload request on PBUS <b>6</b>, as shown by the valid PBUS signal, and in cycle 2 SCU <b>9</b> loads the requested address and performs a L2 cache directory look-up. The directory tag is compared with its out of the read address sent on PBUS <b>6</b> to determine if the request is a hit or a miss. In parallel, during cycle 2, memory arbitration and memory DRAM row/column address generation is performed. In this case it has been assumed that the cache miss has occurred and the STOP_MEMORY signal is not activated, as can be seen in FIG. <b>6</b>. Therefore, the memory Row/Column address is generated during cycles 3 and 4, and the row address strobe signal is activated in cycle 3. During cycle 4, the column address strobe address is activated. Thus, at cycle 4, the row and column addresses are on the bus (bus <b>18</b> of FIG. <b>2</b>). These signals are then provided by SCU <b>9</b> and during cycle 9, memory <b>17</b> begins driving information onto the memory data bus <b>20</b>. At this time, data is provided to DCU <b>13</b>. If the request to memory was for data, then the present invention only requires 9 cycles to retrieve the data from memory and make it available to D-cache <b>14</b> in DCU <b>13</b>. However if the request was for instructions, they will be placed on the reload bus at cycle 11 and available to I-cache <b>3</b> at this time. In any event, the information (including data and instructions) is placed on reload bus <b>2</b> at cycle 11 such that the information is provided to the L2 cache. In this manner, the next time this information is requested it will be found in the L2 cache and a cache hit, rather than a L2 cache miss will occur. At cycle 11, the L2 write enable and chip enable signals are activated to allow the information to be simultaneously written to L2 cache <b>15</b> in parallel with the write from memory <b>17</b> to L1 cache <b>14</b> along memory data bus <b>20</b> in order to avoid a future cache miss.</p><p>Therefore, it can be seen that the system of the present invention allows information to be placed in DCU <b>13</b> in only 9 cycles (for data) and on reload bus <b>2</b> in only 11 cycles (for instructions), compared to 16 cycles in a conventional system. This is due to the novel aspects of the present invention which provides a unique port for the memory to provide information directly to the CPU.</p><p>FIG. 7 is a timing diagram showing the timing of a conventional hierarchical memory system, when a L2 cache hit occurs. During cycle 1 the requesting processing unit places a reload request on data bus <b>104</b>, and in cycle 2, the L2 cache controller <b>106</b> does a directory look up and determines that the information is in the L2 cache. The HIT signal is activated in cycle 2 indicating that the information to be retrieved is in the cache. The L2 cache chip enable signal is activated and the L2 address is sent to the L2 cache <b>108</b> in cycle 4. In cycle 5, the retrieved information is output from L2 cache <b>108</b> to cache controller <b>106</b> in cycle 5. The data is subsequently provided to CPU <b>100</b> from data bus <b>104</b> during cycle 7, due to the additional chip crossing required when the data is provided from L2 cache <b>108</b> to cache controller <b>106</b>, prior to being placed on bus <b>104</b>. Thus, it can be seen that with a conventional hierarchical memory system, at least 7 cycles elapse before any instructions or data from the L2 cache are placed on data bus <b>104</b>.</p><p>In the prior art shown in FIG. 1, the memory access is so slow that memory operations, e.g. arbitration, memory DRAM address translation, row/column address generation and the like are not even initiated, due to the presence of the information in the L2 cache, i.e. the L2 and memory operations are independent and sequential. However, other conventional systems may initiate the memory access at the same time the cache directory is read (cycle 2). In that case at least three (3) cycles would be added to the memory operations, since an individual cache controller must send a signal to a separate memory controller. The present invention, however, combines the cache controller and memory controller in a single storage control unit (SCU <b>9</b>) which directly controls the L2 cache and memory. In this manner, the memory operations can be aborted before any signals are sent from SCU <b>9</b> to memory <b>17</b>. Thus, memory <b>17</b> may continue normal operations.</p><p>FIG. 8 is a timing diagram illustrating how the unique port of the present invention between the L2 cache and the CPU provide data and instructions to the CPU faster than conventional systems. Additionally, FIG. 8 shows how the memory access is stopped prior to any signals being output from SCU <b>9</b> to the memory <b>17</b>, when a L2 cache hit occurs.</p><p>During cycle 1, one of the processing units, e.g. FXU <b>7</b> or BPU <b>4</b>, places a reload request on the processor bus PBUS <b>6</b> as shown by the PBUS valid signal going active. PBUS <b>6</b> then transmits the signal to SCU <b>9</b>. In cycle 2, SCU <b>9</b> loads the address of the requested information and reads the L2 cache directory <b>10</b> to perform an L2 cache directory look-up. The directory tag from the directory <b>10</b> is then compared with bits from the real address sent on PBUS <b>6</b> (using comparator <b>57</b> of FIG. 3) to determine if a cache hit or miss has occurred. In parallel, the memory access operations within SCU <b>9</b> are initiated at cycle 2. During cycle 2 memory arbitration and memory DRAM row/column address generation is performed. In this case a L2 cache hit has occurred, therefore, a STOP_MEMORY signal is activated to prevent the memory operation from ever being started. The STOP_MEMORY signal blocks the memory Row/Column address from even being generated by SCU <b>9</b>. Further, the memory RAS and memory CAS are not sent to the memory (see FIG. <b>6</b>).</p><p>During cycle 4, SCU <b>9</b> starts the L2 cache read access by activating the L2 chip enable signal and sending the L2 address from SCU <b>9</b> to cache <b>15</b>. Beginning in cycle <b>5</b> the information from L2 cache <b>15</b> is driven onto the reload bus <b>2</b> and sent to the requesting processing unit (see FIG. <b>2</b>). It can be seen from comparing FIGS. 7 and 8 that conventional hierarchical memories require 7 cycles to retrieve information from a L2 cache, but the present invention only requires 5 cycles, thus saving a substantial amount of processing time. This savings is due to the fact that the unique L2 port allows data to be transferred directly from the cache to the CPU, rather than through an intermediate cache controller chip, or the like.</p><p>Although certain preferred embodiments have been shown and described it should be understood that many changes and modifications may be made therein without departing from the scope of the appended claims.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "David James", "last_name": "Shippy", "name": ""}, {"first_name": "David Benjamin", "last_name": "Shuler", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "INTERNATIONAL BUSINESS MACHINES CORPORATION"}, {"first_name": "", "last_name": "INTERNATIONAL BUSINESS MACHINES CORPORATION", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  12/08"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F  12/08        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "711168"}, {"primary": false, "label": "711E12043"}, {"primary": false, "label": "711E12055"}], "ecla_classes": [{"label": "G06F  12/08B22L"}, {"label": "G06F  12/08B16F"}], "cpc_classes": [{"label": "G06F  12/0884"}, {"label": "G06F  12/0897"}, {"label": "G06F  12/0884"}, {"label": "G06F  12/0897"}, {"label": "G06F  12/00"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1994-05-19", "application_date": "1994-05-19", "family_members": [{"ucid": "WO-1995032472-A1", "titles": [{"lang": "EN", "text": "INTEGRATED LEVEL TWO CACHE AND MEMORY CONTROLLER WITH MULTIPLE DATA PORTS"}, {"lang": "FR", "text": "CONTROLEUR D'ANTEMEMOIRE DE NIVEAU 2 ET DE MEMOIRE PRINCIPALE INTEGREES, AVEC MULTIPLES PORTS D'ACCES AUX DONNEES"}]}, {"ucid": "EP-0760133-A1", "titles": [{"lang": "FR", "text": "CONTROLEUR D'ANTEMEMOIRE DE NIVEAU 2 ET DE MEMOIRE PRINCIPALE INTEGREES, AVEC MULTIPLES PORTS D'ACCES AUX DONNEES"}, {"lang": "EN", "text": "INTEGRATED LEVEL TWO CACHE AND MEMORY CONTROLLER WITH MULTIPLE DATA PORTS"}, {"lang": "DE", "text": "INTEGRIERTE CACHESPEICHER AUF ZWEITER STUFE UND SPEICHERSTEUERUNG MIT MEHREREN DATENTOREN"}]}, {"ucid": "PL-316998-A1", "titles": [{"lang": "EN", "text": "INTEGRATED SECOND-LEVEL CACHE MEMORY AND MEMORY CONTROLLER WITH MULTIPLE-ACCESS DATA PORTS"}]}, {"ucid": "CN-1089462-C", "titles": [{"lang": "EN", "text": "Integrated level teo cache and memory controller with multiple data ports"}, {"lang": "ZH", "text": "采用集成的超高速缓存和存储器控制器的系统和方法"}]}, {"ucid": "BR-9502022-A", "titles": [{"lang": "EN", "text": "Computer system that includes a processing unit for parallel access to external cache memory and memory and method for transferring information between them"}, {"lang": "PT", "text": "Sistema de computador que inclui uma unidade de processamento de acesso paralelo à memória cache externa e memória e método para transferir informações entre eles"}]}, {"ucid": "CA-2142799-A1", "titles": [{"lang": "EN", "text": "INTEGRATED LEVEL TWO CACHE AND MEMORY CONTROLLER WITH MULTIPLE DATA PORTS"}, {"lang": "FR", "text": "CONTROLEURS D'ANTEMEMOIRE DE NIVEAU 2 ET DE MEMOIRE PRINCIPALE INTEGRES ET DOTES DE PORTS DE DONNEES MULTIPLES"}]}, {"ucid": "HU-T76241-A", "titles": [{"lang": "EN", "text": "COMPUTER SYSTEM, AS WELL AS METHOD OF TRANSMITTING INFORMATION FROM THE EXTERNAL CACHE AND THE MAIN MEMORY TO THE PROCESSOR OF THE COMPUTER SYSTEM"}]}, {"ucid": "HU-9603142-D0", "titles": [{"lang": "EN", "text": "INTEGRATED LEVEL TWO CACHE AND MEMORY CONTROLLER WITH MULTIPLE DATA PORTS"}]}, {"ucid": "CN-1123933-A", "titles": [{"lang": "EN", "text": "Integrated level teo cache and memory controller with multiple data ports"}, {"lang": "ZH", "text": "集成的二级超高速缓冲存储器和带有多路数据端口的存储器控制器"}]}, {"ucid": "JP-H07319767-A", "titles": [{"lang": "JA", "text": "コンピュータ・システム"}, {"lang": "EN", "text": "COMPUTER SYSTEM"}]}, {"ucid": "CZ-9603197-A3", "titles": [{"lang": "EN", "text": "Computer system and information transmission method"}, {"lang": "CS", "text": "Počítačový systém a způsob přenosu informace"}]}, {"ucid": "KR-950033837-A", "titles": [{"lang": "EN", "text": "Computer Systems and Information Transfer Methods"}, {"lang": "KO", "text": "컴퓨터 시스템과 정보 전송 방법"}]}, {"ucid": "PL-176554-B1", "titles": [{"lang": "PL", "text": "Sposób przesyłania informacji między jednostką przetwarzającą systemu komputerowego, zewnętrzną pamięcią podręczną i pamięcią główną oraz system komputerowy"}, {"lang": "EN", "text": "INTEGRATED SECOND-LEVEL CACHE MEMORY AND MEMORY CONTROLLER WITH MULTIPLE-ACCESS DATA PORTS"}]}, {"ucid": "US-6226722-B1", "titles": [{"lang": "EN", "text": "Integrated level two cache and controller with multiple ports, L1 bypass and concurrent accessing"}]}]}