{"patent_number": "US-6272617-B1", "publication_id": 72745435, "family_id": 25544591, "publication_date": "2001-08-07", "titles": [{"lang": "EN", "text": "System and method for register renaming"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA72594816\"><p>A system and method for performing register renaming of source registers in a processor having a variable advance instruction window for storing a group of instructions to be executed by the processor, wherein a new instruction is added to the variable advance instruction window when a location becomes available. A tag is assigned to each instruction in the variable advance instruction window. The tag of each instruction to leave the window is assigned to the next new instruction to be added to it. The results of instructions executed by the processor are stored in a temp buffer according to their corresponding tags to avoid output and anti-dependencies. The temp buffer therefore permits the processor to execute instructions out of order and in parallel. Data dependency checks for input dependencies are performed only for each new instruction added to the variable advance instruction window and register renaming is performed to avoid input dependencies.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00001\" num=\"1\"><claim-text>1. A computer system, comprising:</claim-text><claim-text>memory unit for storing program instructions; </claim-text><claim-text>a processor; and </claim-text><claim-text>a bus to transfer said program instructions from said memory unit to said processor, wherein said processor comprises: </claim-text><claim-text>an instruction window having registers for storing a plurality of instructions; </claim-text><claim-text>control logic that assigns a tag to at least each new dependent instruction that enters said instruction window, wherein said tag comprises a unique address in a temporary buffer where instruction execution results are stored; </claim-text><claim-text>a recycling queue that stores said tags; </claim-text><claim-text>a register renaming circuit that selects a tag assigned to a first instruction as a register address of a source register of a second instruction if said source register of said second instruction is dependent on said first instruction, wherein said selected tag is a renamed register address for said source register of said second instruction; and </claim-text><claim-text>a register file that stores said selected tag at an address location indicated by a tag assigned to said second instruction. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00002\" num=\"2\"><claim-text>2. The computer system of claim <b>1</b>, further comprising a data dependency checker that determines whether a source register of said second instruction is dependent on an instruction result of said first instruction.</claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00003\" num=\"3\"><claim-text>3. The computer system of claim <b>2</b>, wherein said data dependency checker comprises a priority encoder that determines a highest priority dependency for said first instruction.</claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00004\" num=\"4\"><claim-text>4. The computer system of claim <b>1</b>, wherein the instruction window is a variable advance instruction window.</claim-text></claim>"}, {"num": 5, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00005\" num=\"5\"><claim-text>5. The system of claim <b>1</b>, further comprising a retirement unit that determines whether said first instruction has retired.</claim-text></claim>"}, {"num": 6, "parent": 5, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00006\" num=\"6\"><claim-text>6. The system of claim <b>5</b>, further comprising a circuit that selects one of a renamed register address of said second instruction and a main register file address based on whether said first instruction has retired.</claim-text></claim>"}, {"num": 7, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00007\" num=\"7\"><claim-text>7. The computer system of claim <b>1</b>, further comprising a comparator that compares a tag of a retired instruction with renamed source addresses to determine whether a dependency exists.</claim-text></claim>"}, {"num": 8, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00008\" num=\"8\"><claim-text>8. A system for renaming source registers of instructions in an instruction window, comprising:</claim-text><claim-text>first control logic that assigns a tag to at least each new instruction in the instruction window, wherein each assigned tag comprises a unique address in a temporary buffer where instruction execution results are stored; </claim-text><claim-text>a rename circuit that selects a tag assigned to a first instruction in the instruction window as a register address of a source register of a second instruction in the instruction window if said source register of said second instruction is dependant on said first instruction, wherein said selected tag is a renamed register address for said source register of said second instruction; and </claim-text><claim-text>a register file that stores said selected tag at an address location indicated by a tag assigned to said second instruction. </claim-text></claim>"}, {"num": 9, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00009\" num=\"9\"><claim-text>9. The system of claim <b>8</b>, further comprising a recycling queue comprising a plurality of slots for storing said tags.</claim-text></claim>"}, {"num": 10, "parent": 9, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00010\" num=\"10\"><claim-text>10. The system of claim <b>9</b>, wherein said recycling queue comprises a plurality of slots equal in number to a predetermined size of the instruction window.</claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00011\" num=\"11\"><claim-text>11. The system of claim <b>10</b>, wherein an order defined by a position of said assigned tags in said recycling queue corresponds to an order of instructions in the instruction window.</claim-text></claim>"}, {"num": 12, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00012\" num=\"12\"><claim-text>12. The system of claim <b>8</b>, further comprising a data dependency checker that determines whether said source register of said second instruction is dependant on said first instruction.</claim-text></claim>"}, {"num": 13, "parent": 12, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00013\" num=\"13\"><claim-text>13. The system of claim <b>12</b>, wherein said data dependency checker comprises a priority encoder that determines a highest priority dependency for said source register of second instruction.</claim-text></claim>"}, {"num": 14, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00014\" num=\"14\"><claim-text>14. The system of clam <b>8</b>, wherein the instruction window is a variable advance instruction window.</claim-text></claim>"}, {"num": 15, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00015\" num=\"15\"><claim-text>15. The system of claim <b>8</b>, further comprising a retirement unit that transfers an execution result of said first instruction from said temporary buffer to a main register file.</claim-text></claim>"}, {"num": 16, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00016\" num=\"16\"><claim-text>16. The system of claim <b>15</b>, further comprising second control logic that detects whether said execution result of said first instruction has been transferred from said temporary buffer to said main register file and, upon an issuer selecting to execute said second instruction, retrieves said execution result from said main memory if said result has been transferred, otherwise said second control logic retrieves said execution result from said temporary buffer.</claim-text></claim>"}, {"num": 17, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00017\" num=\"17\"><claim-text>17. The system of claim <b>8</b>, further comprising a comparator that compares a tag of a retired instruction with renamed source addresses to determine whether a dependency exists.</claim-text></claim>"}, {"num": 18, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00018\" num=\"18\"><claim-text>18. The system of claim <b>8</b>, wherein said register file outputs said selected tag at a read data port of said register file when said tag assigned to said second instruction is applied to a read address port of said register file.</claim-text></claim>"}, {"num": 19, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00019\" num=\"19\"><claim-text>19. A computer system, comprising:</claim-text><claim-text>a memory unit for storing program instructions; </claim-text><claim-text>a processor; and </claim-text><claim-text>a bus to transfer said program instructions from said memory unit to said processor, said processor comprising: </claim-text><claim-text>an instruction window having registers for storing a plurality of instructions; </claim-text><claim-text>first control logic that assigns a tag to at least each new instruction in said instruction window, wherein each assigned tag comprises a unique address in a temporary buffer where instruction execution results are stored; </claim-text><claim-text>a rename circuit that selects a tag assigned to a first instruction in said instruction window as a register address of a source register of a second instruction in said instruction window if said source register of said second instruction is dependant on said first instruction, wherein said selected tag is a renamed register address for said source register of said second instruction; and </claim-text><claim-text>a register file that stores said selected tag at an address location indicated by a tag assigned to said second instruction. </claim-text></claim>"}, {"num": 20, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00020\" num=\"20\"><claim-text>20. The system of claim <b>19</b>, further comprising a recycling queue comprising a plurality of slots for storing said tags.</claim-text></claim>"}, {"num": 21, "parent": 20, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00021\" num=\"21\"><claim-text>21. The system of claim <b>20</b>, wherein said recycling queue comprises a plurality of slots equal in number to a predetermined size of the instruction window.</claim-text></claim>"}, {"num": 22, "parent": 21, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00022\" num=\"22\"><claim-text>22. The system of claim <b>21</b>, wherein an order defined by a position of said assigned tags in said recycling queue corresponds to an order of instructions in the instruction window.</claim-text></claim>"}, {"num": 23, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00023\" num=\"23\"><claim-text>23. The system of claim <b>19</b>, further comprising a data dependency checker that determines whether said source register of said second instruction is dependant on said first instruction.</claim-text></claim>"}, {"num": 24, "parent": 23, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00024\" num=\"24\"><claim-text>24. The system of claim <b>23</b>, wherein said data dependency checker comprises a priority encoder that determines a highest priority dependency for said source register of second instruction.</claim-text></claim>"}, {"num": 25, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00025\" num=\"25\"><claim-text>25. The system of claim <b>19</b>, wherein said instruction window is a variable advance instruction window.</claim-text></claim>"}, {"num": 26, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00026\" num=\"26\"><claim-text>26. The system of claim <b>19</b>, further comprising a retirement unit that transfers an execution result of said first instruction from said temporary buffer to a main register file.</claim-text></claim>"}, {"num": 27, "parent": 26, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00027\" num=\"27\"><claim-text>27. The system of claim <b>26</b>, further comprising second control logic that detects whether said execution result of said first instruction has been transferred from said temporary buffer to said main register file and, upon an issuer selecting to execute said second instruction, retrieves said execution result from said main memory if said result has been transferred, otherwise said second control logic retrieves said execution result from said temporary buffer.</claim-text></claim>"}, {"num": 28, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00028\" num=\"28\"><claim-text>28. The system of claim <b>19</b>, further comprising a comparator that compares a tag of a retired instruction with renamed source addresses to determine whether a dependency exists.</claim-text></claim>"}, {"num": 29, "parent": 19, "type": "dependent", "paragraph_markup": "<claim id=\"US-6272617-B1-CLM-00029\" num=\"29\"><claim-text>29. The system of claim <b>19</b>, wherein said register file outputs said selected tag at a read data port of said register file when said tag assigned to said second instruction is applied to a read address port of said register file.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES54704718\"><?RELAPP description=\"Other Patent Relations\" end=\"lead\"?><p>This application is a continuation of application Ser. No. 09/063,059, filed Apr. 21, 1998, U.S. Pat. No. 6,138,231, which is a continuation of application Ser. No. 08/698,211, filed Aug. 15, 1996, now U.S. Pat. No. 5,809,276, which is a continuation of application Ser. No. 08/478,531, filed Jun. 7, 1995, now U.S. Pat. No. 5,590,295, which is a continuation of application Ser. No. 07/997,948, filed Dec. 31, 1992, now abandoned.</p><h4>CROSS-REFERENCE TO RELATED APPLICATIONS</h4><p>The following are related, commonly owned, co-pending applications:</p><p><i>Superscalar RISC Instruction Scheduling, </i>Ser. No. 08/219,425, filed Mar. 29, 1994, now U.S. Pat. No. 5,497,499, which is a file wrapper continuation of Ser. No. 07/860,719, filed Mar. 31, 1992, now abandoned;</p><p><i>Semiconductor Floor Plan for a Register Renaming Circuit, </i>Ser. No. 07/860,718, filed Mar. 31, 1992, now U.S. Pat. No. 5,371,684;</p><p><i>System and Method for Retaining Instructions in a Superscalar Microprocessor, </i>Ser. No. 08/481,146, filed Jun. 7, 1995, now U.S. Pat. No. 5,826,055, which is a file wrapper continuation of Ser. No. 07/877,451, filed May 1, 1992, now abandoned;</p><p>High-Performance, Superscalar-Based Computer System with Out-of-Order Instruction Execution, Ser. No. 07/817,810, filed Jan. 8, 1992, now U.S. Pat. No. 5,539,911, which is a continuation of Ser. No. 07/727,006, filed Jul. 8, 1991, now abandoned;</p><p>High-Performance, Superscalar-Based Computer System with Out-of-Order Instruction Execution and Concurrent Results Distribution, Ser. No. 08/397,016, filed Mar. 1, 1995, now U.S. Pat. No. 5,560,032, which is a file wrapper continuation of Ser. No. 07/817,809, filed Jan. 8, 1992, now abandoned, which is a continuation of application Ser. No. 07/727,058, filed Jul. 8, 1991, now abandoned.</p><p>The above cited patent documents are incorporated herein by reference.</p><?RELAPP description=\"Other Patent Relations\" end=\"tail\"?><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>The present invention relates to superscalar reduced instruction set computers (RISC), more particularly, the present invention relates to a register renaming circuit for superscalar RISC computers.</p><p>2. Related Art</p><p>A more detailed description of some of the basic concepts discussed in this application is found in a number of references, including Mike Johnson, <i>Superscalar Microprocessor Design </i>(Prentice-Hall, Inc., Englewood Cliffs, N.J., 1991) (hereafter Johnson); John L. Hennessy et al., <i>Computer Architecture—A Quantitative Approach </i>(Morgan Kaufmann Publishers, Inc., San Mateo, Calif., 1990). Johnson's text, particularly Chapters 2, 6 and 7 provide an excellent discussion of the register renaming issues addressed by the present invention.</p><p>A major consideration in a superscalar RISC processor is to how to execute multiple instructions in parallel and out-of-order, without incurring data errors due to dependencies inherent in such execution. Data dependency checking, register renaming and instruction scheduling are integral aspects of the solution. A detailed discussion of storage conflicts, register renaming and dependency mechanisms is found in commonly owned, co-pending U.S. Pat. No. 5,497,499, (hereafter referred to as the '499 patent).</p><p>The '499 patent discloses a register renaming circuit (RRC) having a fixed instruction window. In the fixed instruction window, dependency checking and resource assignment is done on the same set of instructions until all the instructions in the set are completed. This means that there is a fixed relationship between each instruction's position in the instruction stream and the instruction number used for resource assignment.</p><p>For example, in an instruction stream with an instruction window of 4 instructions every fourth instruction mapps to instruction A (i.e., the first instruction in the window). This technique makes re-mapping of instruction very simple. In this case a 4-to-1 multiplexer is all that is necessary for each resource to forward a single instruction to that resource. However, the fixed format requires that the instruction window be advanced by a fixed amount, which results in somewhat inefficient processing.</p><p>When an instruction retires (an instruction can retire after it has been executed without exception and when all previous instructions have been executed and their results are stored in the register file), its result is moved into a main register file (i.e., the programmable visible register file) and if any instructions were dependent on that instruction, their renamed sources are not needed anymore. In the architecture disclosed in the '499 patent, all instructions' sources are renamed every cycle. This renaming technique requires many comparators for performing the dependency checks. More specifically, the source register addresses of each instruction must be compared to the destination register addresses of all preceding instructions in the instruction window every cycle.</p><p>What is desired is a more efficient register renaming technique requiring less comparators and permitting the processor to execute instructions in parallel and out of order.</p><h4>SUMMARY OF THE INVENTION</h4><p>The present invention is directed to a system and method for performing register renaming of source registers on a per-cycle basis only for new instructions added to the instruction window in that cycle. The present invention thus reduces the total number of dependency check comparators necessary for performing register renaming.</p><p>A preferred embodiment of the present invention comprises storing the instructions in a variable advance instruction window, and assigning a tag to each instruction in the instruction window. The tag of each retired instruction is assigned to the next new instruction to be added to the instruction window. The results of instructions executed by the processor are stored in a temp buffer according to their corresponding tags to avoid output dependencies and anti-dependencies. The temp buffer therefore permits the processor to execute instructions out of order and in parallel.</p><p>Data dependency checks are performed only for each new instruction added to the instruction window. Operands of the instructions having input dependencies are often located in the temporary buffer, and the source register addresses of those instructions having dependencies are renamed according to the tags of the operands located in the temp buffer. The renamed source register addresses are then stored in a rename result register file.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><p>The foregoing and other features and advantages of the present invention will be apparent from the following more particular description of the preferred embodiments of the invention, as illustrated in the accompanying drawings.</p><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>The invention will be better understood if reference is made to the accompanying drawings. A brief description of the drawings is as follows:</p><p>FIG. 1 shows a representative block diagram of a DDC equal compare circuit of the present invention.</p><p>FIG. 2 shows a representative block diagram of an N−1 input priority encoder of the present invention.</p><p>FIG. 3 shows a representative block diagram of the tag assignment logic (TAL) of the present invention.</p><p>FIG. 4 shows a representative block diagram of the TAL and priority encoder circuit of the present invention.</p><p>FIGS. 5A and 5B show representative block diagrams of the register rename block of the present invention.</p><p>FIG. 6 shows a representative block diagram of the register rename register file of the present invention.</p><p>FIG. 7 shows a representative block diagram of the interconnection of the blocks of FIGS. 5B and 6.</p><p>FIG. 8 shows a representative high level block diagram including the RRC of the present invention.</p><p>FIG. 9 shows a representative block diagram of a circuit to generate the address for one register file port.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF THE INVENTION</h4><p>The terms processor, CPU, and digital processor are often used interchangeably in this field. The term “processor” is used hereafter with the understanding that other similar terms could be substituted therefore without changing the underlying meaning of this disclosure.</p><p>The present invention is directed to a Register Renaming Circuit (RRC) which is part of a processor. The RRC permits the processor to execute instructions in parallel and out of order. In a preferred embodiment of the present invention, the processor has a variable advance instruction window (VAIW) for holding instructions from an instruction stream prior to execution. The RRC can be used with a fixed advance instruction window as well.</p><p>The VAIW in a preferred embodiment holds eight instructions, and up to four new instructions can be added to the top four locations of the VAIW in any one cycle.</p><p>In a VAIW, any one of instructions I<b>0</b>, I<b>1</b>, I<b>2</b> and I<b>3</b> can be mapped into the first location in the window (location A, for example). Tags are assigned to the instructions as the instructions enter the VAIW. The tags are stored in a first-in-first-out buffer (hereafter called a FIFO; not shown).</p><p>As an instruction advances in the VAIW by a variable amount, the tag associated with that instruction also advances in the FIFO by the same amount. When a new instruction enters the VAIW it is assigned the tag of the most recent instruction to leave the VAIW, thus tags are reused. Instructions can leave the VAIW by either retiring, or they can be flushed out if a branch is taken.</p><p>The tag of each instruction leaving the instruction window is returned to the head of the FIFO and re-used by the new instruction added to the window. However, the first instruction and tag in the FIFO always progress in order, because instructions always retire in order.</p><p>According to the present invention only new instructions in the VAIW need be checked for dependencies. This eliminates the need for excess comparators. New instructions in the window are therefore passed through the RRC. In order to reduce complexity by renaming the source registers for only those instructions that are new in the instruction window on a per-cycle basis, two assumptions are made:</p><p>1. Each instruction's tag remains constant as long as the instruction remains in the window. This tag is also associated with the location in a temp buffer (discussed below) that the corresponding instruction's output will be stored.</p><p>2. At most, only a subset (I<sub>n </sub>to I<sub>n-1</sub>) of the instructions in the window (I<sub>n </sub>to I<sub>0</sub>) can be new in any given cycle.</p><p>In a preferred embodiment of the present invention, the temp buffer (or temporary buffer) is part of the main register file. The register file contains 40 registers; registers <b>0</b>-<b>31</b> are the main registers (commonly called the programmer visible registers), and registers <b>32</b>-<b>39</b> comprise the temp buffer. The temp buffer and main register file share the same read ports. Thus, to read the data from temp buffer address <b>4</b>, {100100} would be the address on the read address port, for example.</p><p>In order to perform dependency checking in the present invention, an RRC Inputs Register File (RIRF) is used to hold the source and destination register addresses of all instructions in the instruction window. As new instructions enter the window an instruction fetch unit (IFU: not shown) sends the instructions' source and destination register addresses to the RIRF. The source and destination register addresses are stored in the RIRF by tag number. The RIRF has one output for each instruction in the window and the source and destination register addresses are read from the RIRF and sent to the RRC.</p><p>The RRC performs the data dependency checking and the register renaming. The data dependency check is done by the Data Dependency Checker (DDC) and the rename is performed by the Tag Assignment Logic (TAL).</p><p>There are three kinds of data dependencies: input dependencies, anti-dependencies and output dependencies. An instruction is input dependent on a previous instruction if one of its inputs is the previous instruction's output; an instruction is anti-dependent if the address of one of its source registers (RS) is the same as the address of a later instruction's destination register (RD); and an instruction is output dependent if the address of its destination register is the same as the address of another instruction's destination register.</p><p>Dependencies limit the amount of parallelism that a computer can exploit. For example, if instruction A is input dependent on instruction B, then instruction A must not be executed until after instruction B is executed. Also, if instruction A and B are output dependent and instruction A comes first in the program, then instruction A's result must be written to the main register file before instruction B's. Finally, if instruction A is anti-dependent on instruction B, then instruction B's result must not be written to the main register file until after instruction A has begun executing. Output and anti-dependencies are usually avoided by use of the temp buffer. Input dependencies cannot be avoided and are located by the DDC.</p><p>The DDC locates input dependencies by comparing the register file addresses of each instruction's sources with the register file addresses of each previous instruction's destination. If an instruction's input data comes from the same register file address as a previous instruction's output data, then they are dependent (the term “dependent” will be used to mean “input dependent” for the remainder of this description).</p><p>It is possible that an instruction can be dependent on several previous instructions. When this happens, the RRC assumes that the programmer intended that the instruction be dependent on the most previous instruction. For example, if instruction <b>5</b> depends on instructions <b>3</b> and <b>1</b>, then the RRC would assume that the programmer intended instruction <b>5</b> to use instruction <b>3</b>'s results and not instruction <b>1</b>'s.</p><p>A DDC equal compare circuit <b>100</b> for checking dependencies between instructions A and B in accordance with the present invention is shown in FIG. <b>1</b>. The output (A=B?) of the DDC equal compare circuit <b>100</b> is sent to a priority encoder. A n−1 input priority encoder <b>200</b> is shown in FIG. <b>2</b>. Priority encoder <b>200</b> checks the highest priority dependency for instruction n's source (I<sub>n</sub>RS). The inputs at the top of priority encoder <b>200</b> are the data dependency comparisons of instruction n's source (I<sub>n</sub>RS) with the destinations of all previous instructions (I<sub>n-1</sub>RD-I<sub>0</sub>RD), as determined by equal compare circuits <b>202</b>. For example, if the x<sup>th </sup>bit of the priority encoder output is asserted, then instruction n is input dependent on instruction x.</p><p>The present invention avoids the problems caused by output and anti-dependencies by storing the results of all instructions in the temp buffer and then moving the results into the main register file in program order. For example, if instruction <b>1</b> finishes before instruction <b>0</b>, its result will be written to the register file after instruction <b>0</b>'s result is written to the register file. The use of the temp buffer allows the processor to execute instructions out of order and in parallel. Since the results of the instructions are moved to the main register file in order, output and anti-dependencies do not cause a problem.</p><p>Since the result of an instruction can sit in the temp buffer for a long time before it gets moved to the main register file, instructions that are dependent on that instruction will also have to wait. In order to improve performance, the present invention includes a means with which to use data that is in the temp buffer. That means is the Tag Assignment Logic (TAL).</p><p>The TAL determines the location in the temp buffer of the operands of dependent instructions. As noted above all instructions are assigned a tag that remains constant while the instruction is in the window, and there is one location in the temp buffer for each instruction in the window. Thus, the processor implementing the present invention uses the tag of an instruction as the temp buffer address of that instruction's result.</p><p>Since the TAL knows where every instruction's result is stored, and since it also knows (from the DDC) where the dependencies are between instructions, the TAL can determine the location in the temp buffer of each instruction's inputs.</p><p>A representative block diagram of a TAL <b>300</b> used to determine the location of instruction n's source (RS) is shown in FIG. <b>3</b>. The outputs of the priority encoder are connected as select lines (as shown generally at <b>302</b>) to select the I<sub>n-1 </sub>through I<sub>0 </sub>TAGs, which are input at the top of TAL <b>300</b>. TAL <b>300</b> thus outputs the temp buffer address of instruction n's source.</p><p>A complete rename circuit for instruction n's source register is shown in FIG. <b>4</b>. The term for the renamed register file address of instruction n's source is INRS_TAG.</p><p>A representative block diagram of a rename circuit <b>500</b> of the present embodiment is shown in FIG. <b>5</b>A. The address of a new instruction's source register (I<sub>n</sub>RS) is shown input at the top of the rename circuit <b>500</b>. The destination register addresses of all preceding instructions in the window are input to rename circuit <b>500</b>, as shown generally at <b>502</b>. In addition, all the tags of all preceding instructions in the window are input to rename circuit <b>500</b>, as shown generally at <b>504</b>. Rename circuit <b>500</b> outputs a tag for the new instruction's source register (I<sub>n</sub>RS), as shown at <b>506</b>. The new I<sub>n</sub>RS tag is assigned by rename circuit <b>500</b> according to any dependencies, as discussed above in connection with the other embodiment(s). If the instruction has no dependencies the address input at the top input is simply passed to the output. Given a VAIW of 8 instructions and assuming that the temp buffers have the 8 highest addresses of the 40 total registers, the most significant bit of the rename circuit <b>500</b> output indicates whether the result is in the main register file or the temp buffer.</p><p>Renaming circuits <b>508</b> for renaming the source registers of a plurality of instructions are shown in FIG. <b>5</b>B. The number “i” in FIG. 5B corresponds to the maximum number of instructions in the window that can be new. In a preferred embodiment “i” is equal to 3; thus requiring 4 rename circuits.</p><p>Because renaming only happens when a new instruction enters the window, some technique is needed to store the outputs of the RRC. One technique would be to store the RRC results in a FIFO whenever the instruction window advances. The present embodiment, however, stores the renamed registers in a separate register file (discussed below). Since each instruction's tag stays constant, the renamed source register results from the rename circuits can be stored by tag number. The register file for storing the rename results therefore has one write port for each new instruction in the window and one read port for each instruction in the window.</p><p>A representative block diagram of a rename result register file (RRRF) <b>600</b> is shown in FIG. <b>6</b>. The renamed results are input as “WRITE DATA”, as shown generally at <b>601</b>. “READ ADDRESS” and “WRITE ADDRESS” tags are input to register file <b>600</b>, as shown generally at <b>602</b> and <b>604</b>, respectively. Renamed results for all the sources of all instructions in the window are available as “READ DATA”, as shown generally at <b>606</b>. FIG. 7 shows rename circuits <b>508</b> connected to rename result register file <b>600</b>.</p><p>When an instruction retires its result is moved into the main register file. If any instructions were dependent on that instruction, their renamed sources are not needed anymore.</p><p>The area to which new instructions can enter the instruction window (in this embodiment the area is the top four locations), are those locations which are register renamed. Once an instruction leases that area of the window it is no longer renamed. The RRC of the present invention renames an instruction's source register when it enters the window, so there needs to be a mechanism to detect which instructions' sources have been moved to the register file and to replace the renamed source register address with the original source register address. The first part of that mechanism is called MONDEP (as in “monitor dependencies”) and the second part is called RFMXING. In addition, a source register ready generator (RDY_GEN) is used to determine when each instruction's sources are available.</p><p>A representative high level block diagram of the RIRF, RRC, RRRF, MONDEP, RDY_GEN and RFMXING (labeled as <b>802</b>, <b>804</b>, <b>600</b>, <b>806</b>, <b>808</b> and <b>810</b>, respectively) is shown in FIG. <b>8</b>. Each block <b>802</b>, <b>804</b>, <b>600</b>, <b>806</b>, <b>808</b> and <b>810</b> receives the tags of all instructions in the instruction window from the tag FIFO (not shown). Implementation of the tag FIFO will become obvious to one skilled in the art.</p><p>Source and destination register addresses of new instructions from the IFU (not shown) are sent to RIRF <b>802</b> via a bus <b>812</b>, and are accessed by RRC <b>804</b> via a bus <b>814</b>. The source registers of all instructions are passed to RFMXING <b>806</b> via a bus <b>816</b>. Renamed source registers of all instructions are stored in RRRF <b>600</b> via a bus <b>818</b>. The stored renamed source registers of all instructions are passed to RFMXING <b>806</b>, MONDEP <b>808</b> and RDY_GEN <b>810</b> via a bus <b>820</b>.</p><p>MONDEP <b>808</b> determines which dependencies have disappeared by comparing the tags of retiring or recently-retired instructions with the lower three bits of the renamed sources of each instruction. Information regarding retired instructons is sent to MONDEP <b>808</b> via a bus <b>828</b> from a retirement unit (not shown; the details of a retirement unit that can be used to generate these signals is disclosed in co-pending, commonly owned U.S. Pat. No. 5,826,055. If there is a match, then MONDEP <b>808</b> knows that the dependency has been removed and the outputs of MONDEP <b>808</b> outputs which instructions' inputs have been moved from the temp buffer to the register file. These outputs signals are sent to RFMXING <b>806</b> and RDY_GEN <b>810</b> via buses <b>822</b>.</p><p>In a preferred embodiment of the present invention, the instruction window holds eight instructions. Each cycle, at most three of those instructions can be retired. In the cycle after an instruction is retired, its tag is moved to the top of the FIFO. Therefore, to check what dependencies have been removed, MONDEP <b>808</b> compares each of the renamed sources of each instruction with the tags of the top three instructions in the FIFO. In a further embodiment MONDEP <b>808</b> can compare each renamed source with the tags of the instructions at the bottom of the FIFO that are about to be retired.</p><p>MONDEP <b>808</b> outputs a bit for each source of each instruction and the bits are sent to RFMXING and RDY_GEN blocks in the RRC. These bits are asserted when an instruction's dependency goes away and remain asserted until the instruction is retired.</p><p>RDY_GEN <b>810</b> determines when each instruction's sources are available and outputs this information via a bus <b>830</b>. The difference between MONDEP <b>808</b> and RDY_GEN <b>810</b> is MONDEP <b>808</b> only monitors when instructions retire. An instruction does not have to wait until another instruction retires to use its result; it only needs to wait until it is done (an instruction is done when its result is entered into the temp buffer). Also, if an instruction has no dependencies, then it can be executed immediately. Information concerning whether an instruction is “done” is input to RDY_GEN <b>810</b> via a bus <b>832</b>. “Done” signals come from done control logic (not shown). In connection with the present invention, the term “done” means the result of the instruction is in a temporary buffer or otherwise available at the output of a functional unit. (An example of done control logic may be found the '719 application.)</p><p>RDY_GEN <b>810</b> has one output for each source of all instructions in the window. The output for a particular instruction's source is assured if one of three conditions is true:</p><p>1. The source was never dependent on any other instruction.</p><p>2. The instruction that the source was dependent on is done and its result is in the temp buffer.</p><p>3. The instruction that the source was dependent on is retired and its result has been moved from the temp buffer to the register file.</p><p>These outputs <b>830</b> of RDY_GEN <b>810</b> go to the ISSUER which determines which instruction(s) is to issued based on functional unit availability and lack of dependencies.</p><p>RFMXING <b>806</b> is used to generate the read addresses of the register files. It contains a collection of muxes for each read port of each register file. These muxes are selected by the outputs of the ISSUER and MONDEP <b>808</b>. Read addresses for each port of each register file are output by RFMXING <b>806</b>, via a bus <b>824</b>. (A processor may have a separate register file for a floating point subprocessor and an integer subprocessor, for example.)</p><p>The circuit to generate the address for one register file port is shown in FIG. <b>9</b>. The ISSUER decides which instructions to execute and which register file ports to use for each instruction by sending select signals via a bus <b>826</b> to RFMXING <b>806</b>. MONDEP <b>808</b> decides which instructions sources have been moved from the register file and which are still inside the temp buffer via bus <b>822</b>. For example, if one assumes that the ISSUER decides to execute instruction I<sub>n </sub>and I<sub>n </sub>is dependent on I<sub>n-1</sub>; then the ISSUER will select (via select signals <b>826</b>) two top multiplexers (mux) <b>902</b> and <b>904</b> and choose I<sub>n</sub>RS (I<sub>n</sub>'s original source register address) and I<sub>n</sub>RS_TAG. If it has, MONDEP <b>808</b> will select, using a third mux <b>906</b>, the output of mux <b>902</b> on the left and send I<sub>n</sub>RS to the register file. If not, it will choose the output of mux <b>904</b> on the right and send the I<sub>n</sub>RS_TAG to the register file.</p><p>While various embodiments of the present invention have been described above, it should be understood that they have been presented by way of example, and not limitation. Thus the breadth and scope of the present invention should not be limited by any of the above-described exemplary embodiments, but should be defined only in accordance with the following claims and their equivalents. All cited patent documents and publications in the above description are incorporated herein by reference.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Trevor A.", "last_name": "Deosaran", "name": ""}, {"first_name": "Sanjiv", "last_name": "Garg", "name": ""}, {"first_name": "Kevin R.", "last_name": "Iadonato", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "SEIKO EPSON CORPORATION"}, {"first_name": "", "last_name": "SAMSUNG ELECTRONICS CO., LTD.", "name": ""}], "ipc_classes": [{"primary": true, "label": "G06F  15/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G06F   9/38        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "712023"}, {"primary": false, "label": "712217"}, {"primary": false, "label": "712215"}, {"primary": false, "label": "712E09049"}, {"primary": false, "label": "712E09071"}], "ecla_classes": [{"label": "G06F   9/38E8"}, {"label": "G06F   9/38E1R"}, {"label": "G06F   9/38E1"}, {"label": "G06F   9/38E"}, {"label": "G06F   9/38T"}], "cpc_classes": [{"label": "G06F   9/3857"}, {"label": "G06F   9/384"}, {"label": "G06F   9/3838"}, {"label": "G06F   9/384"}, {"label": "G06F   9/3857"}, {"label": "G06F   9/3838"}, {"label": "G06F   9/38"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1992-12-31", "application_date": "1999-09-17", "family_members": [{"ucid": "US-5590295-A", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-5809276-A", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-6138231-A", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "JP-H08505724-A", "titles": [{"lang": "EN", "text": "Register renaming system and method"}, {"lang": "JA", "text": "レジスタ・リネーミングのシステム及び方法"}]}, {"ucid": "DE-69330889-D1", "titles": [{"lang": "EN", "text": "System and procedure for changing register names"}, {"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}]}, {"ucid": "WO-1994016384-A1", "titles": [{"lang": "FR", "text": "SYSTEME ET PROCEDE PERMETTANT DE CHANGER LE NOM D'UN REGISTRE"}, {"lang": "EN", "text": "SYSTEM AND METHOD FOR REGISTER RENAMING"}]}, {"ucid": "EP-0682789-B1", "titles": [{"lang": "DE", "text": "SYSTEM UND VERFAHREN ZUR ÄNDERUNG DER NAMEN VON REGISTERN"}, {"lang": "EN", "text": "SYSTEM AND METHOD FOR REGISTER RENAMING"}, {"lang": "FR", "text": "SYSTEME ET PROCEDE POUR CHANGER LA DESIGNATION DES REGISTRES"}]}, {"ucid": "HK-1014786-A1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "JP-3531166-B2", "titles": [{"lang": "JA", "text": "レジスタ・リネーミングのシステム及び方法"}, {"lang": "EN", "text": "Register renaming system and method"}]}, {"ucid": "DE-69330889-T2", "titles": [{"lang": "EN", "text": "System and method for changing register names"}, {"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}]}, {"ucid": "EP-0849665-A2", "titles": [{"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}, {"lang": "EN", "text": "System and method for register renaming"}, {"lang": "FR", "text": "Système et procédé pour changer la désignation de registres"}]}, {"ucid": "EP-1107111-A3", "titles": [{"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}, {"lang": "EN", "text": "System and method for register renaming"}, {"lang": "FR", "text": "Système et procédé pour changer la désignation de registres"}]}, {"ucid": "EP-0682789-A1", "titles": [{"lang": "DE", "text": "SYSTEM UND VERFAHREN ZUR ÄNDERUNG DER NAMEN VON REGISTERN"}, {"lang": "EN", "text": "SYSTEM AND METHOD FOR REGISTER RENAMING"}, {"lang": "FR", "text": "SYSTEME ET PROCEDE POUR CHANGER LA DESIGNATION DES REGISTRES"}]}, {"ucid": "EP-0849665-A3", "titles": [{"lang": "EN", "text": "System and method for register renaming"}, {"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}, {"lang": "FR", "text": "Système et procédé pour changer la désignation de registres"}]}, {"ucid": "US-6272617-B1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-6922772-B2", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-7979678-B2", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-6408375-B2", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-20020194456-A1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-20060020773-A1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "KR-967000474-A", "titles": []}, {"ucid": "EP-0849665-B1", "titles": [{"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}, {"lang": "EN", "text": "System and method for register renaming"}, {"lang": "FR", "text": "Système et procédé pour changer la désignation de registres"}]}, {"ucid": "US-20020083300-A1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-20090235053-A1", "titles": [{"lang": "EN", "text": "System and Method for Register Renaming"}]}, {"ucid": "EP-1107111-A2", "titles": [{"lang": "DE", "text": "System und Verfahren zur Änderung der Namen von Registern"}, {"lang": "EN", "text": "System and method for register renaming"}, {"lang": "FR", "text": "Système et procédé pour changer la désignation de registres"}]}, {"ucid": "US-7558945-B2", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-6970995-B2", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "US-20010011343-A1", "titles": [{"lang": "EN", "text": "System and method for register renaming"}]}, {"ucid": "DE-69320991-T2", "titles": [{"lang": "EN", "text": "SYSTEM AND METHOD FOR CHANGING THE NAMES OF REGISTERS"}, {"lang": "DE", "text": "SYSTEM UND VERFAHREN ZUR ÄNDERUNG DER NAMEN VON REGISTERN"}]}, {"ucid": "DE-69320991-D1", "titles": [{"lang": "EN", "text": "SYSTEM AND METHOD FOR CHANGING THE NAMES OF REGISTERS"}, {"lang": "DE", "text": "SYSTEM UND VERFAHREN ZUR ÄNDERUNG DER NAMEN VON REGISTERN"}]}, {"ucid": "HK-1025161-A1", "titles": [{"lang": "EN", "text": "SYSTEM AND METHOD FOR REGISTER RENAMING"}]}, {"ucid": "KR-100292300-B1", "titles": [{"lang": "KO", "text": "레지스터재명명시스템및방법"}, {"lang": "EN", "text": "SYSTEM AND METHOD FOR REGISTER RENAMING"}]}, {"ucid": "KR-960700474-A", "titles": [{"lang": "EN", "text": "Register Renaming System and Method"}, {"lang": "KO", "text": "레지스터 재명명 시스템 및 방법"}]}]}