{"patent_number": "US-6502218-B1", "publication_id": 73251753, "family_id": 23831765, "publication_date": "2002-12-31", "titles": [{"lang": "EN", "text": "Deferred correction of a single bit storage error in a cache tag array"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA50429094\"><p>Methods and apparatus defer correction of an error in a tag entry of a cache tag array. An address of requested data, including an address tag field, can be received by a cache. A first hit indication based at least in part on a comparison of the address tag field and a first tag entry can be generated and result in outputting of a first data entry of a data array. An error in the tag entry can be detected, and the first data entry can be disregard based at least in part on the detected error.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00001\" num=\"1\"><claim-text>1. A method to defer correction of an error in a tag entry of a cache tag array, the method comprising:</claim-text><claim-text>receiving an address of requested data, the address including an address tag field; </claim-text><claim-text>receiving a micro-operation; </claim-text><claim-text>determining whether to defer the correction of the error based on the micro-operation; field and a first tag entry; </claim-text><claim-text>outputting a first data entry of a data array based at least in part on the first hit indication; </claim-text><claim-text>detecting an error in the tag entry; and </claim-text><claim-text>disregarding the first data entry based at least in part on detecting the error in the tag entry and the micro-operation. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00002\" num=\"2\"><claim-text>2. The method of <claim-ref idref=\"US-6502218-B1-CLM-00001\">claim 1</claim-ref>, the method further comprising:</claim-text><claim-text>generating an error correction indication; </claim-text><claim-text>generating a corrected tag entry based at least in part on correcting the error in the first tag entry; </claim-text><claim-text>generating a second hit indication based at least in part on a second comparison of the address tag field and the corrected tag entry; and </claim-text><claim-text>selecting the second hit indication for output to the data array based at least in part on the received error correction indication. </claim-text></claim>"}, {"num": 3, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00003\" num=\"3\"><claim-text>3. The method of <claim-ref idref=\"US-6502218-B1-CLM-00002\">claim 2</claim-ref>, wherein</claim-text><claim-text>generating an error correction indication is based at least in part in response to receiving the tag entry error indication. </claim-text></claim>"}, {"num": 4, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00004\" num=\"4\"><claim-text>4. The method of <claim-ref idref=\"US-6502218-B1-CLM-00002\">claim 2</claim-ref>, further comprising</claim-text><claim-text>outputting a second data entry of the data array based at least in part on the second hit indication. </claim-text></claim>"}, {"num": 5, "parent": 2, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00005\" num=\"5\"><claim-text>5. The method of <claim-ref idref=\"US-6502218-B1-CLM-00002\">claim 2</claim-ref>, wherein:</claim-text><claim-text>detecting an error in the tag entry is based at least in part on ECC error detection; and </claim-text><claim-text>generating a corrected tag entry based at least in part on correcting the error in the first tag entry is further based at least in part on ECC error correction. </claim-text></claim>"}, {"num": 6, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00006\" num=\"6\"><claim-text>6. The method of <claim-ref idref=\"US-6502218-B1-CLM-00001\">claim 1</claim-ref>, wherein</claim-text><claim-text>generating a tag entry error indication includes sending a tag entry error indication to a processor. </claim-text></claim>"}, {"num": 7, "parent": 6, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00007\" num=\"7\"><claim-text>7. The method of <claim-ref idref=\"US-6502218-B1-CLM-00006\">claim 6</claim-ref>, further comprising</claim-text><claim-text>sending the address of requested data to at least one of a next level cache and a next level memory. </claim-text></claim>"}, {"num": 8, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00008\" num=\"8\"><claim-text>8. The method of <claim-ref idref=\"US-6502218-B1-CLM-00001\">claim 1</claim-ref>, wherein disregarding the first data entry based at least in part on detecting the error in the tag entry includes:</claim-text><claim-text>in response to the detected error, generating a tag entry error indication; and </claim-text><claim-text>disregarding the first data entry based at least in part on the tag entry error indication. </claim-text></claim>"}, {"num": 9, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00009\" num=\"9\"><claim-text>9. A method to defer correction of a single-bit error in a tag entry of a cache tag array, the method comprising:</claim-text><claim-text>receiving a micro-operation; </claim-text><claim-text>determining whether to defer correction of the single-bit error based on the micro-operation; </claim-text><claim-text>detecting a single-bit error in a first tag entry; </claim-text><claim-text>sending a tag entry single-bit error signal to a controller; </claim-text><claim-text>correcting the single-bit error in the first tag entry, the correcting including generating a corrected tag entry; </claim-text><claim-text>receiving an error correction signal from the controller, the error correction signal based at least in part on the error signal and the micro-operation; </claim-text><claim-text>generating a hit signal based at least in part on a comparison of the corrected tag entry and a tag field of an address of requested data; and </claim-text><claim-text>selecting the hit signal to be output to a data array based at least in part on the received error correction signal. </claim-text></claim>"}, {"num": 10, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00010\" num=\"10\"><claim-text>10. A method to read data from a cache, the method comprising:</claim-text><claim-text>sending an address of requested data to the cache; </claim-text><claim-text>sending a micro-operation to the cache; </claim-text><claim-text>sending an error correction disable signal to the cache; </claim-text><claim-text>receiving a first data entry from the cache; </claim-text><claim-text>receiving a single-bit tag error signal from the cache; and </claim-text><claim-text>disregarding the first data entry based at least in part on the received single-bit tag error signal and the micro-operation. </claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00011\" num=\"11\"><claim-text>11. The method of <claim-ref idref=\"US-6502218-B1-CLM-00010\">claim 10</claim-ref>, the method further comprising:</claim-text><claim-text>sending an error correction enable signal to the cache; and </claim-text><claim-text>receiving a second data entry from the cache. </claim-text></claim>"}, {"num": 12, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00012\" num=\"12\"><claim-text>12. The method of <claim-ref idref=\"US-6502218-B1-CLM-00010\">claim 10</claim-ref>, the method further comprising:</claim-text><claim-text>sending an error correction enable signal to the cache; </claim-text><claim-text>receiving a cache miss signal generated at least in part in response to the error correction enable signal; and </claim-text><claim-text>sending the address of requested data to at least one of a next level cache and a next level memory. </claim-text></claim>"}, {"num": 13, "parent": 12, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00013\" num=\"13\"><claim-text>13. The method of <claim-ref idref=\"US-6502218-B1-CLM-00012\">claim 12</claim-ref>, further comprising</claim-text><claim-text>sending a flush cache directive to the cache. </claim-text></claim>"}, {"num": 14, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00014\" num=\"14\"><claim-text>14. An apparatus to defer correction of a single-bit error in a tag entry of a cache tag array, the apparatus comprising:</claim-text><claim-text>a tag array; </claim-text><claim-text>a comparator, coupled to said tag array, to output a hit signal; </claim-text><claim-text>an error detection circuit, coupled to said tag array, to output an error signal; and </claim-text><claim-text>a control circuit, coupled to the error detection circuit, to generate a forced miss signal based at least in part on the error signal and a micro-operation. </claim-text></claim>"}, {"num": 15, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00015\" num=\"15\"><claim-text>15. An apparatus to defer correction of an error in a tag entry of a cache tag array, the apparatus comprising:</claim-text><claim-text>a tag array; </claim-text><claim-text>a first comparator, coupled to said tag array, to output a first hit signal; </claim-text><claim-text>an error detection circuit, coupled to said tag array, to output an error signal; </claim-text><claim-text>an error correction circuit, coupled to said error detection circuit; </claim-text><claim-text>a second comparator, coupled to said error correction circuit, to output a second hit signal; and </claim-text><claim-text>a multiplexer, coupled to each of said first comparator and said second comparator, to output one of the first hit signal and the second hit signal based at least in part on an error correction signal and a micro-operation. </claim-text></claim>"}, {"num": 16, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00016\" num=\"16\"><claim-text>16. The apparatus of <claim-ref idref=\"US-6502218-B1-CLM-00015\">claim 15</claim-ref>, wherein:</claim-text><claim-text>said first comparator is to output the first hit signal based at least in part on a first comparison of a first tag entry received from said tag array and a tag field of an address of requested data; </claim-text><claim-text>said error correction circuit is to receive the first tag entry and output a corrected tag entry; and </claim-text><claim-text>said second comparator is to output the second hit signal based at least in part on a second comparison of the corrected tag entry and the tag field of the address of requested data. </claim-text></claim>"}, {"num": 17, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00017\" num=\"17\"><claim-text>17. The apparatus of <claim-ref idref=\"US-6502218-B1-CLM-00015\">claim 15</claim-ref>, the apparatus further comprising</claim-text><claim-text>a data array coupled to said multiplexer. </claim-text></claim>"}, {"num": 18, "parent": 15, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00018\" num=\"18\"><claim-text>18. The apparatus of <claim-ref idref=\"US-6502218-B1-CLM-00015\">claim 15</claim-ref>, the apparatus further comprising</claim-text><claim-text>a controller, coupled to said error detection circuit and said multiplexer. </claim-text></claim>"}, {"num": 19, "parent": 18, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00019\" num=\"19\"><claim-text>19. The apparatus of <claim-ref idref=\"US-6502218-B1-CLM-00018\">claim 18</claim-ref>, wherein:</claim-text><claim-text>said controller is to receive the error signal; and </claim-text><claim-text>said controller is send the error correction signal to said multiplexer. </claim-text></claim>"}, {"num": 20, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00020\" num=\"20\"><claim-text>20. A system to defer correction of an error in a tag entry of a cache tag array, the system comprising:</claim-text><claim-text>a processor; </claim-text><claim-text>a memory, said memory coupled to said processor; and </claim-text><claim-text>a cache, said cache coupled to said processor, said cache including a tag array, </claim-text><claim-text>a comparator, coupled to said tag array, to output a first hit signal, </claim-text><claim-text>an error detection circuit, coupled to said tag array, to output an error signal, and </claim-text><claim-text>a control circuit, coupled to the error detection circuit, to generate a forced miss signal based at least in part on the error signal and a micro-operation. </claim-text></claim>"}, {"num": 21, "parent": 20, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00021\" num=\"21\"><claim-text>21. The system of <claim-ref idref=\"US-6502218-B1-CLM-00020\">claim 20</claim-ref>, wherein</claim-text><claim-text>said comparator is to output the first hit signal based at least in part on a first comparison of a first tag entry received from said tag array and a tag field of an address of requested data. </claim-text></claim>"}, {"num": 22, "parent": 21, "type": "dependent", "paragraph_markup": "<claim id=\"US-6502218-B1-CLM-00022\" num=\"22\"><claim-text>22. The system of <claim-ref idref=\"US-6502218-B1-CLM-00021\">claim 21</claim-ref>, the system further comprising:</claim-text><claim-text>a single-bit error correction circuit to receive the first tag entry and output a corrected tag entry; and </claim-text><claim-text>a second comparator to output a second hit signal based at least in part on a second comparison of the corrected tag entry and the tag field of the address of requested data. </claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES53689289\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>FIELD OF THE INVENTION</h4><p>Embodiments of the present invention relate to reading data from a cache. More particularly, embodiments of the present invention relate to a deferring correction of a single bit storage error in a cache tag array.</p><h4>BACKGROUND OF THE INVENTION</h4><p>Central processing units (CUPS) can now operate significantly faster than main memory. To address the increased disparity in operation speeds between CUPS and main memory, CUPS typically include larger cache memory (e.g., a larger level 1 (L1) cache, a larger level 2 (L2) cache, etc.) to increase system performance. Cache memory temporarily stores data (e.g., code; system data, etc.) that is requested from, and written to, main memory by the CPU. When a CPU requests a specific block of data identified by an address (e.g., a code address, a data address), that address can be passed to a cache to determine whether the requested block of data is stored within the cache memory. Cache memory typically operates at a speed that is significantly faster than the main memory and closer to the speed of the processor. In addition to storing blocks of data, a cache includes a tag array. Each tag in the tag array corresponds to an address of a block of data stored in the cache. After the cache receives an address of a requested block of data, the cache can determine whether the address corresponds to a tag stored in the tag array and consequently whether the requested block of data is stored in the cache.</p><p>Larger CPU cache sizes can result in a larger tag array, and a larger tag array can have a higher probability of incurring a soft error. A soft error can be caused by background cosmic radiation (e.g., alpha particles) that impacts the tag array and causes a bit to logically flip. The increased incidence of soft errors in tag arrays also can be related to the use of lower voltage integrated circuit technologies (e.g., changes from 5 volts, to 3.3 volts, to 2 volts, to 1 volt, etc.). Soft errors may result in lower levels of correctness in a cache and disadvantageously effect the robustness of cache performance.</p><p>In a known cache design, detection and correction of errors in the stored data increases cache read latency. An example of a known methodology of detection and correction of stored data errors is Error Checking and Correction (ECC), by which errors at the bit level or multiple-bit level in memory can be intercepted and corrected as data is being sent to a CPU. Under the ECC methodology, for each data word there is a set of extra bits (i.e., an ECC code) that is used to store an encrypted version of the data word. Each data word includes a corresponding ECC code. The number of extra bits that comprise the ECC code depends on the length of the binary word of data. For a 32-bit data word, an ECC code includes seven bit. A 64-bit data word requires an additional 8 bits for the ECC code.</p><p>FIG. 1 shows a known cache system design. Cache <b>100</b> includes a tag array <b>101</b> and a data array <b>102</b>. Tag array <b>101</b> includes a plurality of tag entries <b>111</b>, and data array <b>102</b> includes a plurality of data entries <b>112</b>. Each tag entry of the plurality of tag entries <b>111</b> corresponds to a data entry of the plurality of data entries <b>112</b>.</p><p>Cache controller <b>110</b> is coupled to cache <b>100</b> and can send an address of requested data to the cache <b>100</b>. As used to describe embodiments of the present invention, coupled means connected directly or indirectly. A comparator <b>105</b> of cache <b>100</b> compares a portion of the address of requested data (e.g., an address tag field of the address of requested data) to a tag entry of tag array <b>101</b> after the tag entry is processed by ECC detection logic <b>103</b> and ECC correction logic <b>104</b>.</p><p>For example, the tag entry can include an ECC code. The tag entry and its corresponding ECC code can be compared by the ECC detection logic <b>103</b> when the tag entry is read from the tag array <b>101</b>. When the code and the data word do not match, then the data word can be corrected using the ECC code by the ECC correction logic <b>104</b>.</p><p>Detecting and correcting errors in the tag array using known methods (e.g. ECC) may disadvantageously increase cache read latency because a corrected tag entry can be required to determine whether requested data (e.g. an instruction, a data word, etc.) is present in the cache. For example, depending on the clock rates used and other design criteria of a CPU and the cache, performing ECC upon a tag entry can add an additional clock cycle of latency to a data request from the cache. When a cache access requires 5 clock cycles without performing ECC on a tag entry, then an additional clock cycle required for ECC can impose a twenty percent performance penalty upon cache access. In view of the foregoing, it can be appreciated that a substantial need exists for a method and system which can advantageously defer correction of detected errors in the tag array.</p><h4>SUMMARY OF THE INVENTION</h4><p>Embodiments of the present invention include methods and apparatus to defer correction of an error in a tag entry of a cache tag array. A cache can receive an address of requested data, including an address tag field. A first hit indication based at least in part on a comparison of the address tag field and a first tag entry can be generated. Based at least in part on the first hit indication, a first data entry of a data array can be output. An error in the tag entry can be detected, and the first data entry can be disregard based at least in part on the detected error.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 shows a known system for correcting errors in the TAG array of a cache.</p><p>FIG. 2 shows an apparatus in accordance with an embodiment of the present invention.</p><p>FIG. 3 shows a method in accordance with an embodiment of the present invention.</p><p>FIG. 4 shows a system in accordance with an embodiment of the present invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION</h4><p>Embodiments of methods and apparatus to defer correcting errors in tag entries of a tag array are described. In the following description, for purposes of explanation, numerous specific details are set forth to provide a thorough understanding of the present invention. It will be appreciated, however, by one skilled in the art that the present invention may be practiced without these specific details. In other instances, structures and devices are shown in block diagram form Furthermore, one skilled in the art can readily appreciate that the specific sequences in which methods are presented and performed are illustrative and it is contemplated that the sequences can be varied and still remain within the spirit and scope of the present invention.</p><p>FIG. 2 shows an apparatus in accordance with an embodiment of the present invention. In an embodiment of the present invention, data access from a cache can be selectively controlled such that the data access is typically based on a hit indication generated without performing ECC detection and correction upon tag entries. Performing ECC detection and correction upon tag entries can increase the latency of data access. In the event of an error in a tag entry, the data access can be based upon an ECC corrected tag entry.</p><p>In one embodiment, cache <b>200</b> includes a tag array <b>201</b> and a data array <b>202</b>. A cache controller <b>281</b> is coupled to cache <b>200</b> and can send an address of requested data to the cache <b>200</b>. A first comparator <b>221</b> and a second comparator <b>222</b> can each receive at least an address tag field of the address of requested data. The first comparator <b>221</b> can generate a first hit indication based on a comparison of the address tag field and a first tag entry of the tag array <b>201</b>.</p><p>The first tag entry can be received by ECC detection logic <b>210</b> that can detect whether the first tag entry has a single-bit error, e.g., by comparing an ECC code portion of the first tag entry to a tag portion of the first tag entry. When a single-bit error is detected, the ECC detection logic <b>210</b> can generate a error detected signal. ECC correction logic <b>211</b> can receive the first tag entry, correct the single-bit error, and generate a corrected tag entry. The corrected tag entry can be received by the second comparator <b>222</b>. The second comparator <b>222</b> can generate a second hit indication based on a comparison of the address tag field and the corrected tag entry.</p><p>Each of the first hit indication and the second hit indication can be received by a multiplexer <b>225</b>. The multiplexer <b>225</b> can selectively output one of the first hit indication (generated without ECC detection and/or correction performed) and the second hit indication (generated with ECC detection and correction performed) based on the status of an ECC correct signal output by cache controller <b>281</b>. In one embodiment, access of data from the data array <b>202</b> is based on the output of the multiplexer <b>225</b>, e.g., either the first hit indication or the second hit indication.</p><p>The ECC correct signal can be generated by the cache controller <b>281</b> in response to the error detected signal generated by the ECC detection logic <b>210</b>. In one embodiment, the error detected signal is low (e.g., a logical zero, a voltage close to zero volts, etc.) in the absence of any single-bit error in a tag entry, and goes to high (e.g., to a logical one, to a voltage of 5 volts, to a voltage of 3.3 volts, to a voltage of 2.5 volts, etc.) to indicate that a single-bit error has been detected. When the cache controller <b>281</b> receives an error detected indication, it can generate an ECC correct signal to the cache <b>200</b> indicating that data access from the cache <b>200</b> should be based on an ECC corrected tag entry. In one embodiment, when the error detected signal goes high (e.g., to indicate detection of a single-bit error in a tag entry), the ECC correct signal goes high (e.g., to indicate data access from the cache should be based on an ECC corrected tag entry).</p><p>In one embodiment, when the ECC detected signal is low and indicating no detected single-bit error in a tag entry, then the ECC correct signal is low and multiplexer <b>225</b> selects the first hit indication output by first comparator <b>221</b> to control data access from the data array <b>202</b>. The first hit indication is generated without a delay caused by performing ECC detection and correction, and a first data entry of the data array <b>202</b> can be accessed based on the first hit indication. When the ECC detected signal goes high to indicate that a single-bit error in a tag entry has been detected, then the ECC correct signal goes high so that multiplexer <b>225</b> selects the second hit indication output by second comparator <b>222</b> to control data access from the data array <b>202</b>. A forced miss can be generated by the cache controller <b>281</b> in response to the error detected signal indicating a single-bit error so that the first data entry previously accessed will be disregarded. After the multiplexer <b>225</b> selects the second hit indication to control data access from the data array <b>202</b>, a second data entry of the data array <b>202</b> can be accessed based on the second hit indication.</p><p>Embodiments of the present invention are described with respect to detection and correction of single-bit errors in tag entries. Based upon system performance characteristics and the latency caused by correction of detected errors in tag entries, other embodiments of the present invention include methods and apparatus to defer correction of other errors (e.g., double-bit errors, etc.) in tag entries in addition to single-bit errors in tag entries.</p><p>FIG. 3 shows a method in accordance with an embodiment of the present invention. A cache receives an address of requested data and a micro-operation (<b>305</b>). Examples of a cache micro-operation include an RLU (read with LRU (least recently used) update), TI (tag inquire), TRR (tag read, data read), TWR (tag write, data read), TWW (tag write, data write), TW (tag write), and EVICT (eviction). The cache performs a tag lookup (<b>310</b>). It is determined whether the micro-operation is an RLU(<b>315</b>).</p><p>When the micro-operation is not an RLU, then it is determined whether there is a single-bit error in the tag (<b>320</b>). When there is a single-bit error, then the single-bit error is corrected (<b>325</b>) and the tag and a tag field of the address of requested data are compared (<b>330</b>). When there is no single-bit error, then the tag and a tag field of the address of requested data are compared (<b>330</b>) without correction of any single-bit error. Based upon the tag and tag field comparison, the hit/miss information is sent from the cache (e.g., a data entry corresponding to the hit, a miss indication, etc.) (<b>335</b>).</p><p>When the micro-operation is an RLU, then the tag and a tag field of the address of requested data are compared (<b>350</b>) and a first hit/miss information is sent from the cache (e.g., a first data entry corresponding to a hit, a miss indication, etc.). Whether or not there is a single-bit error in the tag is determined (<b>360</b>). When there is no single-bit error, then the first hit/miss information is accurate and has been accessed without a delay caused by error detection and/or correction. When there is a single-bit error, then an error detected signal is generated (<b>365</b>). The error detected signal can force a miss so that any first data entry accessed when the first hit/miss information was sent from the cached (<b>355</b>) can be disregarded. The single-bit error in the tag can be corrected (<b>370</b>), and the tag and the tag field of the address of requested data are compared (<b>375</b>). Based upon the tag and tag field comparison, a second hit/miss information can be sent from the cache (e.g., a second data entry corresponding to the second hit, a second miss indication, etc.) (<b>380</b>).</p><p>FIG. 4 shows a system in accordance with an embodiment of the present invention. Workstation <b>495</b> includes a system bus <b>475</b> coupled. to a memory <b>490</b>, processor <b>480</b>, and cache <b>200</b>. In one embodiment, cache <b>200</b> corresponds to the cache <b>200</b> illustrated and described in FIG. <b>2</b>. Cache <b>200</b> is coupled to a cache control circuit <b>481</b> of processor <b>480</b>. The cache control circuit <b>481</b> can send the address of requested data to cache <b>200</b>, receive an error detected signal when a single-bit error is detected in a tag entry, and generate an ECC correct signal that is received by the cache <b>200</b>. In one embodiment, the ECC correct signal is based at least in part on the error detected signal, e.g., when the error detected signal is low, the ECC correct signal is low, and data is accessed from the cache <b>200</b> based on a tag comparison performed without a prior detection and correction of single-bit errors in tag entries. When the error detected signal goes high (indicating a single-bit error in a tag entry), the ECC correct signal can go high in response, and data is accessed from the cache <b>200</b> based on a tag comparison performed with detection and correction of a single-bit error in the tag entry.</p><p>In another embodiment of the present invention, the ECC correct signal is based at least in part on the cache micro-operation sent to the cache <b>200</b> from cache control circuit <b>481</b>. In one embodiment, data is initially accessed from the data array <b>202</b> based on a tag comparison performed without prior detection and correction of an error in the tag entry for certain cache micro-operations that are performance critical (e.g., an RLU cache micro-operation, etc.). For other cache micro-operations (e.g., TI, TRR, TWR, TW, EVICT micro-operations, etc.) the cache control circuit can maintain the ECC correct signal at a logical value that causes data access from the cache to be based on a tag comparison performed with prior detection and correction of an error in a tag entry. Requiring data access to be based on a tag comparison performed with prior detection and correction of an error in a tag entry for certain cache micro-operations (e.g., a TI cache micro-operation) can reduce the complexity of handling errors in a tag entry during external snoops to the system.</p><p>In one embodiment, the processor <b>480</b> receives an error detected signal indicating an error in a tag entry and treats the cache micro-operation as resulting in a miss in the cache <b>200</b>. The processor can then forward the cache micro-operation to a next level cache <b>485</b> or a memory <b>490</b>. The processor <b>480</b> can also generate a flush cache directive, which can instruct the next level cache <b>485</b> to initiate a self-snoop into the system when the cache micro-operation appears on the system bus <b>475</b> so that any modified state data in the cache <b>200</b> (i.e., the data in the cache <b>200</b> is valid, but the memory copy of the data is out of date) is provided to the processor <b>480</b> to maintain cache coherency.</p><p>In accordance with one embodiment of the present invention, computer-readable instructions adapted to be executed by a processor to perform a method in accordance with an embodiment of the present invention are stored on a computer-readable medium and distributed as software. The computer-readable medium can a device adapted to store digital information. For example, a computer-readable medium includes a portable magnetic disk, such as a floppy disk; or a Zip® disk, manufactured by the Iomega Corporation of Roy, Utah (Zip® is a registered trademark of Iomega Corporation); or a Compact Disk Read Only Memory (CD-ROM) as is known in the art for distributing software. The computer-readable medium is distributed to a user that has a processor suitable for executing instructions adapted to be executed. The term “adapted to be executed” is meant to encompass any instructions that are ready to be executed in their present form (e.g., machine code) by a processor, or require further manipulation (e.g., compilation, decryption, or provided with an access code, etc.) to be ready to be executed by a processor.</p><p>Embodiments of the present invention can be implemented based on an understanding that single-bit tag entry errors can be rare events from a performance perspective. For certain access to the cache (e.g., those that are not performance critical), error detection and correction can be performed with the corresponding increase in latency. For accesses that are performance critical (e.g., RLUs, etc.), error detection and tag lookup/comparison can proceed in parallel and the results of the error detection are not in the critical path of the data array access. When an error is detected, the then correction can be performed using the deferred methods in accordance with embodiments of the present invention. Accordingly, embodiments of the present invention can provide reduced average latency of data access from the cache.</p><p>In the foregoing detailed description, apparatus and methods in accordance with embodiments of the present invention have been described with reference to specific exemplary embodiments. Accordingly, the present specification and FIGS. are to be regarded as illustrative rather than restrictive.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Varghese", "last_name": "George", "name": ""}, {"first_name": "Michael Robert", "last_name": "Mroczek", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "INTEL CORPORATION"}, {"first_name": "", "last_name": "INTEL CORPORATION", "name": ""}], "ipc_classes": [{"primary": true, "label": "G11C  29/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G11C  29/00        20060101A I20051110RMEP"}, {"label": "G06F  11/10        20060101A I20080531RMEP"}], "national_classes": [{"primary": true, "label": "714805"}, {"primary": false, "label": "714799"}, {"primary": false, "label": "714E11037"}], "ecla_classes": [{"label": "G06F  11/10M6"}], "cpc_classes": [{"label": "G06F  11/1064"}, {"label": "G06F  11/1064"}], "f_term_classes": [], "legal_status": "Expired - Fee Related", "priority_date": "1999-12-16", "application_date": "1999-12-16", "family_members": [{"ucid": "US-6502218-B1", "titles": [{"lang": "EN", "text": "Deferred correction of a single bit storage error in a cache tag array"}]}]}