{"patent_number": "US-6373770-B1", "publication_id": 72959343, "family_id": 19537931, "publication_date": "2002-04-16", "titles": [{"lang": "EN", "text": "Integrated circuit memory devices with configurable block decoder circuits"}], "abstracts": [{"lang": "EN", "paragraph_markup": "<abstract lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PA50300746\"><p>A memory device includes a memory array and a configurable decoder circuit operatively associated with the memory array and configurable to one of a first state or a second state. In the first state, the configurable decoder circuit is operative, responsive to receipt of an address associated with a portion, e.g., a block, of the memory array, to select the portion while producing a first status signal. In the second state, the configurable decoder circuit is operative, responsive to receipt of an address associated with the portion of the memory array, to prevent selection of the portion while producing a second status signal. The first status signal may indicate, for example, that the portion is valid, while the second status signal may indicate that the portion is invalid. The configurable decoder circuit may include a plurality of configurable block decoder circuits, a respective one of which is coupled to a respective one of a plurality of memory blocks and configurable to one of a first state or a second state. In the first state, the configurable block decoder circuit is operative, responsive to receipt of an address associated with the corresponding memory block, to select the corresponding memory block while producing a first status signal. In the second state, the configurable block decoder circuit is operative, responsive to receipt of an address associated with the corresponding memory block, to prevent selection of the corresponding memory block while producing a second status signal. Related memory device operating methods are also discussed.</p></abstract>"}], "claims": [{"lang": "EN", "claims": [{"num": 1, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00001\" num=\"1\"><claim-text>1. A memory device, comprising:</claim-text><claim-text>a memory array including a plurality of memory blocks; and </claim-text><claim-text>a plurality of configurable block decoder circuits, respective ones of which are operatively associated with respective memory blocks of said plurality of memory blocks, wherein said configurable block decoder circuits are individually configurable to one of a first state or a second state, </claim-text><claim-text>wherein each of said configurable block decoder circuits in the first state is operative, responsive to receipt of a block address associated with the associated memory block, to select the associated memory block while producing a first status signal, and </claim-text><claim-text>wherein each of said configurable block decoder circuits in the second state is operative, responsive to receipt of the block address associated with the associated memory block, to prevent selection of the associated memory block without selection of an alternative memory block while producing a second status signal. </claim-text></claim>"}, {"num": 2, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00002\" num=\"2\"><claim-text>2. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00001\">claim 1</claim-ref>, wherein the first status signal indicates that the corresponding memory block is valid, and wherein the second status signal indicates that the corresponding memory block is invalid.</claim-text></claim>"}, {"num": 3, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00003\" num=\"3\"><claim-text>3. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00001\">claim 1</claim-ref>, wherein at least one of said configurable block decoder circuits is fuse-programmable.</claim-text></claim>"}, {"num": 4, "parent": 1, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00004\" num=\"4\"><claim-text>4. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00001\">claim 1</claim-ref>, wherein at least one of the configurable block decoder circuits comprises:</claim-text><claim-text>a block address decoder circuit that receives block addresses and that generates an address decoder output signal, said block address decoder output signal taking on a first state in response to a select block address and taking on a second state in response to a block address other than said select block address; and </claim-text><claim-text>a programmable status signal generating circuit responsive to said block address decoder circuit and including a programmable element, wherein said programmable status signal generating circuit is operative to produce a status signal in response to the block address decoder output signal, said status signal having one of a first state or a second state depending on a state of said programmable element. </claim-text></claim>"}, {"num": 5, "parent": 4, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00005\" num=\"5\"><claim-text>5. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00004\">claim 4</claim-ref>, wherein said programmable element comprises a fuse.</claim-text></claim>"}, {"num": 6, "parent": 4, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00006\" num=\"6\"><claim-text>6. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00004\">claim 4</claim-ref>:</claim-text><claim-text>wherein said at least one of the configurable block decoder circuits further comprises a memory block control signal generating circuit responsive to said block address decoder circuit and to said status signal generating circuit and operative to produce a memory block control signal therefrom, said memory block control signal taking on a first state when said block address decoder output signal is in said first state and said status signal is in said first state and taking on a second state when said block address decoder output signal is in said first state and said status signal is in said second state; and </claim-text><claim-text>wherein said corresponding memory block is responsive to said memory block control signal. </claim-text></claim>"}, {"num": 7, "parent": 4, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00007\" num=\"7\"><claim-text>7. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00004\">claim 4</claim-ref>, further comprising a status output circuit responsive to said block address decoder output signal and to said status signal, said status output circuit producing a status output signal taking on a first state when said block address decoder output signal is in said first state and said status signal is in said first state and taking on a second state when said block address decoder output signal is in said first state and said status signal is in said second state.</claim-text></claim>"}, {"num": 8, "parent": 4, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00008\" num=\"8\"><claim-text>8. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00004\">claim 4</claim-ref>:</claim-text><claim-text>wherein the block address decoder circuit comprises a multi-input NAND gate circuit that generates the block address decoder output signal; and </claim-text><claim-text>wherein the programmable status signal generating circuit comprises: </claim-text><claim-text>a first inverter that receives the block address decoder output signal and generates an inverted block decoder output signal therefrom; </claim-text><claim-text>an NMOS transistor having a gate electrode that receives the inverted block decoder output signal and a source electrode coupled to a signal ground node; </claim-text><claim-text>a fuse connected between a drain electrode of the NMOS transistor and a power supply node; and </claim-text><claim-text>a second inverter having an input coupled to the drain electrode of the NMOS transistor and that produces the status signal from a signal at the drain electrode of the NMOS transistor. </claim-text></claim>"}, {"num": 9, "parent": 8, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00009\" num=\"9\"><claim-text>9. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00008\">claim 8</claim-ref>, further comprising:</claim-text><claim-text>a discharge circuit comprising series connected second and third NMOS transistors, wherein the second NMOS transistors has gate electrode that receives the status signal and a source electrode coupled to a drain electrode of the third NMOS transistor, and wherein the third NMOS transistor has a gate electrode that receives the inverted block address decoder output signal and a source electrode coupled to the signal ground; and </claim-text><claim-text>a status output circuit comprising a buffer circuit with a depletion-mode transistor coupled to an input thereof, the depletion-mode transistor having a drain electrode coupled to the power supply node and gate and source electrodes coupled to a drain electrode of the second NMOS transistor. </claim-text></claim>"}, {"num": 10, "parent": -1, "type": "independent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00010\" num=\"10\"><claim-text>10. An integrated circuit memory device, comprising:</claim-text><claim-text>a memory array including a plurality of memory blocks; and </claim-text><claim-text>a configurable block decoder circuit configurable to generate a status signal in response to receipt of an address for one of said plurality of memory blocks of said memory array in lieu of selecting any of said plurality of memory blocks, wherein said configurable block decoder circuit is configurable to one of: </claim-text><claim-text>a first state in which said configurable block decoder circuit is operative, responsive to receipt of the address associated with the one memory block of the plurality of memory blocks, to select said one memory block while generating a first status signal; and </claim-text><claim-text>a second state in which said configurable block decoder circuit is operative, responsive to receipt of the address signal associated with said one memory block, to prevent selection of said one memory block while generating a second status signal. </claim-text></claim>"}, {"num": 11, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00011\" num=\"11\"><claim-text>11. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00010\">claim 10</claim-ref>, wherein said configurable block decoder circuit is fuse-programmable.</claim-text></claim>"}, {"num": 12, "parent": 10, "type": "dependent", "paragraph_markup": "<claim id=\"US-6373770-B1-CLM-00012\" num=\"12\"><claim-text>12. A memory device according to <claim-ref idref=\"US-6373770-B1-CLM-00010\">claim 10</claim-ref>, wherein the second status signal indicates that said one of said plurality of memory blocks of said memory array is invalid.</claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES53546153\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>FIELD OF THE INVENTION</h4><p>The present invention relates to integrated circuit devices and methods of operation thereof, and more particularly, to integrated circuit memory devices and methods of operation thereof.</p><h4>BACKGROUND OF THE INVENTION</h4><p>Integrated circuit memory devices, such as nonvolatile memory devices (commonly referred to as “flash” memories), typically include a memory cell array divided into plural memory cell blocks, each of the memory cell blocks representing an erase unit. Each memory cell block typically has multiple pages (word lines) to which multiple memory cells are connected.</p><p>Generally, rewrite times of such devices are limited by such factors as program erase cycle time. Weak memory cells in the array may be detected by testing the device under predetermined conditions, in what is commonly referred to as a cycling test. In such a test, write and erase operations typically are repeatedly performed under unfavorable conditions. Blocks having one or more cells with excessive leakage current are preferably avoided during a cycling test, because of the high voltage typically used for erasing and writing.</p><p>As is well known in the art, a column or row redundancy scheme may be used to repair a memory device with one or more defective memory cells, but the number of cells that need repair can exceed the available number of redundant cells. Even if a device includes an invalid block, however, it can still be used in some applications. The device manufacturer can provide a user with information indicating the invalid block (or information indicating valid blocks) stored in the device itself. Using this information, the user can avoid an invalid block of the device by means of an address mapping (e.g., an invalid block table).</p><p>A flow diagram for describing a method of identifying an invalid block in the device according to the prior art is illustrated in FIG. 1. A block addresses BLK applied to the device is initialized to ‘0’ (step S<b>10</b>), and a corresponding block is selected and read (step S<b>11</b>). The data read is checked to determine whether the selected block is valid or invalid (step S<b>12</b>). If the selected block is invalid, an invalid block table is updated (step S<b>13</b>). The invalid block table may be maintained by a computer or other data processing system (e.g., a microcontroller), and stored in a storage device (e.g., a buffer in the microcontroller). If the selected block is valid and the address is not equal to the last address of the device, the address is incremented and a new block is selected and tested (steps S<b>14</b>, S<b>15</b>, S<b>11</b>, S<b>12</b>). This incremental testing continues until all of the memory blocks are checked.</p><p>As described above, it is desirable to avoid blocks having cells with high leakage currents when a cycling test is performed. However, if knowledge of these cells is not available or incomplete, a device with such a defect may be classified as a fail device without regard to the number of the invalid memory cell blocks, which can lead to reduced yield in manufacturing.</p><h4>SUMMARY OF THE INVENTION</h4><p>In light of the foregoing, it is an object of the present invention to provide memory devices and methods of operation thereof in which a status of a memory block can be determined without accessing the memory block.</p><p>It is another object of the present invention to provide memory devices and methods of operation thereof in which invalid cells can be identified and avoided during memory cycling tests.</p><p>These and other objects, feature and advantages are provided according to the present invention by memory devices and methods of operation thereof in which a decoder circuit is configurable to generate a status signal in response to receipt of an address for a portion, e.g., a block, of a memory array, in lieu of selecting the portion. In this manner, a block containing an invalid cell, e.g., a cell with undesirably high leakage current, can be identified as such during a test such as a cycling test, without actually accessing the block.</p><p>According to exemplary embodiments, a configurable decoder circuit includes a plurality of fuse-programmable block decoder circuits, a respective one of which is coupled to a memory block. A block decoder circuit may be configured to a first state in which it is operative, responsive to receipt of an address associated with the corresponding memory block, to select the memory block while generating a first status signal, e.g., a status signal indicating that the block is valid. Alternatively, the block decoder circuit may be configured to a second state in which it is operative, responsive to receipt of the address signal associated with the corresponding memory block, to prevent selection of the memory block while generating a second status signal, e.g., a signal indicating that the block is invalid. The first and second status signals may be provided by taking a signal produced by a status signal generating circuit to a first state or a second state.</p><p>According to embodiments of the present invention, a memory device includes a memory array and a configurable decoder circuit operatively associated with the memory array and configurable to one of a first state or a second state. In the first state, the configurable decoder circuit is operative, responsive to receipt of an address associated with a portion of the memory array, to select the portion while producing a first status signal. In the second state, the configurable decoder circuit is operative, responsive to receipt of an address associated with the portion of the memory array, to prevent selection of the portion while producing a second status signal. The first status signal may indicate, for example, that the portion is valid, while the second status signal may indicate that the portion is invalid.</p><p>In other embodiments of the present invention, the memory array includes a plurality of memory blocks. The configurable decoder circuit includes a plurality of configurable block decoder circuits, a respective one of which is coupled to a respective one of the plurality of memory blocks and configurable to one of a first state or a second state. In the first state, a configurable block decoder circuit is operative, responsive to receipt of an address associated with the corresponding memory block, to select the corresponding memory block while producing a first status signal. In the second state, a configurable block decoder circuit is operative, responsive to receipt of an address associated with the corresponding memory block, to prevent selection of the corresponding memory block while producing a second status signal.</p><p>In yet another embodiment of the present invention, a configurable block decoder circuit includes an address decoder circuit that receives addresses and that generates an address decoder output signal. The address decoder output signal takes on a first state in response to a particular address and takes on a second state in response to an address other than the particular address. A programmable status signal generating circuit is responsive to the address decoder circuit and includes a programmable element, such as a fuse. The programmable status signal generating circuit is operative to produce a status signal in response to the address decoder output signal, the status signal having one of a first state or a second state depending on a state of the programmable element.</p><p>The configurable block decoder circuit may further include a memory block control signal generating circuit responsive to the address decoder circuit and to the status signal generating circuit and operative to produce a memory block control signal therefrom. The memory block control signal takes on a first state when the decoder output signal is in the first state and the status signal is in the first state, and takes on a second state when the address decoder output signal is in the first state and the status signal is in the second state. The corresponding memory block is responsive to the memory block control signal.</p><p>The memory device may further include a status output circuit responsive to the address decoder output signal and to the status signal. The status output circuit produces a status output signal that takes on a first state when the address decoder output signal is in the first state and the status signal is in the first state and takes on a second state when the address decoder output signal is in the first state and the status signal is in the second state.</p><p>Related memory device operating methods are also discussed.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a flowchart illustrating testing operations for a memory device according to the prior art.</p><p>FIG. 2 is a block diagram of a memory device according to an embodiment of the present invention.</p><p>FIG. 3 is a schematic diagram of a configurable block decoder circuit according to an embodiment of the present invention.</p><p>FIG. 4 is a flowchart illustrating exemplary operations for testing a memory device according to an aspect of the present invention.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION OF EMBODIMENTSI</h4><p>The present invention now will be described more fully hereinafter with reference to the accompanying drawings, in which preferred embodiments of the invention are shown. This invention may, however, be embodied in many different forms and should not be construed as limited to the embodiments set forth herein; rather, these embodiments are provided so that this disclosure will be thorough and complete, and will fully convey the scope of the invention to those skilled in the art. In the drawings, the thickness of layers and regions are exaggerated for clarity. Like numbers refer to like elements throughout. It will be understood that when an element such as a layer, region or substrate is referred to as being “on” another element, it can be directly on the other element or intervening elements may also be present. In contrast, when an element is referred to as being “directly on” another element, there are no intervening elements present. Moreover, each embodiment described and illustrated herein includes its complementary conductivity type embodiment as well.</p><p>FIG. 2 illustrates a nonvolatile memory device <b>100</b> according to an embodiment of the present invention. A memory cell array <b>110</b> includes a plurality of memory cell blocks <b>110</b><i>a</i>, <b>110</b><i>b</i>, . . . , <b>110</b><i>c</i>, a respective one of which constitutes an erase unit. Each memory cell block <b>110</b><i>a</i>, <b>110</b><i>b</i>, . . . , <b>110</b><i>c </i>includes a plurality of memory cells (not shown) that store data and are arranged in rows and columns. A plurality of word lines (not shown) extends along the direction of the rows, while a plurality of bit lines (not shown) extend along the direction of the columns.</p><p>The device <b>100</b> further includes a configurable decoder circuit <b>120</b> that selects one of the memory cell blocks <b>110</b><i>a</i>, <b>110</b><i>b</i>, . . . , <b>110</b><i>c </i>in accordance with an address supplied on block address lines BLKADDi. The configurable decoder circuit <b>120</b> includes a plurality of configurable block decoder circuits <b>120</b><i>a</i>, <b>120</b><i>b</i>, . . . , <b>120</b><i>c</i>, a respective one of which is coupled to a respective one of the memory cell blocks <b>110</b><i>a</i>, <b>110</b><i>b</i>, . . . , <b>110</b><i>c</i>. The configurable block decoder circuits <b>120</b><i>a</i>, <b>120</b><i>b</i>, . . . , <b>120</b><i>c </i>are also commonly connected to an input node ND of a status output circuit <b>140</b>. Each of the block decoder circuits <b>120</b><i>a</i>, <b>120</b><i>b</i>, . . . , <b>120</b><i>c </i>is connected to the block address lines BLKADDi. A respective one of the configurable block decoder circuits <b>120</b><i>a</i>, <b>120</b><i>b</i>, . . . , <b>120</b><i>c </i>is selected for a respective address applied to the block address lines BLKADDi, with the selected configurable block decoder circuit generating a control signal that selects the memory cell block associated with the address applied to the block address lines BLKADDi.</p><p>In addition, the selected configurable block decoder circuit produces a status signal at the input node ND of the output circuit <b>140</b>, the status signal indicating whether the selected memory cell block is valid or invalid. The output circuit <b>140</b> responsively produces a status output signal BLKINFORM at the exterior of the device <b>100</b>. Operations of the configurable block decoder circuit <b>120</b><i>a </i>and the status output circuit <b>140</b> will be described below, but the description thereof is equally applicable to the other configurable block decoder circuits <b>120</b><i>b</i>, . . . , <b>120</b><i>c. </i></p><p>A circuit diagram of an exemplary configurable block decoder circuit <b>120</b><i>a </i>and an exemplary status output circuit <b>140</b> is provided in FIG. <b>3</b>. Referring to FIG. 3, the configurable block decoder circuit <b>120</b><i>a </i>includes an address decoder circuit (NAND gate) <b>121</b>, a memory block control signal generating circuit (NOR gate) <b>122</b>, a fuse-programmable status signal generating circuit <b>127</b>, and a discharge circuit <b>130</b> that links the programmable status signal generating circuit <b>127</b> to the status output circuit <b>140</b>. The NAND gate <b>121</b> decodes an address applied to the address lines BLKADDi, responsively generating an address decoder output signal A.</p><p>The programmable status signal generating circuit <b>127</b> may be used to store valid/invalid block information about the memory block associated with the configurable block decoder circuit <b>120</b><i>a</i>. The programmable status signal generating circuit includes two inverters <b>123</b>, <b>126</b>, a fuse <b>124</b>, and an NMOS transistor <b>125</b>. The fuse <b>124</b> has a first end connected to a power supply bus Vcc and a second end connected to a drain of the NMOS transistor <b>125</b>. The NMOS transistor <b>125</b> has a source electrode coupled to a signal ground Vss and a gate electrode that receives an inverted version of the address decoder output signal A from the inverter <b>123</b>.</p><p>The fuse <b>124</b> may include, for example, a laser fuse, transistor, or other element that may be programmed into one of a conducting and a non-conducting state. The inverter <b>126</b> is connected to both the drain of the NMOS transistor <b>125</b> and the second end of the fuse <b>124</b> at a node <b>131</b>. The inverter <b>126</b> inverts the signal at the node <b>131</b>, producing a status signal B.</p><p>The NOR gate <b>122</b> produces a memory block control signal BLKSEL in response to the address decoder output signal A and the status signal B. The discharge circuit <b>130</b> controls the voltage at the input node ND of the output circuit <b>140</b> responsive to the status signal B and the inverted address decoder output signal C produced by the inverter <b>123</b>. The discharge circuit <b>130</b> includes two NMOS transistors <b>128</b>, <b>129</b> that have current paths connected in series between the input terminal ND and the signal ground Vss, and gate electrodes that receive the status signal B and the inverted address decoder output signal C, respectively. The output circuit <b>140</b> supplies the input node ND with a voltage approaching that of the power supply bus Vcc via a depletion-mode transistor <b>141</b>, and outputs a status output signal BLKINFORM through series-connected inverters <b>142</b>, <b>143</b> responsive to the signal applied to the input node ND.</p><p>Operations of the configurable block decoder circuit <b>120</b><i>a </i>and the status output circuit <b>140</b> according to the preferred embodiment of the present invention will now be discussed with reference to FIG. <b>3</b>. When an address corresponding to the memory block associated with the configurable block decoder circuit <b>120</b><i>a </i>is applied to the block address lines BLKADDi, and thus to the NAND gate <b>121</b>, the NAND gate <b>121</b> generates a logic “low” state in the address decoder output signal A; otherwise, the address decoder output signal A remains at a logic “high.” When the address decoder output signal A is “low,” the NMOS transistors <b>125</b>, <b>129</b> are turned on through the inverter <b>123</b>, and the input node ND of the status output circuit <b>140</b> is charged up to the voltage of the power supply bus Vcc through the depletion-mode transistor <b>141</b>.</p><p>If the fuse <b>124</b> is intact, indicating that the corresponding memory cell block is valid, the signal at the node <b>131</b> goes to a logic “high” via the action of the intact fuse <b>124</b>. Consequently, the status signal B goes to a logic “low,” and the NOR gate <b>122</b> drives the memory block control signal BLKSEL to a logic “high,” selecting the corresponding memory block. Because the status signal B is “low,” the NMOS transistor <b>128</b> is turned off, so that the input node l ND of the status output circuit <b>140</b> and the status output signal BLKINFORM are logic “high.”</p><p>If the fuse <b>124</b> is opened, however, the node <b>131</b> goes to a logic “low” via the action of the turned-on NMOS transistor <b>125</b>. The status signal B from the inverter <b>126</b> goes to a logic “high,” and the NOR gate <b>122</b> takes the memory block control signal BLKSEL to a logic “low,” preventing selection of the corresponding memory block even though the address applied to the block address lines BLKADDi corresponds to the memory block.</p><p>Because the status signal B is at a logic “high,” the NMOS transistor <b>128</b> of the discharge circuit <b>130</b> turns on, causing the input node ND of the status output circuit <b>140</b> to be discharged to near the signal ground Vss through the NMOS transistors <b>128</b>, <b>129</b>. Consequently, the status output signal BLKINFORM from the status output circuit <b>140</b> is taken to a logic “low,” indicating that the corresponding memory cell block is invalid.</p><p>As set forth above, each configurable block decoder circuit <b>120</b><i>a</i>, <b>120</b><i>b</i>, . . . , <b>120</b><i>c </i>provides valid/invalid block information and either allows or prevents a corresponding memory cell block to be selected in keeping with the valid/invalid block information. Thus, for example, when the corresponding memory cell block is invalid (e.g., when the memory cell block has a memory cell with high leakage current), the fuse in the corresponding configurable block decoder circuit can be blown, preventing access to the memory cell block. Accordingly, a cycling test can be performed while avoiding selection of the block</p><p>FIG. 4 is a flowchart illustrating exemplary operations for identifying invalid blocks in a memory device according to an aspect of the present invention. A block address BLK (e.g., an address applied to the address lines BLKADDi of FIG. 3) is initialized to ‘0’ (step S<b>200</b>). The validity or invalidity of the corresponding address may then be checked, without requiring actual selection (e.g., reading or other access) of the block, using the circuit of FIG. 3 (step S<b>210</b>). If the status output signal produced indicates that the block is invalid, the address of the invalid block may be added to an invalid block table (step S<b>220</b>). Otherwise, if the block address is not the last block address, the block address is incremented and the next block is checked (steps S<b>230</b>, S<b>240</b>, S<b>210</b>).</p><p>In the drawings and specification, there have been disclosed typical preferred embodiments of the invention and, although specific terms are employed, they are used in a generic and descriptive sense only and not for purposes of limitation, the scope of the invention being set forth in the following claims.</p><?DETDESC description=\"Detailed Description\" end=\"tail\"?></description>"}], "inventors": [{"first_name": "Suk-Chun", "last_name": "Kwon", "name": ""}], "assignees": [{"first_name": "", "last_name": "", "name": "SAMSUNG ELECTRONICS CO., LTD."}, {"first_name": "", "last_name": "SAMSUNG ELECTRONICS CO., LTD.", "name": ""}], "ipc_classes": [{"primary": true, "label": "G11C   7/00"}], "locarno_classes": [], "ipcr_classes": [{"label": "G11C   8/12        20060101A I20051008RMEP"}], "national_classes": [{"primary": true, "label": "3652257"}, {"primary": false, "label": "711152"}, {"primary": false, "label": "714723"}, {"primary": false, "label": "326038"}, {"primary": false, "label": "714003"}, {"primary": false, "label": "714042"}, {"primary": false, "label": "365231"}, {"primary": false, "label": "365200"}, {"primary": false, "label": "71400613"}], "ecla_classes": [{"label": "G11C   8/12"}], "cpc_classes": [{"label": "G11C   8/12"}, {"label": "G11C  16/00"}, {"label": "G11C   8/12"}], "f_term_classes": [], "legal_status": "Expired - Lifetime", "priority_date": "1998-05-29", "application_date": "1999-05-28", "family_members": [{"ucid": "KR-19990086742-A", "titles": [{"lang": "KO", "text": "불 휘발성 반도체 메모리 장치 및 그 장치의 무효 메모리 블록데이블 세팅 방법"}, {"lang": "EN", "text": "Nonvolatile semiconductor memory device and method for setting invalid memory block table thereof"}]}, {"ucid": "KR-100284904-B1", "titles": [{"lang": "KO", "text": "불 휘발성 반도체 메모리 장치 및 그 장치의 무효 메모리 블록데이블 세팅 방법"}, {"lang": "EN", "text": "Nonvolatile semiconductor memory device and method for setting invalid memory block table thereof"}]}, {"ucid": "US-6373770-B1", "titles": [{"lang": "EN", "text": "Integrated circuit memory devices with configurable block decoder circuits"}]}]}